{"id":"34","title":"Ginger and honey biscuit cake with choc-orange icing","difficulty":"Medium","portion":"Serves 14-16","time":"Hands-on 1 hour, oven 20 min, plus 5-6 hours chilling","description":"For a truly show-stopping dessert, try this Russian-inspired cake made from layered honey and orange biscuits, which have softened after soaking in the cream cheese icing.","ingredients":["200g clear honey","130g caster sugar","150g unsalted butter","3 large free-range eggs, beaten","1 tsp baking powder","2 tsp ground ginger","Finely grated zest 1 orange","600g plain flour, plus extra to dust","200g caster sugar","2 clementines, unpeeled, sliced horizontally very thinly","650g cream cheese (we like Philadelphia)","250g unsalted butter, at room temperature","Finely grated zest 2 oranges","120g icing sugar","3 tbsp clear honey","100g dark chocolate, chopped","1 tsp sunflower oil","2 (or more) large baking sheets lined with non-stick baking paper","20cm round cake tin"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Melt the honey, sugar and butter in a large pan over a medium heat. Bring to a simmer and bubble for 5 minutes until a slightly darker shade of brown. Turn off the heat and leave to stand for 8-10 minutes until cool enough to touch."},{"Step 2":"Gradually pour the beaten eggs into the cooled mixture, beating with a balloon whisk until fully combined."},{"Step 3":"Add the baking powder, ground ginger, zest, flour and a pinch of salt, then mix well using a wooden spoon. The dough is soft like gingerbread dough and takes about 5 minutes to properly combine. Weigh, then divide into 10 pieces (about 110g each)."},{"Step 4":"Shape each piece into a disc then, on a well floured surface, roll one into a 2-3mm thick circle just larger than 20cm in diameter. Use a 20cm cake tin to cut out a disc of dough. Use a cake lifter or cake tin base to transfer to one end of a lined baking sheet. Repeat with another 3 dough pieces, putting discs on each lined sheet, then bake for 7-8 minutes until golden and cooked through. Leave to firm up for 5 minutes, then carefully transfer to a wire rack to cool completely. Repeat with the remaining dough."},{"Step 5":"Once the biscuits are cooked, make the candied clementines. Turn the oven down to 120°C/100°C fan/gas ½. Put the sugar in a pan with 200ml water and bring to the boil, stirring to dissolve. Add the clementine slices, reduce to a simmer and cook for 3-4 minutes. Drain, lay out on a baking sheet lined with non-stick baking paper and bake for 50-60 minutes."},{"Step 6":"Meanwhile, make the icing. In a large mixing bowl, beat the cream cheese, butter and zest with an electric whisk until smooth. Add the icing sugar and honey, then whisk again until smooth and creamy."},{"Step 7":"Put one biscuit on a large plate, spread evenly with 3-4 tbsp of icing using a palette knife and top with another biscuit. Repeat using up all the biscuits, then spread the rest of the icing over the top and sides of the biscuits. Use a palette knife to gently scrape the icing around the sides until you can just see the edges of the biscuits, then chill in the fridge for at least 30 minutes to set."},{"Step 8":"Meanwhile, in a heatproof bowl, melt the chocolate over a pan of simmering water (don’t let the bowl touch the water), then mix in the sunflower oil. Remove the cake from the fridge, drizzle over a little chocolate, then spread it over the icing with a palette knife to create a swirling pattern. Keep adding more chocolate and spreading it across the cake. When you’re happy with your swirl, drizzle over the rest of the chocolate, Jackson Pollock style. Return to the fridge to set for at least 2 hours. Decorate the top with the candied clementines."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/34.jpg"}