{"id":"16","title":"Summer-cup bundt drizzle cake","difficulty":"Easy","portion":"Serves 12","time":"Hands-on time 35 min, oven time 3 hours, plus cooling","description":"Celebrate summer in style with Felicity Cloake‘s boozy bundt drizzle cake. She says:","ingredients":["280g ground almonds","90g plain flour","280g butter, softened","325g caster sugar, plus 1 tbsp","6 medium free-range eggs, beaten","Grated zest and juice 2 lemons","80ml gin, preferably cucumber flavoured","80ml red vermouth","30ml triple sec","2 dashes bitters","2 tbsp agave syrup","1 whole orange, plus juice ½","130g icing sugar","400g punnet strawberries","1 apple","¼ cucumber","1 small bunch fresh mint","23cm bundt tin, well greased with butter and chilled"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Mix the ground almonds and flour in a medium mixing bowl with a pinch of salt, then set aside. Beat the butter in a stand mixer, or in a mixing bowl using an electric hand mixer, until it has the consistency of mayonnaise from a jar. Add the 325g sugar and beat on a medium speed for about 5 minutes until very light and fluffy, periodically scraping down the sides of the bowl."},{"Step 2":"Beat the eggs into the butter and sugar mixture, one third at a time, letting the batter just come together before the next addition. Don’t worry if it splits with the last addition."},{"Step 3":"Turn down the speed and add the almonds/flour, one third at a time, until combined – but don’t over-mix."},{"Step 4":"Put the lemon zest into a jug and add 50ml gin, 50ml vermouth, 20ml triple sec and a dash of bitters. Put a large spoonful of the cake batter in a small bowl, beat in the lemon zest cocktail, then fold into the rest of the batter with a large metal spoon."},{"Step 5":"Sprinkle the 1 tbsp caster sugar into the greased bundt tin, turning to coat the inside completely. Gently spoon in the batter, then bake for 1 hour until golden and a skewer pushed into the deepest part of the cake comes out clean. Leave in the tin for 15 minutes, then turn out onto a plate."},{"Step 6":"Whisk the agave syrup with the remaining alcohol and bitters, and the juice of the 2 lemons, then pour two thirds of the mixture over the warm cake. When the cake has cooled, mix the orange juice with the icing sugar and drizzle over."},{"Step 7":"Roughly chop the strawberries, peel and cut the orange into discs, slice the apple and peel the cucumber into ribbons (see Make Ahead). Put into a plastic tub with the remaining alcoholic syrup and a handful of chopped mint (reserve a few sprigs to garnish). At the picnic, top the cake with the fruit and the reserved mint."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/16.jpg"}