{"id":"33","title":"White forest gateau","difficulty":"Medium","portion":"Serves 12","time":"Hands-on time 40 min, oven time 35 min, plus cooling","description":"Three layers of sponge are sandwiched together with white chocolate and kirsch cherries to make a decadent white forest gateau – suitable for afternoon teas, birthdays or a celebration of cake.","ingredients":["200g plain flour","2 tsp baking powder","300g caster sugar","5 medium free-range eggs, separated","½ tsp cream of tartar","Zest and juice 1 lemon","115ml vegetable oil, plus extra to grease","390g jar cherries in kirsch, drained, kirsch reserved (we used Opies)","300g white chocolate, in small chunks, plus extra to decorate (optional)","300g mascarpone","150g double cream","3 x 20cm loose-bottomed cake tins, greased, bases lined with non-stick baking paper"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/gas 3½. To make the sponges, sift the flour and baking powder into a large mixing bowl and stir in 200g of the sugar. In another spotlessly clean large mixing bowl whisk the eggs whites until foamy, then whisk in the cream of tartar until the whites form soft peaks when the whisk is removed. Whisk in the remaining 100g sugar a tablespoon at a time until the mixture is glossy and forms stiff peaks."},{"Step 2":"In a separate mixing bowl whisk the egg yolks with the lemon juice until creamy. Make a well in the middle of the flour/sugar and pour in the yolk mixture, oil and lemon zest; beat to form a smooth batter."},{"Step 3":"Using a large metal spoon, gently fold in the whisked whites until just combined. Divide evenly among the 3 prepared cake tins, then tap them sharply on the work surface to release any large air pockets. Bake for 35 minutes or until golden and springy to the touch. Cool for 10 minutes, run a knife around the inside of the tins, then turn out and cool on a wire rack."},{"Step 4":"For the icing, melt the white chocolate in a bowl set over a pan of boiling water (don’t let the water touch the bowl). In a large mixing bowl beat together the mascarpone and cream, then fold into the melted white chocolate."},{"Step 5":"To assemble, trim and level the sponges with a serrated bread knife. Put a sponge on a serving plate or cake stand. Drizzle over 2 tbsp of the kirsch from the jar of cherries, then top with a layer of the white chocolate icing. Dot with a third of the cherries. Put another sponge on top and repeat, then top with the third sponge. Cover the top and sides of the cake with the remaining icing, then chill until ready to serve. To decorate arrange the reserved cherries on the top with white chocolate curls/shavings and drizzle over more reserved kirsch."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/33.jpg"}