{"id":"36","title":"Eric Lanlard’s clementine and pomegranate cake (gluten-free)","difficulty":"Easy","portion":"Serves 12","time":"Preparation time 25 mins, plus cooling and cooking time 2-2½","description":"Eric Lanlard’s gluten-free clementine cake is made with ground almonds and steeped in syrup for a seriously moist texture. Top with pomegranate seeds for a bejewelled effect and serve – it makes an excellent alternative to Christmas cake.","ingredients":["4 clementines or satsumas, unpeeled","1 cinnamon stick","oil, for greasing","6 large eggs","225g light muscovado sugar","1 tsp gluten-free baking powder","300g ground almonds","1 pomegranate, halved","25g light muscovado sugar","1 tsp orange blossom extract","1 tsp vanilla bean paste","3 tbsp apricot jam to make a glaze","icing sugar, for dusting"],"method":[{"Step 1":"Put the clementines or satsumas and cinnamon stick into a medium saucepan, cover with cold water and bring to the boil. Reduce the heat, cover with a lid and simmer for 1–1½  hours, then drain the fruit and remove the cinnamon stick. Leave to cool for 30 minutes, then halve the cooked fruit and discard the pips. Put the fruit, including the peel, into a blender or food processor and blend to a purée. Set aside."},{"Step 2":"Preheat the oven to 180C/160C fan/gas 4. Grease a 23cm diameter, 9cm deep cake tin and line with baking paper. Using an electric hand whisk, whisk the eggs and sugar in a heatproof bowl over a saucepan of barely simmering water for about 5 minutes until pale and mousse-like. Take the bowl off the heat and add the baking powder, ground almonds and the fruit purée. Fold in gently but thoroughly."},{"Step 3":"Spoon the mixture into the prepared tin and bake in the oven for 20 minutes. Reduce the oven temperature to 160C/140C fan/gas 3 and bake for a further 30 minutes, or until a skewer inserted into the centre comes out clean. Leave to cool in the tin for 15 minutes, then transfer to a cooling rack to cool completely."},{"Step 4":"To make the syrup, squeeze the pomegranate halves to extract the juice, reserving the seeds, then pour the juice into a small saucepan. Add the sugar and bring to the boil, then simmer for 2 minutes. Leave to cool slightly (the liquid should still be warm), then stir in the orange blossom extract and vanilla paste. Using a pastry brush, ‘soak’ the cake with the warm pomegranate syrup and leave in the tin until completely cold."},{"Step 5":"To make the apricot glaze, put the jam into a small saucepan and gently warm through, then press through a fine sieve to remove any lumps."},{"Step 6":"Remove the cold cake from the tin and place on a serving plate. If the cake has sunk a little in the middle, you can turn the cake upside-down for a nice flat and even finish. Using a pastry brush, brush the apricot glaze all over the cake, including the sides. Just before serving, scatter the reserved pomegranate seeds over the top of the cake and dust with icing sugar."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/36.jpg"}