{"id":"58","title":"Easy coconut and chocolate cake","difficulty":"Easy","portion":"Serves 16","time":"Takes 30 minutes to make, 40 minutes to bake, plus cooling","description":"Show kids how much fun baking can be – they’ll be converts for life once they’ve tasted this easy coconut and chocolate cake recipe.","ingredients":["350g unsalted butter, plus extra for greasing","150g sweetened tenderised shredded coconut (or desiccated coconut)","350g self-raising flour","350g golden caster sugar","6 large eggs, lightly beaten","200g milk chocolate, broken up"],"method":[{"Step 1":"Preheat the oven to 180°C/fan160°C/gas 4. Grease a deep 23cm round cake tin with butter and line the base with baking paper. Put the butter into a bowl and put in the microwave on high (900W) for 1 minute, or in a pan until almost melted."},{"Step 2":"Put 100g coconut into a large bowl. Add the self-raising flour, sugar, eggs and the almost-melted butter. Mix with a wooden spoon until smooth and combined."},{"Step 3":"Spoon the mixture into the lined tin and bake for 40-50 minutes, or until risen, pale-golden and firm on the surface. A skewer inserted into the centre should come out clean. Turn out and cool on a wire rack."},{"Step 4":"To make a heart template, draw a heart on a 23cm-square piece of paper and cut it out with scissors. Put the paper heart on top of the cake and use a serrated knife to cut around it."},{"Step 5":"Put the chocolate into a heatproof bowl and microwave on high (900W) for 11/2 minutes, or until just melted. (Or rest the bowl over a pan of simmering water, making sure the bowl doesn’t touch the water.) Stir the chocolate until smooth. Sit the wire rack on a baking tray and spread some chocolate around the sides of the cake using a palette knife. Pour the rest of the chocolate over the top, allowing it to trickle down the sides. Sprinkle over the remaining coconut and let the chocolate set. Store in an airtight container in a cool place for up to 3 days, if you like."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/58.jpg"}