{"id":"45","title":"Gluten-free chocolate cake with raspberries","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 30 min; oven time 15 min, plus cooling","description":"We teamed up with Doves Farm to bring you this gluten-free chocolate cake recipe made with potato flour and topped with a rich chocolate icing and raspberries.","ingredients":["75g potato flour","25g cocoa","2tsp baking powder","3 medium free range eggs","100g caster sugar","75g white chocolate, broken into small pieces","75ml double cream","75g double cream","1 tbsp caster sugar","75g dark chocolate, broken into small pieces","15g butter","300g raspberries","½ tsp icing sugar","2x20cm round loose bottom tins- parchment lined"],"method":[{"Step 1":"Heat the oven to 180C/160C fan/gas 4. Sieve the flour, cocoa and baking powder into a large bowl and set aside."},{"Step 2":"Separate the eggs and place the whites into a large clean mixing bowl. Using an electric hand whisk beat the whites until medium-stiff peak. Slowly beat in the sugar to the stiff egg whites one spoonful at a time."},{"Step 3":"In a separate mixing bowl, beat the yolks until they thicken slightly before folding the yolks with a metal spoon into the egg whites."},{"Step 4":"Sieve half of the dry ingredients into the egg mixture and carefully fold the ingredients together using a cutting and folding action with a metal spoon. Repeat with the remaining dry ingredients and combine until the cake mix is smooth."},{"Step 5":"Divide the mixture between the two lined cake tins. Smooth the tops and bake in a heated oven for 15 minutes. Check that a skewer comes out clean, it may need a few more minutes."},{"Step 6":"Remove from the oven and cool for 5 minutes before removing the cake from the tins. Cool on a wire rack."},{"Step 7":"Meanwhile make the filling. Fill a medium saucepan a quarter full with water. Over a medium heat bring to a simmer. Place the white chocolate in a bowl that will sit snugly on the saucepan. Allow the white chocolate to melt slowly then turn off the heat, leaving the bowl sitting on the saucepan."},{"Step 8":"In a medium mixing bowl, using an electric whisk, whip 75ml of cream on a medium speed until thick. Stir in the melted white chocolate."},{"Step 9":"When the cake is completely cool, spread the filling over one half of the cake, then sandwich the other half on top and place on a serving plate."},{"Step 10":"Finally make the icing. In a small saucepan, heat the remaining 75ml of cream, sugar and butter and stir until just coming to the boiling. Add the dark chocolate pieces and stir until melted. Leave to cool for 5 minutes."},{"Step 11":"Spread the icing over the top of the cake and press the raspberries into the warm chocolate icing. Dust the raspberries with icing sugar using a small sieve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/45.jpg"}