{"id":"12","title":"Ginger drizzle traybake with cream cheese icing","difficulty":"Easy","portion":"Makes 16","time":"Hands-on time 15 min, oven time 40-45 min","description":"Rich, moist and sticky, this easy ginger traybake cake is topped with cream cheese icing and slices easily into shareable squares. It’s perfect for afternoon tea party or bake sale.","ingredients":["250g unsalted butter, cubed","125g golden syrup","250g light muscovado sugar","1 tbsp vanilla bean paste","4 large free-range eggs, beaten","300g self-raising flour","1 tbsp ground ginger, plus extra","2 balls stem ginger in syrup, finely chopped, plus 2 tbsp syrup","3 tbsp natural yogurt","Finely grated zest and juice 1 lime","1⁄2 tsp salt","170g unsalted butter, softened","170g golden icing sugar","340g full-fat cream cheese (we used Philadelphia)","Grated zest and juice 1 lime","Small handful crystallised ginger (optional), chopped if large","20cm x 30cm shallow cake tin or brownie tin, greased and lined with non-stick baking paper"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/ gas 31⁄2. Heat the butter, syrup and sugar in a pan until melted and smooth. Remove from the heat, then leave to cool."},{"Step 2":"Once cooled, beat in the vanilla bean paste, eggs, flour, 1 tbsp ground ginger, chopped stem ginger, yogurt, lime zest and juice and salt until smooth and combined."},{"Step 3":"Pour into the prepared tin and level the top. Bake for 40-45 minutes until a skewer pushed into the centre of the cake comes out clean."},{"Step 4":"Remove the cake from the oven, drizzle the stem ginger syrup over the top, then leave to cool in the tin for 10 minutes. Remove the cake from the tin and put on a cooling rack, leaving the baking paper in place, until cooled completely."},{"Step 5":"For the icing, whisk the butter and icing sugar in a bowl until light and fluffy, then whisk in the cream cheese until smooth. Add lime juice to taste. Spoon the icing over the cake, then sprinkle with crystallised ginger, lime zest and extra ground ginger. Cut into squares to serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/12.jpg"}