{"id":"21","title":"Easy butterfly cakes","difficulty":"Easy","portion":"Makes 12","time":"Hands-on time 20 min, oven time 20-25 min","description":"Light-as-air sponge is topped with vanilla buttercream in these almost-too-good-to-eat butterfly cakes. They’re great to make with kids – or as part of a retro afternoon tea.","ingredients":["160g unsalted butter, softened","160g golden caster sugar","3 medium free-range eggs, beaten","160g self-raising flour","2 tsp vanilla bean extract","160g unsalted butter, softened","270g icing sugar","1 tsp vanilla bean extract","12-hole muffin tin","12 cupcake paper muffin cases (we used Dr Oetker)","Disposable piping bag"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/gas 3½. Put all the cupcake ingredients in a large mixing bowl. Using an electric hand mixer or wooden spoon, beat together to a thick smooth batter (this will take about 5 minutes)."},{"Step 2":"Line the muffin tin with the paper cases and evenly spoon in the batter. Bake for 20-25 minutes until risen, golden and a skewer inserted into the centre comes out clean. Leave to cool in the tin on wire rack."},{"Step 3":"Meanwhile, make the buttercream. Put the softened butter in a large mixing bowl and beat using an electric hand mixer or wooden spoon. Add half the icing sugar and beat until combined, then add the remaining sugar with the vanilla. Whisk or beat until smooth and paler in colour."},{"Step 4":"Use a small palette knife to spread dollops of icing onto the cooled cupcakes. Or, to make butterfly cakes, use a small sharp knife to cut a circle of cake out of the top of each cupcake leaving a small border no more than 1cm deep. Cut the cake circle in half to make butterfly wings."},{"Step 5":"Fill a disposable piping bag with the icing and cut off the (no need for a nozzle). Pipe the icing on top of the small holes in the cakes then place the cake wings on top. Sieve over icing sugar and enjoy straightaway or put in a sealable container and eat over the next few days."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/21.jpg"}