{"id":"2","title":"Lemon and blackberry stripe cake","difficulty":"A challenge","portion":"Serves 10-12","time":"Hands-on time 1 hour 40 min, plus cooling. Oven time 2 hours 15 min","description":"This pretty blackberry cake is an eye-catching centrepiece for any birthday or bake sale. The real drama comes when cutting it open to reveal the vertical stripes of sponge. Don’t worry, it’s easier to make than you think, and the vast majority of oven time is waiting for the candied lemons to cook through.","ingredients":["1 lemon, cut into 3mm slices","50g golden caster sugar","8 medium free-range eggs, separated","130g golden caster sugar","Finely grated zest 2 lemons, plus 1 tbsp juice","70g plain flour","Icing sugar to dust","100g blackberries, plus extra to decorate","1 tsp lemon juice","2 medium free-range egg whites","135g golden caster sugar","200g unsalted butter, cubed, at room temperature, plus extra to grease","42cm x 30cm shallow baking tray","Stand mixer"],"method":[{"Step 1":"Heat the oven to 100°C fan/gas ½. To make the candied lemons, put the sugar and 30ml water in a small frying pan. Bring to the boil and allow to simmer for a minute or two, until syrupy. Add the lemon slices in one layer across the base of the pan. Simmer for 10 minutes, turning halfway, until tender, then lift onto a lined baking tray. Bake for 2 hours, turning halfway, to stiffen a little. Set aside to cool."},{"Step 2":"Increase the oven temperature to 180°C fan/gas 6. Grease and line a shallow 42cm x 30cm baking tray with butter and baking paper. Put the egg yolks, sugar and lemon juice in the bowl of an electric mixer fitted with a whisk attachment and whisk on a medium-high speed for about 3 minutes, until thick and pale. Sift in the flour and add a pinch of salt and the lemon zest. Gently fold together until just combined."},{"Step 3":"In a separate bowl, whisk the egg whites with clean beaters until they form stiff peaks. Mix a spoonful of the egg whites into the cake batter until combined, then gently fold in the rest. Scrape into the prepared baking tray and spread evenly to create a smooth, level top. Bake for 14-15 minutes, until golden and a skewer inserted comes out clean."},{"Step 4":"Put the tray on a wire rack to cool for 5 minutes, then dust the top lightly with icing sugar and cover with a sheet of baking paper topped with a clean tea towel. Carefully flip the tray over and remove both it and the baking paper. Use a serrated knife to trim the edges of the cake, trying to remove as little as possible, just to get them straight (these are a great cook’s snack). Starting from one of the shorter sides, carefully roll up the cake into a tight coil, then leave to cool completely (about 30 minutes)."},{"Step 5":"Meanwhile, make the buttercream. Put the blackberries in a blender with the lemon juice, whizz until smooth, then pass through a sieve and set aside. Put the egg whites and sugar in a large heatproof bowl (save on washing up by using the one from your mixer) and set over a pan of simmering water. Whisk the mixture lightly until the sugar has dissolved. To test, dip 2 fingers into the whites and rub together; if you can still feel grains of sugar, it needs a little more time."},{"Step 6":"Remove from the heat, add a pinch of salt and whisk with an electric mixer fitted with a whisk attachment on medium-high for 5-6 minutes until a thick, glossy meringue has formed and can hold peaks. Continue to whisk, adding the butter a piece at a time. Once it’s all added you should have a silky buttercream. Fold in 100ml of the whizzed blackberries."},{"Step 7":"Once the cake is cool, unroll it and cut the cake into three long strips, cutting parallel to the long side using a ruler and a serrated knife or pizza cutter. Use about half the buttercream to thinly coat the strips of sponge, spreading it evenly with a palette knife. Take one strip and, starting from the short side, start rolling it back up again, keeping it tight and evenly coiled. Line the seam up with the edge of the second strip and continue to roll it up to make a large cylinder of cake. Repeat with the third strip. This method ensures there are lots of neat, evenly spaced lines of buttercream throughout the sponge. Stand the cylinder up on a serving plate, then use the remaining buttercream to coat the sides and top of the cake and smooth evenly with a palette knife. Decorate with extra blackberries and the candied lemons."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/2.jpg"}