{"id":"14","title":"Carrot and cheesecake layer cake","difficulty":"A challenge","portion":"Serves 20 (at least)","time":"Hands-on time 1 hour 20 min, oven time 60-70 min, plus cooling and up to 7 hours chilling ","description":"Four layers of carrot cake sponge are sandwiched between a chocolate and vanilla marbled cheesecake filling and thick layers of cream cheese icing. It’s a truly spectacular celebration cake that’s perfect for feeding a crowd.","ingredients":["350g plain flour","¼ tsp ground nutmeg","¼ tsp ground cinnamon","3 cardamom pods, seeds removed and crushed in a pestle and mortar","¼ tsp ground allspice","1 tsp bicarbonate of soda","1 tsp baking powder","3 large free-range eggs","260g caster sugar","½ tsp salt","180ml vegetable oil","350g carrots, grated","180g greek yogurt","70g dark chocolate, chopped","400g full-fat cream cheese (we used Philadelphia)","115g caster sugar","25g cornflour","1 large free-range egg, beaten","125g whipping cream","¼ tsp vanilla extract","180g butter, softened","250g icing sugar","2 tbsp golden syrup","800g full-fat cream cheese (we used Philadelphia)","2 tsp vanilla extract","Edible flowers to decorate (optional; from Fine Food Specialist)","2 x 20cm spring-form deep cake tins, greased, bases lined with non-stick baking paper"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/gas 3½. In a large mixing bowl mix the flour with the spices, bicarbonate of soda and baking powder. Whisk together the eggs, sugar, salt and vegetable oil in a jug, then pour over the dry ingredients, followed by the grated carrots and yogurt. Mix with a wooden spoon until just combined, then divide between the prepared cake tins and bake for 25-35 minutes until a skewer pushed into the centre of the cake comes out clean. Leave to cool for 5 minutes in the tins, then turn out on a rack to cool completely. "},{"Step 2":"Once the cakes are out of the oven, reduce the oven temperature to 140°C/120°C fan/gas 1. Next, make the cheesecake layer. Grease and re-line one of the cake tins, then melt the chocolate in a heatproof bowl set over a pan of barely simmering water (don’t let the bowl touch the water) and set aside."},{"Step 3":"Using a hand whisk, beat together the cream cheese and caster sugar in a mixing bowl until the sugar crystals have dissolved and the mixture is smooth. Add the cornflour and mix again until combined, then add the egg and whipping cream, mixing gently until smooth."},{"Step 4":"Remove one third of the mixture to a clean mixing bowl and stir in the melted dark chocolate until fully combined. Mix the vanilla extract into the remaining mixture, then pour into the prepared cake tin. Spoon the chocolate mixture over the top and use a skewer to create a marbled pattern in the cheesecake mixture. Bake in the centre of the oven for 35 minutes until set but still with a slight wobble. Leave to cool completely in the tin, then transfer to the freezer to cool for an hour. If you don’t have room in the freezer, put in the fridge for 4-6 hours (or overnight – see Make Ahead). Chilling the cheesecake well will make the cake easier to assemble."},{"Step 5":"To make the cream cheese frosting, using an electric hand mixer, beat the butter, icing sugar and golden syrup in a mixing bowl until light and fluffy, then gently beat in the cream cheese and vanilla extract."},{"Step 6":"To assemble the cake, trim the domed top off each sponge to flatten them (it’s easiest to use a bread knife), then slice each cake in half horizontally to make 4 even layers. Put the bottom half of one sponge on a cake board or serving plate, then spread with a layer of cream cheese frosting about 0.5-1cm thick. Add the top half of the carrot cake, then a thinner coating of icing. Put the cheesecake layer on top and spread with another thin layer of icing. Top with the last 2 layers of carrot cake, with a thicker layer of icing between the two. Transfer to the fridge and leave to set for an hour, then cover the cake all over with the remaining icing. Decorate with edible flowers, if you like."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/14.jpg"}