{"id":"24","title":"Eton mess traybake","difficulty":"Easy","portion":"Serves 12-15","time":"Hands-on time 20 min, oven time 25-30 min","description":"We’ve turned the crowdpleasing dessert, Eton mess, into a teatime traybake. A strawberry and almond cake is topped with meringues, strawberries and double cream; the ultimate summer dessert.","ingredients":["200g butter, softened","200g caster sugar","1 tsp vanilla bean paste","50g ground almonds ","4 medium free-range eggs","175g self-raising flour","4 tbsp double cream","250g small, ripe but firm strawberries, hulled and halved","1 tbsp granulated sugar","250ml double cream","50g icing sugar","4 homemade meringues (see Master Recipe), crumbled","200g small strawberries, hulled and thickly sliced","Small handful fresh baby mint leaves","20cm x 30cm shallow cake tin or brownie tin, greased and lined with non-stick baking paper"],"method":[{"Step 1":"Heat the oven to 190°C/170°C fan/gas 5. To make the sponge, beat the butter and sugar in a mixing bowl using an electric hand mixer for 5 minutes until light and creamy. Beat in the vanilla bean paste, then mix in the ground almonds. Beat in the eggs one at a time, adding a tablespoon of the flour with the last 2 eggs. Sift over the remaining flour and a pinch of salt and, using a large metal spoon, fold in using a figure-of-eight motion, along with the 4 tbsp double cream."},{"Step 2":"Spoon the mixture into the prepared tin and level the surface. Scatter the 250g prepared strawberries over the top and sprinkle with the granulatedsugar. Bake for 25-30 minutes until a skewer pushed into the centre of the cake comes out clean."},{"Step 3":"Remove the cake from the oven and leave to cool in the tin for 10 minutes. Transfer to a cooling rack, leaving the baking paper in place, and leave to cool completely."},{"Step 4":"To assemble, peel off the baking paper, then transfer the sponge to a serving plate. Whip the 250ml cream and icing sugar in a large mixing bowl until the cream forms soft peaks. Thickly spread the whipped cream on top of the sponge and scatter with the crumbled meringues, strawberries and mint leaves. Cut into even portions to serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/24.jpg"}