{"id":"7","title":"Lemon and courgette cake with white chocolate cream cheese frosting","difficulty":"Easy","portion":"Serves 12-14","time":"Hands-on time 1 hour, plus chilling and cooling","description":"This gorgeous lemon and courgette cake features layers of zesty sponge layered with homemade lemon curd and white choc cream cheese frosting.","ingredients":["375g unsalted butter, softened300g caster sugar5 medium free-range eggs, at room temperature375g self-raising four1 tsp bicarbonate of soda2 tsp ground ginger300g courgettes, grated (see Know How)Grated zest 4 lemonsCandied lemon slices to decorate (see Know How and use the zested lemons above)","375g unsalted butter, softened","300g caster sugar","5 medium free-range eggs, at room temperature","375g self-raising four","1 tsp bicarbonate of soda","2 tsp ground ginger","300g courgettes, grated (see Know How)","Grated zest 4 lemons","Candied lemon slices to decorate (see Know How and use the zested lemons above)","115g caster sugar3 medium free-range eggs, plus 2 medium free-range egg yolks1 tbsp cornflourGrated zest and juice 2 large lemons (about 150ml juice)75g cold unsalted butter, diced","115g caster sugar","3 medium free-range eggs, plus 2 medium free-range egg yolks","1 tbsp cornflour","Grated zest and juice 2 large lemons (about 150ml juice)","75g cold unsalted butter, diced","375g unsalted butter, softened and at room temperature200g icing sugar300g full-fat cream cheese (we used Philadelphia) at room temperature150g white chocolate, melted and cooledSqueeze of lemon juice","375g unsalted butter, softened and at room temperature","200g icing sugar","300g full-fat cream cheese (we used Philadelphia) at room temperature","150g white chocolate, melted and cooled","Squeeze of lemon juice","Electric hand or stand mixer","2 x 20cm loose-bottomed round cake tins, lined with compostable baking paper"],"method":[{"Step 1":"Heat the oven to 160ºC fan/gas 4. To make the cake, beat the butter and sugar in a stand mixer on medium speed (use the paddle attachment), scraping down the sides twice, until the mixture is pale and fluffy – 6-8 minutes (or use a hand mixer). Beat in the eggs, one at a time, allowing each addition to be incorporated before adding the next. After the last egg is added, scrape down the sides once more, then beat for 2 minutes."},{"Step 2":"Sift together the flour, bicarb and ginger, then gently fold into the wet mixture using a figure-of-eight motion until just combined. Finally, gently fold in the courgettes and lemon zest. Divide the batter evenly between the prepared tins, smooth the tops, then bake for 25-30 minutes until golden and a skewerpushed into the middle comes out clean. Cool in the tins for 10 minutes, then turn out onto a wire rack and set aside to cool completely (see Make Ahead)."},{"Step 3":"To make the lemon curd, beat the sugar, eggs, yolks and cornflour in a medium heatproof bowl using a balloon whisk. Add the lemon zest and juice and beat until combined. Sit the bowl over a pan of barely simmering water and cook, stirring frequently, for 15-20 minutes until very thick, taking care not to let the mixture get too hot or it will curdle. Remove from the heat and whisk in the cold butter, 2 cubes at a time. Press a piece of cling film directly onto the surface of the curd and set aside to cool completely (see Make Ahead)."},{"Step 4":"For the buttercream, beat the butter and icing sugar in a stand mixer or with a hand mixer until fluffy. Gradually beat in the cream cheese, bringing the mix back to a smooth consistency before adding more. Add the melted chocolate and a squeeze of lemon, scrape down the sides of the bowl and beat again until well combined. Cover and chill for 1-2 hours until firmed up."},{"Step 5":"To assemble, slice the cooled cakes horizontally in half (see Know How). Secure 1 layer of cake, cut-side up, to a serving plate or cake stand using a blob of the buttercream. Spread 2 large spoonfuls of buttercream over the cake, followed by about a third of the lemon curd. Repeat the cake, buttercream and curd layers twice more, finishing with the final cake layer."},{"Step 6":"Chill the cake for 30 minutes to firm up the buttercream, then coat the top and sides with a thin layer of buttercream (known as a crumb coat – it should be so thin you can see through it). Return the cake to the fridge for 1 hour, then spread with the remaining buttercream, giving it a smooth or swirled design as you prefer. Decorate with the candied lemon slices (see Know How)."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/7.jpg"}