{"id":"15","title":"Sugarplum fairy cakes","difficulty":"Medium","portion":"Makes 12","time":"Hands-on time 40-45 min, oven time 20-25 min, plus cooling","description":"Soft and fluffy fairy cakes are dotted with little nuggets of marzipan and come topped with buttercream and caramel shards. A cake fit for a fairy queen.","ingredients":["120g unsalted butter, softened","110g caster sugar","2 large free-range eggs","120g self-raising flour","100g marzipan, chopped into 0.5cm square chunks","150g caster sugar","20 cardamom pods, seeds removed and crushed (pods discarded)","200g lightly salted butter, softened","300g icing sugar","1-2 tbsp milk (as needed)","Finely grated zest 1 lemon","12-hole cupcake tin","12 cupcake cases","Piping bag & star nozzle (optional)"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4 and line the cupcake tin with the cases. To make the sponge mixture, beat the butter and caster sugar together in a mixing bowl using an electric mixer until light and fluffy, then beat in the eggs one at a time. Reduce the mixing speed and beat in the flour with a pinch of salt until just combined. Stir the marzipan chunks into the batter using a metal spoon, then divide the mixture among the cases and bake for 20-25 minutes until risen, golden and springy. Remove from the tin and leave to cool on a wire rack."},{"Step 2":"To make the caramel shards, line your largest baking tray with non-stick baking paper and put in a warm oven. Put the sugar in a spotlessly clean and dry frying pan, put over a low-medium heat and leave to melt (resist touching it)."},{"Step 3":"Once the sugar begins to melt, turn the heat up a little and keep an eye on it – if it starts to caramelise in places before all the sugar has melted, tilt the pan to move the sugar around. Once it’s completely liquid, remove the baking tray from the oven, turn up the heat under the pan and keep tilting the pan until all the sugar is deep golden. Immediately tip the caramel onto the baking tray and, working quickly, tip the tray to spread the hot mixture as thinly as possible. Scatter over the crushed cardamom and leave somewhere cool to harden."},{"Step 4":"For the buttercream, put the butter in a mixing bowl and beat for a few minutes with an electric hand mixer until fluffy. Sift in the icing sugar in 3-4 additions, beating well after each one, until it forms a smooth icing. If it’s too stiff to pipe, beat in the milk, then quickly beat in the lemon zest. Transfer to a piping bag fitted with a star nozzle, if using."},{"Step 5":"To decorate the fairy cakes, pipe swirls of icing, or spoon on and smooth with a palette knife. Use the point of a sharp knife to crack the caramel into shards, then use the prettiest for the cakes – stick them into the icing so they stand upright. Serve immediately."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/15.jpg"}