{"id":"13","title":"Baked lemon cheesecake with pineapple flowers","difficulty":"Medium","portion":"Serves 10-12","time":"HANDS-ON TIME 30 MIN, OVEN TIME 1 HOUR 35-45 MIN, PLUS CHILLING AND COOLING","description":"You could just make the baked lemon cheesecake (it would still go down a treat) but, if you have the time, we urge you to make the pretty pineapple flowers. They make a fabulous final flourish and are edible too!","ingredients":["200g Hobnob biscuits","75g unsalted butter, melted and cooled, plus extra to grease","340g full-fat cream cheese (we used Philadelphia)","250g mascarpone","200g golden caster sugar","200ml kefir (fermented milk, widely available) or soured cream","3 large free-range eggs","1 tsp vanilla extract","Finely grated zest 3 lemons and juice 2","50g plain flour","200ml soured cream","1 tbsp golden caster sugar","½ small pineapple, peeled, eyes removed and thinly sliced into 12 rounds (slice as thinly as you can and don’t remove the core)","A few drops red food colouring","20cm round, deep, loose-bottomed cake tin, base and sides lined with compostable baking paper; mini muffin tray (to set the edible flower decorations)"],"method":[{"Step 1":"For the base, pulse the biscuits in a food processor to make fine crumbs (or put in a freezer bag and bash to fine crumbs using a rolling pin), then mix in the melted butter and a pinch of salt. Pack into the base of the prepared cake tin in an even layer, smoothing down with the back of a spoon. Chill until needed."},{"Step 2":"Heat the oven to 180°C/160°C fan/gas 4. For the filling, put the cream cheese, mascarpone, 200g caster sugar and the kefir/soured cream in a mixing bowl, then mix using a balloon whisk (or an electric mixer) until smooth. Gently whisk in the eggs, one at a time, then add the vanilla extract, lemon zest and all but 2 tsp of the lemon juice. Gently mix in the flour until smooth. Spoon the mixture over the chilled biscuit base, then level the top."},{"Step 3":"Bake for 50-60 minutes until the top is lightly golden and set at the edges but the centre still wobbles when the cheesecake is shaken gently. Remove the tin from the oven and leave to cool on a wire rack."},{"Step 4":"When the cheesecake has cooled, heat the oven to 150°C/130°C fan/gas 2. For the topping, mix the soured cream with the 1 tbsp sugar and the 2 tsp reserved lemon juice, then spread the mixture over the top of the cheesecake and return it to the oven for 25 minutes (it will still be a bit soft and wobbly but will set on cooling). Remove and leave to cool once more, then cover loosely and chill for at least 4 hours (overnight is best – see Make Ahead). Leave the oven on if you’re making the pineapple flowers."},{"Step 5":"For the flowers, blot the pineapple slices with kitchen paper, then arrange on 2 baking trays lined with compostable baking paper. Mix a few drops of the food colouring into a tablespoon of water, then drop a little of the colouring onto the middle of half the flowers using a teaspoon. Bake for 20 minutes, then flip and bake for 20 minutes more or until the pineapple feels dry to the touch. While the pineapple flowers are still warm, push each slice into a mini muffin hole to set it in a flower shape (see Make Ahead). Use to decorate the cheesecake, just before serving."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/13.jpg"}