{"id":"26","title":"Raspberry and lemon sponge cake","difficulty":"Easy","portion":"Serves 8-10","time":"Hands on time 30 mins, 30 mins to cook, plus cooling","description":"Try this lemony twist on a Victoria sponge cake, filled with raspberry jam and fresh cream – it’s a scrumptious teatime or Mother’s Day treat.","ingredients":["225g butter, softened, plus extra for greasing","Grated zest of 2 lemons","225g golden caster sugar","4 large free-range eggs","225g self-raising flour","½ tsp baking powder","Handful fresh raspberries","Juice of 2 lemons","3 tbsp icing sugar, plus extra for dusting","400ml pot double cream","3 tbsp raspberry jam"],"method":[{"Step 1":"Preheat the oven to 180°C/fan160°C/gas 4. Grease 2 x 20cm round baking tins and line the bases with baking paper. Put the butter, lemon zest and sugar into a bowl and beat together with a wooden spoon or an electric whisk until soft and creamy."},{"Step 2":"Crack 1 egg into the butter and sugar mixture and beat it in with your wooden spoon or whisk. Add another egg and beat again, then repeat until you have added all 4 eggs. When you add the last egg, you will need to add a couple of spoonfuls of the flour to stop the mixture from curdling."},{"Step 3":"Sift the remaining flour and baking powder into the cake mixture, then use a metal spoon to fold in (use the spoon to cut through the middle of the mixture, then move it across the bottom of the bowl and up the other side). The idea is to fold in the flour gently, so you don’t push out the air from the mixture."},{"Step 4":"With a spoon, divide the mixture between the tins. Bake for 20-25 minutes or until risen and cooked through. Try not to open the door until the end of the cooking time, or they might not rise properly."},{"Step 5":"Make the icing. Cut the lemons in half and squeeze the juice into a bowl. Sift over the icing sugar and mix together. Poke holes all over the cakes with a skewer, then drizzle the icing over them. When cool enough to handle, tip the cakes out onto a rack, peel off the paper and leave to cool."},{"Step 6":"To make the filling, put the cream in a clean bowl and whip until soft peaks form. Mix in the jam so you have a swirled effect rather than fully combined. Spread the cream onto one of the cakes and top with the other cake. Dust with icing sugar, and top with fresh raspberries."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/26.jpg"}