{"id":"43","title":"Triple-chocolate layer cake","difficulty":"Easy","portion":"Serves 24","time":"Takes 1 hour to make, 20-25 minutes to cook, plus cooling and chilling","description":"This chocolate layer cake recipe is made with three layers of chocolate and soured cream sponge filled with a fluffy chocolate buttercream and coated in an unsweetened chocolate mousse icing.","ingredients":["150g unsalted butter, softened, plus extra for greasing","150g dark chocolate (Lizzie used Willie’s Cacao Venezuelan 72), broken into pieces","250g plain flour","2 tsp baking powder","½ tsp salt","50g cocoa powder","160g soured cream","200g golden caster sugar","150g soft light brown sugar","4 medium free-range eggs","2 gelatine leaves","500g double cream","300g dark chocolate (Lizzie used Willie’s Cacao Madagascan 71), broken into pieces","Hundreds and thousands and a 30cm acetate sheet to decorate","175g unsalted butter, softened","300g icing sugar","100g dark chocolate (Lizzie used Willie’s Cacao Indonesian 69), melted as in step 1"],"method":[{"Step 1":"Preheat the oven to 180°C/fan 160°C/gas 4. Grease and line 3 x 20cm sandwich tins with baking paper. Melt the 150g chocolate in a heatproof bowl set over a pan of simmering water. Set aside."},{"Step 2":"Sift the flour, baking powder and salt, twice. In another bowl, whisk the cocoa with 250ml boiling water until smooth, then whisk in the soured cream."},{"Step 3":"Using a stand mixer or electric hand mixer and large bowl, beat the butter and sugars until light and fluffy. Crack in the eggs one at a time, beating well."},{"Step 4":"Beat in the melted chocolate, then beat in the soured cream and flour mixtures bit by bit, alternating between them. Divide among the tins, then bake for 20-25 minutes. Leave in the tins for 10 minutes, then turn out onto a wire rack to cool."},{"Step 5":"For the chocolate icing, soak the gelatine in cold water for 2 minutes. Heat 250g of the cream in a pan until almost boiling, then take off the heat. Squeeze the water from the gelatine, then stir into the hot cream to dissolve. In a food processor, whizz the 300g chocolate, add the hot cream and whizz until smooth. Chill for 30 minutes. Whisk the remaining cream to stiff peaks, fold into the chilled chocolate mixture, then chill, covered, for 2-3 hours."},{"Step 6":"For the buttercream, beat the butter and icing sugar with an electric hand mixer until fluffy. Beat in the melted chocolate."},{"Step 7":"To assemble, spread one of the sponges with half the buttercream. Add a second sponge, spread over the remaining buttercream, then top with the final sponge. Use a palette knife to spread the icing evenly over the top and sides. Wrap the acetate around the side of the cake, leaving the bottom third uncovered, then sprinkle the hundreds and thousands over the exposed icing. Brush off any excess, then remove the acetate. For a smooth finish, dip a spatula in hot water, wipe dry, then run it over the icing. Leave for 10 minutes, then serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/43.jpg"}