{"id":"51","title":"Paul Hollywood’s ultimate carrot cake","difficulty":"Easy","portion":"Serves 8","time":"Takes 20 minutes to make, 1 hour to cook","description":"Paul Hollywood’s carrot cake recipe uses pecan nuts for crunch and flavour, with a lovely warmth coming through in the cinnamon and ginger spices. It’s topped with cream cheese frosting, and decorated with a crown of orange zest.","ingredients":["155ml sunflower oil, plus extra for greasing","230g self-raising flour","1 tsp baking powder","1½ tsp ground cinnamon","½ tsp mixed spice","½ tsp ground ginger","230g light brown muscovado sugar","Finely grated zest of 1 satsuma or mandarin, plus strips to decorate","100g pecans, halved","260g carrots, coarsely grated","3 medium free-range eggs, beaten","50g butter, softened","200g full-fat cream cheese, we recommend Philadelphia","100g icing sugar, plus extra to dust","Finely grated zest of 1 orange","2 oranges","200ml water","200g caster sugar"],"method":[{"Step 1":"Preheat the oven to 180°C/fan160°C/gas 4. Grease an 18cm loose-bottomed round cake tin and line the base with baking paper. Sift the flour, baking powder and spices into a large bowl. Add the sugar, zest, pecans and grated carrots, then stir until well combined. Stir in the beaten eggs and oil, then mix well."},{"Step 2":"Pour into the prepared cake tin and bake in the oven for 1 hour or until a skewer comes out clean. Transfer to a cooling rack, leave in the tin for 5 minutes, then turn out and leave to cool completely before icing."},{"Step 3":"For the icing, beat the butter in a large bowl with a hand mixer until really soft. Add the cream cheese and beat again until well mixed. Sift over the icing sugar, add the orange zest, then beat until smooth. Store, covered, in the fridge until needed."},{"Step 4":"For the orange peel, carefully pare the zest from the orange (a tool like this would be helpful). Put the water and sugar in a saucepan and heat until the sugar has dissolved. Add the orange zest and remove from the heat. Let the zest sit in the sugar syrup until it has completely cooled."},{"Step 5":"Carefully cut the cake in half (watch our cheat’s how-to video here) then spread half the icing between the cake layers and the other half on top. Decorate with the orange zest strips."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/51.jpg"}