{"id":"44","title":"Chocolate cola cake","difficulty":"Easy","portion":"Serves 12-16","time":"Hands-on time 45 min, oven time 25-35 min, plus chilling and cooling","description":"Great British Bake Off winner John Whaite shares his recipe for a fabulously moist and moreish chocolate cake with a secret ingredient…Coca Cola.","ingredients":["120g unsalted butter, softened, plus extra to grease","250ml cola","250g dark brown muscovado sugar","120g caster sugar","80g cocoa powder","4 large free-range eggs","200ml buttermilk","320g self-raising flour","1 tsp bicarbonate of soda","400g Bournville chocolate, roughly chopped","100ml cola","100ml water","250g unsalted butter, diced","50g dark muscovado sugar","Cocoa powder to dust (optional)"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/ gas 4. For the sponges, butter and line 2 x 20cm, deep cake tins (preferably loose bottomed – see tips) with baking paper."},{"Step 2":"In a jug, stir the 250ml cola and 250g dark brown muscovado sugar until the sugar has more or less dissolved. Set aside."},{"Step 3":"Using an electric mixer, beat the 120g butter and caster sugar for 3-4 minutes until pale and light in texture. Sift in the cocoa powder and beat again to form a brown paste."},{"Step 4":"In a separate jug, whisk the eggs with the buttermilk until smooth, then slowly pour into the cocoa paste, beating constantly. Sift the flour and bicarbonate of soda over the mixture and beat in. Pour the cola-muscovado mixture into the bowl and beat to a smooth, fairly loose batter."},{"Step 5":"Divide the batter equally between the prepared cake tins and bake for 25-35 minutes until a skewer inserted into the centre comes out clean. Cool the sponges in the tins for 5 minutes, then invert onto a wire rack to cool."},{"Step 6":"For the frosting, put the chocolate into a large heatproof bowl. Heat the cola, water, butter and muscovado sugar in a pan until the butter melts completely and the mixture starts to boil. Remove from the heat and pour over the chopped chocolate. Leave the mixture to rest for a minute so the intense heat of the liquid melts the chocolate, then bring together with a balloon whisk until smooth and glossy. Cover the frosting with a sheet of cling film directly touching the surface, allow to cool completely, then chill, stirring occasionally, until stiffened to a spreadable consistency – it should take around an hour."},{"Step 7":"Once the sponges have cooled completely, evenly slice each in half horizontally with a large bread knife (or see tips) so you have 4 sponges. When the frosting has thickened, place one sponge onto a cake stand. Using a palette knife, spread with a thin layer of frosting, then put another sponge on top and spread over more frosting. Repeat with the remaining sponge layers and icing. With the remaining frosting, cover the entire cake, swirling and smoothing as you go. Serve, or leave somewhere cool or in the fridge until ready to serve (see Make Ahead)."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/44.jpg"}