{"id":"19","title":"Eric Lanlard’s carrot and pumpkin celebration cake","difficulty":"Medium","portion":"Serves 24","time":"Hands-on time 40 min, Oven time 20-25 min, plus cooling","description":"Master pâtissier Eric Lanlard created this showstopping carrot cake for delicious. magazine’s 15th birthday. We didn’t leave a single crumb uneaten…","ingredients":["750g plain flour","250g golden caster sugar","250g light muscovado sugar","1 tbsp bicarbonate of soda","2 tsp ground cinnamon","300ml vegetable oil","5 large free-range eggs","Splash whole milk","1 tbsp grated fresh ginger, or 1 tsp ground ginger","2 tsp vanilla bean paste","Finely grated zest 2 oranges","350g carrots, coarsely grated","250g canned pumpkin purée (see Know-how)","100g each shelled walnut and pecan halves, toasted and chopped","75g golden sultanas","25g shelled pecan halves","25g shelled walnut halves","75g golden caster sugar","600g mascarpone","1½ tbsp ground ginger","4-5 tbsp golden icing sugar","150ml double cream","4 x 20cm round cake tins, lightly greased and bases lined with non-stick baking paper","Lightly greased baking sheet"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Sift the flour, sugars, bicarb and cinnamon into a large bowl. In a smaller bowl, whisk the oil, eggs, milk, ginger and vanilla."},{"Step 2":"Add the oil mixture, orange zest, grated carrot and pumpkin puréeto the dry ingredients, then stir with a wooden spoon or spatula until almost combined. Add the chopped nuts and sultanas, then stir into the batter until just combined (see food team’s tips)."},{"Step 3":"Divide the batter evenly among the tins. Bake for 20-25 minutes until the tops are cracked and springy to the touch. Cool in the tins for 10 minutes, then invert onto a wire rack to cool completely (see Make Ahead)."},{"Step 4":"For the caramelised nuts, toast the nuts in a dry frying pan until golden, then tip onto the greased baking sheet to cool. Wipe out the pan, then add the sugar and heat until melted. Bring to the boil and simmer until a deep amber colour. Immediately (and carefully) pour over the toasted nuts to coat. Set aside to cool (see food team’s tips)."},{"Step 5":"For the frosting, beat together all the ingredients, adding enough icing sugar to make a thick, smooth mix – don’t overmix. Roughly chop the cooled nuts."},{"Step 6":"To assemble, put one cake on a cake stand and spread with an even layer of frosting. Top with another cake and frosting, then repeat until all 4 cakes are stacked up. Cover the top and sides with the remaining frosting, then decorate with caramelised nuts. Add candles/sparklers if you want to. Happy birthday!"}],"image":"https://apipics.s3.amazonaws.com/cakes_api/19.jpg"}