{"id":"52","title":"Mary Berry’s very best chocolate and orange cake","difficulty":"Easy","portion":"Serves 8","time":"Takes 20 minutes to make, 20-25 minutes to cook, plus cooling","description":"A classic Mary Berry sponge recipe for  chocolate and orange cake. It’s very easy – you can make it in a food processor in minutes.","ingredients":["100g unsalted butter, softened, plus extra for greasing","50g good quality cocoa powder","90ml boiling water","3 large free-range eggs","4 tbsp milk","175g self-raising flour, sifted","1 rounded tsp baking powder, sifted into the flour","300g golden caster sugar","Finely grated zest of 1 orange","150g Bournville chocolate, broken into small pieces","150ml double cream","3 tbsp apricot jam","100g good quality dark chocolate (55-60 per cent cocoa solids) made into curls"],"method":[{"Step 1":"Preheat the oven to 180ºC/fan160°C/gas 4. Grease 2 x 20cm round sandwich tins and line the bases with baking paper. To make the sponges, measure the cocoa and boiling water into a large bowl and mix to a paste. Add the remaining ingredients and beat again until combined. (You can use a food processor for this but be careful not to overmix.)"},{"Step 2":"Divide the sponge mixture evenly between the prepared tins. Bake in the preheated oven for about 20-25 minutes until the sponges are well risen and shrinking away from the sides of the tin. Remove the sponges from the oven, turn out of their tins onto a cooling rack and leave to cool completely."},{"Step 3":"For the icing and filling, put the chocolate and cream in a bowl, Then stand over a pan of simmering water for 10 minutes until melted (don’t let the bowl touch the water), stirring from time to time. Set aside to cool until it thickens to a spreadable consistency."},{"Step 4":"To finish, spread the tops of both sponges with the apricot jam. Spread the top of one sponge with half the icing and put the other sponge on top. Cover the top of the cake with the remainder of the icing, then, with a small palette knife, make large S shapes in the icing to give a swirl effect. Scatter the top liberally with the chocolate curls (see our how to make chocolate curls video) and enjoy!"}],"image":"https://apipics.s3.amazonaws.com/cakes_api/52.jpg"}