{"id":"31","title":"Frozen lemon and blueberry mousse cake","difficulty":"Easy","portion":"Serves 8-10","time":"Hands-on time 40 min, oven time 20-25 min, plus freezing","description":"This blueberry mousse cake is a show-stopper – we’ve layered lemon sponge with sweet-tart lemon curd mousse, blueberries and white chocolate to make a truly impressive dessert.","ingredients":["5 large free range eggs, separated","130g caster sugar","130g self-raising flour","Zest 1 lemon, plus extra to decorate","500ml double cream","300g lemon curd","200g blueberries","50g white chocolate","50g lemon curd","100g blueberries","2 x 18cm loose-bottomed non-stick cake tins, lightly greased"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Using an electric hand mixer, beat the egg yolks and sugar until pale, light and creamy (about 5-6 minutes)."},{"Step 2":"In a separate clean mixing bowl, whisk the egg whites to medium-stiff peaks. Use a large metal spoon or spatula to fold the flour and zest into the yolk/sugar mix, then fold in the egg whites (see introduction). Divide the batter between the cake tins and bake for 20-25 minutes until pale golden and springy to the touch (or a skewer pushed into the centre comes out clean). Cool in the tin for a few minutes, then turn out onto a wire rack to cool – the cakes will sink a little."},{"Step 3":"Once the cakes have cooled, slice them in half horizontally with a serrated knife."},{"Step 4":"For the mousse filling, use a balloon whisk or electric hand mixer to whip the double cream in a bowl until it forms soft peaks. Whisk in the lemon curd, then stir in the blueberries."},{"Step 5":"Wash and dry one of the cake tins, then fully line with non-stick baking paper, allowing an 8cm collar to rise above the edge of the tin. Put a layer of cake back in the tin. Spread a quarter of the mousse on top, then top with the another layer of cake. Repeat with another quarter of the mousse, then repeat twice more, ending with a mousse layer. Cover loosely with cling film; freeze for at least 4 hours."},{"Step 6":"To serve, use a peeler to create curls of the white chocolate. Mix the lemon curd with a dash of water to loosen it to a drizzling consistency. Pile the blueberries onto the cake, then drizzle the lemon curd over the top. Sprinkle over the white chocolate curls, then finish with a grating of lemon zest. The cake can be kept out of the freezer for a little while but if you’re not going to finish it at one sitting you’ll need to return it to the freezer after serving."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/31.jpg"}