{"id":"50","title":"Red velvet cake","difficulty":"Medium","portion":"Serves 20-24","time":"Hands on time 40 min, oven time 40 min","description":"Although this red velvet cake recipe looks complex, it’s simple to make as long as you follow the recipe to the letter – it’s worth the effort as you’ll end up with a wonderfully light and scrumptious cake.","ingredients":["200g unsalted butter, softened, plus extra to grease","235g plain flour, plus extra to dust","400g caster sugar","1 tsp vanilla extract","4 large free-range eggs, separated","30g cornflour","1 tbsp baking powder","2 tbsp cocoa powder","235ml buttermilk","60ml red food colouring (we like Silver Spoon)","1½ tsp white wine vinegar","1½ tsp bicarbonate of soda","300ml double cream","600g full-fat cream cheese (we like Philadelphia, see Tip)","500g mascarpone","300g icing sugar","White chocolate holly leaves and gold sugared almonds to decorate"],"method":[{"Step 1":"To make the sponges, preheat the oven to 180°C/fan160°C/gas 4, then grease, dust with flour and base-line 3 x 20cm loose-bottomed cake tins. In a large mixing bowl, cream the butter and caster sugar together with an electric hand whisk for 5 minutes or until pale and fluffy. Add the vanilla and the egg yolks, one at a time, beating well after each addition."},{"Step 2":"In a second large mixing bowl, combine the flour, cornflour, baking powder and cocoa. In a third bowl, mix the buttermilk with the red food colouring. Sift a third of the dry ingredients into the butter mixture, then pour in a third of the buttermilk and mix together until just combined. Repeat this process with the remaining dry ingredients and buttermilk."},{"Step 3":"In a large, clean bowl, whisk the egg whites with a pinch of salt until they form fairly firm peaks. Add to the cake mixture, a quarter at a time, folding gently with a large metal spoon until just incorporated."},{"Step 4":"In a small bowl, mix the vinegar and bicarbonate of soda until it bubbles. Gently fold into the cake mixture, then quickly pour into the tins and smooth the tops. Bake for 40 minutes or until a skewer pushed into the middle of each sponge comes out clean."},{"Step 5":"Leave the cakes to cool in the tins for 10 minutes, then turn out onto wire racks to cool completely. Cut each sponge in half horizontally to create 6 rounds (see tips)."},{"Step 6":"To make the frosting, whip the cream in a large bowl until you have medium-firm peaks, then set aside. In a separate bowl, beat the cream cheese, mascarpone and icing sugar together until stiff, then fold through the whipped cream."},{"Step 7":"To assemble the cake, put a sponge on a platter and spread with a layer of frosting. Top with a second sponge, then repeat until all 6 sponges are layered with frosting. Use the remaining frosting to cover the top and sides of the cake, smoothing with a palette knife as you go. Finally, decorate the top with white chocolate holly leaves and gold sugared almonds. Chill the cake for a few hours before slicing; it will keep in the fridge for four days."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/50.jpg"}