{"id":"42","title":"Chocolate porter cake","difficulty":"Easy","portion":"Serves 12-16","time":"Hands-on time 30 min, oven time 1 hour, plus cooling","description":"The porter in this chocolate cake recipe ensures it’s extra moist. Serve this celebratory dessert at a dinner party or birthday.","ingredients":["Sunflower oil for greasing","260ml porter (we like St Peter’s Old-Style Porter or Guinness)","250g unsalted butter","100g dark chocolate (70% cocoa solids), chopped into chunks","50g cocoa powder","200g caster sugar","200g soft light brown sugar","2 large free-range eggs","150g full-fat Greek yogurt","2 tsp vanilla bean extract","280g plain flour","2½ tsp bicarbonate of soda","200g full-fat cream cheese (note: it needs to be full fat, and Philadelphia is the brand we’d recommend for best results)","80g icing sugar","200ml double cream","Deep 23cm loose-bottomed cake tin"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/ gas 4. Grease a deep 23cm loose- bottomed cake tin and line with baking paper. In a large pan, gently warm the porter, butter and chocolate until the butter and chocolate have melted."},{"Step 2":"Mix the cocoa powder and sugars in a large bowl, rubbing away lumps. Pour in the chocolate mixture gradually, whisking well using a balloon whisk, then add the eggs. Whisk until it’s thick and smooth, then whisk in the yogurt, vanilla, flour and bicarbonate of soda."},{"Step 3":"Pour the batter into the lined tin and bake for 1 hour or until a skewer comes out clean. Leave for 5 minutes, then turn out onto a wire rack to cool."},{"Step 4":"Meanwhile, in a large bowl, beat the topping ingredients with an electric mixer until the mix just holds its shape. It’s important not to carry on beating as the topping will go runny – and the more you beat, the runnier it will get. Beware, too, that adding more icing sugar isn’t a quick fix – it will only make the topping runnier. Swirl the icing on top of the cooled cake."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/42.jpg"}