{"id":"35","title":"Giant Jaffa cake","difficulty":"Medium","portion":"Serves 12","time":"Hands-on time 50 min, oven time 20-25 min, plus chilling","description":"Here’s a fun cake to serve at afternoon tea: a giant Jaffa cake complete with soft sponge base, orange jelly layer and chocolate top. It’s bigger, and of course better, than the original.","ingredients":["135g packet orange jelly cubes","250ml boiling water","190g unsalted butter, plus extra for greasing","190g caster sugar","3 medium free-range eggs, beaten","190g self raising flour","Finely grated zest ½ orange and 1 tbsp juice","100g dark chocolate, at least 70% cocoa content","100g milk chocolate","23cm non-stick shallow cake tin","30cm (measured across the top) non-stick frying pan"],"method":[{"Step 1":"Grease the cake tin and frying pan, then line the bottom of the 30cm frying pan with a circle of non-stick baking paper. Line the cake tin with cling film. Put the jelly into a heatproof bowl and pour over the boiling water. Gently stir the jelly until completely dissolved, pour into the lined 23cm cake tin and put in the fridge to set for at least 1-2 hours."},{"Step 2":"Heat the oven to 180C/160C fan/gas 4. Put the butter and sugar into a large mixing bowl. Using electric hand whisks beat the butter and sugar together until light and really creamy. Slowly add the eggs, a little at a time, whisking in between additions until the egg is fully incorporated."},{"Step 3":"Sift in the flour and fold everything together with the orange juice and zest using a metal spoon. Use a spatula to scrape the batter into the frying pan. Level the batter off, then bake in the centre of the oven for 20-25 minutes, until risen and golden and a skewer comes out clean when pushed into the centre of the cake."},{"Step 4":"Run a knife around the edge of the cake and turn it out onto a wire rack to cool completely. When the cake is cool and the jelly set, put the chocolate into a heatproof bowl, set over a pan of steaming, not simmering water (making sure the water does not touch the bowl). Leave the chocolate to melt slowly without stirring. When the chocolate has melted, remove from the heat and leave to stand for 15-20 minutes, until lukewarm."},{"Step 5":"Lift the jelly out and turn out on top of the cake in the centre. When the chocolate has cooled, spoon it on top of the cake and spread it carefully and quickly over the top. Chill in the fridge for 15 minutes straight away to prevent the jelly melting. When the chocolate is starting to set and is very thick, use a palette knife to make the lines: quick dip the edge of the knife in the chocolate and lift it straight up quickly. Repeat to make several lines. Then repeat at 90 degrees. Chill in the fridge for at least 5 hours or overnight."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/35.jpg"}