{"id":"49","title":"Apple caramel layer cake","difficulty":"Easy","portion":"Serves 12-16","time":"Takes 45 minutes to make, 1 hour to cook","description":"Three moist, apple sponges are layered together with caramelised apples, salted caramel sauce and Greek yogurt. This celebration layer cake is utter bliss. Watch our how-to video below.","ingredients":["4 cox apples","340g, plus 50g caster sugar","375g unsalted butter, room temperature, plus extra for greasing","5 large free-range eggs","385g self-raising flour","1 tsp baking powder","4 eating apples, such as braeburn","50g caster sugar","70g unsalted butter","350ml thick full fat Greek yogurt (we like Total Full Fat)","75g unsalted butter","50g soft light brown sugar","50g caster sugar","50g golden syrup","20g icing sugar","230ml double cream"],"method":[{"Step 1":"Preheat the oven to 170ºC/fan 150ºC/gas 3½. Grease and line the sides and bottoms of 3 x 20cm cake tins with baking paper. For the sponge, peel, core and chop the apples. Put in a pan over a medium-high heat and add 100ml water and the 50g caster sugar. Cook for 10-15 minutes, stirring frequently and adding more water if necessary, until mostly turned to a purée. Take off the heat and leave to cool completely."},{"Step 2":"In a mixing bowl, cream the butter and sugar with an electric hand mixer until light and fluffy. Beat in the eggs one at a time, beating well after each addition. Beat in the cooled apple."},{"Step 3":"Sift over the flour and baking powder with a pinch of salt, then fold in with a metal spoon. Divide the mix equally among the 3 cake tins, then bake for 30 minutes until the sponge bounces back when touched. If you’re cooking all 3 cakes in the same oven you might need to take the top cake out and move the bottom one up to the top for an extra 5 minutes, leaving the middle one where it is."},{"Step 4":"Leave the sponges to cool for 10 minutes in the tins, then carefully turn out onto a rack to cool completely."},{"Step 5":"Meanwhile, make the filling. Peel and core the apples, then slice thinly lengthways. Put a pan over a medium-high temperature and add the sliced apples, sugar and butter."},{"Step 6":"Cook, stirring often, until the apples caramelise lightly (this should take about 15 minutes – lower the heat or remove the pan if it happens too quickly). When the apples are golden and caramelised, remove them from the pan with a slotted spoon, then put onto baking paper to cool."},{"Step 7":"When the cakes have cooled, put one sponge on a serving plate and top with half the Greek yogurt. Scatter over just under half of the sticky apples, then put a second sponge on top and repeat the process, saving some apples for the final decoration. Top with the remaining sponge."},{"Step 8":"Put all the caramel ingredients into a pan and heat gently to melt. Simmer for 7-8 minutes, stirring, until it turns into golden caramel."},{"Step 9":"Pour over the top of the cake, allowing the caramel to run down the sides. Leave the cake somewhere cool for 1 hour or so (see tip), then serve, cutting with a serrated knife."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/49.jpg"}