{"id":"30","title":"Sticky toffee pudding cake","difficulty":"Easy","portion":"Serves 16","time":"Hands-on time 1 hour 10 min, oven time 30-35 min, plus chilling","description":"Martha Collinson’s sticky toffee pudding cake has all the flavours of the classic pud. Drizzle toffee sauce over the buttercream to finish.","ingredients":["200g unsalted butter, plus extra for greasing","250g dark muscovado sugar","100g black treacle","100g golden syrup","200ml milk","2 large free-range eggs","250g plain flour","1 tsp bicarbonate of soda","200g chopped medjool dates","250ml double cream","1 tbsp black treacle","150g demerara sugar","100g unsalted butter","200g unsalted butter, softened","300g icing sugar","100ml toffee sauce (see above)","100g pecans, chopped","4 medjool dates, stoned and sliced into thin rounds","3 x 18cm round cake tins, bases lined with non-stick baking paper; a cake turntable (optional)"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. For the sponges, heat the butter, sugar, treacle and golden syrup in a large pan, stirring until all the sugar has dissolved. Remove the pan from the heat."},{"Step 2":"Slowly pour the milk into the saucepan with the hot mixture, whisking continuously, then beat in the eggs until well combined. Sift the flour and bicarbonate of soda together into the saucepan, then whisk together until smooth. Fold in the chopped dates."},{"Step 3":"Divide the mixture evenly among the prepared tins, either by counting equal spoonfuls of mixture or by weighing the tins, then bake the cakes for 30-35 minutes or until firm and a skewer pushed into the centre comes out clean. Remove from the oven and leave to cool briefly in the tins, then transfer to a wire rack to cool completely."},{"Step 4":"Meanwhile make the toffee sauce. Put the double cream, treacle, sugar and butter in a saucepan and heat gently until the sugar has dissolved. Turn up the heat and boil for 5 minutes or until the sauce thickly coats the back of a metal spoon. Pour into a heatproof/microwave-safe jug and set aside to cool."},{"Step 5":"To make the buttercream, briefly beat the butter in a large bowl, using an electric mixer, to soften it. Beat in the icing sugar a little at a time, incorporating each addition before adding more. Beat for 5-10 minutes until light and fluffy, then add 100ml of the cooled toffee sauce and beat for a few more minutes."},{"Step 6":"To assemble, put the first layer on a cake stand or serving plate on a turntable, if you have one. Use a small amount of buttercream to fix the base sponge to the plate or stand, then top with about one-fifth of the buttercream. Use a palette knife to spread the buttercream to the edges of the cake, then top with another sponge. Repeat the buttercream process and put the last layer on top."},{"Step 7":"Cover the top and sides of the cake with the remaining buttercream, scraping the excess away from the sides with a large palette knife so the cakes are thinly and evenly coated and the layers show through a little. The top should be smooth and the edges neat. Chill the cake for at least 30 minutes to set the buttercream."},{"Step 8":"Gently heat the remaining toffee sauce in the microwave until it’s just pourable but not warm enough to melt the buttercream. Pour the sauce directly onto the centre of the cake, then push it right to the edges using a palette knife, gently teasing it down the sides to create long drips. Sprinkle the pecans around the edge of half the cake, then nestle the date slices among them."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/30.jpg"}