{"id":"38","title":"Daim bar layer cake","difficulty":"Medium","portion":"Serves 20","time":"Hands-on time 1 hour 45 min, oven time 40 min, plus cooling","description":"A Daim bar cake layered with carnation caramel toffee and doused in chocolate ganache… it’s a Daim good recipe.","ingredients":["350g unsalted butter, softened","320g light muscovado sugar","6 large free-range eggs, lightly beaten","1 tsp vanilla extract","200g ground almonds","150g plain flour","2 tsp baking powder","2-3 Daim bars (28g each), broken up into irregular pieces, to serve","550g Carnation caramel or dulce de leche","5 gelatine leaves (we used Costa)","220ml condensed milk","200ml double cream","200g dark chocolate, roughly chopped","200g high cocoa content milk chocolate (we used Green & Black’s)","2 x 20cm diameter cake tins with removable bases, lightly oiled, the bottoms lined with baking paper; plenty of ice cubes"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Put the butter and muscovado sugar in a mixing bowl and whisk with an electric mixer until pale, light and fluffy. Beat in the eggs, a little at a time, incorporating each addition before adding the next. Beat in the vanilla, then beat in the almonds, flour and baking powder with a pinch of salt until smooth."},{"Step 2":"Divide the mix evenly between the prepared tins, level the tops, then bake for 40 minutes until risen, springy and golden. Remove from the oven, cool in the tin for 10 minutes, then carefully remove and leave to cool on wire racks."},{"Step 3":"To make the filling, put the caramel/dulce de leche in a mixing bowl. Soak the gelatine leaves in cold water for 5 minutes until soft, then put in a pan with 3 tbsp of the caramel and a large splash of water. Heat very gently, stirring, until the gelatine has melted completely. Don’t let it boil. Mix the gelatine caramel into the rest of the caramel, stirring to combine. Sit the bowl in a roasting tin filled with ice cubes and cold water, then slowly stir with a spatula until the caramel turns gelatinous (about 20 minutes). Once that happens, remove the bowl from the iced water and set aside."},{"Step 4":"Halve the cooled sponges horizontally using a bread knife, to make 4 thinner sponges. Put 1 sponge on a serving plate and spread with a third of the toffee mixture. Repeat twice, using up the toffee, then top with the final uncovered sponge to create a 4-layered cake. Set aside somewhere cool to firm up – if you have room, the fridge is the best place. Don’t worry if a little of the toffee leaks out – just scrape it off with the flat of a knife."},{"Step 5":"To make the chocolate ganache icing, put the condensed milk and cream in a large heatproof bowl set over a pan of very gently simmering water (don’t let the water touch the bowl). Heat until steaming, then tip in the chocolate, remove the pan from the heat and stir gently, using a wooden spoon, until the chocolate has completely melted into the cream. Leave to cool, stirring often, until thickly spreadable (it will take about 30 minutes), then spread it all over the cake with a palette knife. Scatter the top with the Daim bars, then serve once the chocolate has set."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/38.jpg"}