{"id":"4","title":"Lemon and strawberry meringue cake","difficulty":"Easy","portion":"Serves 12-14","time":"Hands-on time 45 minutes. Oven time 1 hour 20 minutes, plus cooling.","description":"Expect gasps when you unveil this gloriously OTT strawberry cake. The three layers are sandwiched with lemon curd, berries and cream, then topped with a strawberry meringue crown.","ingredients":["250g unsalted butter, at room temperature","250g golden caster sugar","1 tbsp vanilla extract","4 medium free-range eggs","Grated zest and juice 1 lemon","230g plain flour","1 tsp salt","2 tsp baking powder"," 3 medium free-range egg yolks, plus 1 whole egg","100g caster sugar","Juice 2 lemons","75g butter, cut into cubes","300ml double/whipping cream","300g strawberries, hulled and sliced (halve 6, unhulled, for the top)","Oil to grease","3 medium free-range egg whites","165g caster sugar","Pink or red food colouring","2 tbsp freeze-dried strawberry pieces","3 x 18cm springform cake tins, lined with baking paper"],"method":[{"Step 1":"Heat the oven to 160°C fan/gas 4. Beat the butter and sugar until light and fluffy, add the vanilla, then beat in the eggs one at a time. Stir in the lemon zest and juice, then gently mix in the flour, salt and baking powder. Divide the mix among the tins and level the tops. Bake for 20 minutes until a skewer pushed into the middle comes out clean. Transfer the tins to a rack to cool completely, then remove the cakes from the tins. Reduce the oven to 120°C fan/gas 1."},{"Step 2":"For the lemon curd, whisk the egg yolks, whole egg, sugar and lemon juice in a small pan. Put over a low-medium heat and whisk continuously until starting to thicken. When the mix begins to steam, gradually whisk in the butter, cube by cube, until the mixture is thick and cooked through. When the curd has the thickness of whipped cream, take off the heat and pour through a sieve into a small bowl to cool completely."},{"Step 3":"For the meringue crown, line a baking tray with baking paper and sit an oiled springform ring on the tray, without the base. Whisk the egg whites to soft peaks (see Be A Better Cook for our guide to whipping), add half the sugar and beat for 5 minutes, then add the remaining sugar and beat for a further 5 minutes until the sugar has dissolved and the meringue is glossy."},{"Step 4":"Sprinkle a few drops of food colouring and the freeze-dried strawberry pieces over the meringue, then use a tablespoon to gently fold them through the meringue in 3-4 folds to create a ripple effect. Spoon this mixture onto the lined baking tray using the springform tin to guide the size and shape – the meringue doesn’t need to touch the sides of the tin as it will expand in the oven, so leave about a 2cm gap around the edge. Try to create a spiky, swirly top for a crown effect."},{"Step 5":"Bake for 1 hour, then turn off the oven and let the meringue cool for 30 minutes in the oven with the door ajar. Remove and allow to cool completely, then remove the ring, using a sharpknife to detach it first."},{"Step 6":"To assemble, whip the cream until soft peaks (that flop over) form. Put one cake layer on a cake stand, spread with a third of the lemon curd, then half the cream and half the sliced berries. Top with another cake layer, then repeat with another third of the curd and the remaining cream and sliced berries. Finish with the final cake layer and most of the remaining curd, then add the meringue crown. Dot the rest of the curd over the meringue, then decorate with the strawberry halves. Serve in slices."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/4.jpg"}