{"id":"10","title":"Spring lamb cupcakes","difficulty":"Easy","portion":"Makes 12","time":"Hands-on time 40 min, oven time 15-18 min, plus cooling","description":"These cute Easter cupcakes shaped as spring lambs are perfect for baking with kids over the long Easter bank holiday weekend.","ingredients":["150g butter, softened","150g caster sugar","150g self-raising flour","3 large free-range eggs","2 tbsp milk","½ tsp vanilla extract","150g black sugarpaste","15g white sugarpaste (see tips)","100-120g white mini marshmallows","50g butter, softened","100g icing sugar, plus extra for dusting","Few drops vanilla extract","12-hole muffin tin lined with cupcake cases","Electric mixer"],"method":[{"Step 1":"To make the cupcakes, heat the oven to 190°C/170°C fan/gas 5. Put the butter, sugar, flour, eggs, milk and vanilla extract in a large mixing bowl and beat using an electric mixer until light and fluffy. Divide the mixture among the cupcake cases in the tin and bake for 15-18 minutes or until the cakes have risen and spring back when lightly pressed in the centre. Remove from the oven and transfer to a wire rack to cool."},{"Step 2":"To make the sheep faces, break off a small piece of black sugarpaste (about 10g in weight), then knead to soften and shape into an oval. Slightly flatten the oval, shape to make one end slightly narrower than the other (to create the forehead and chin), then set aside."},{"Step 3":"Take 2 smaller pieces of black sugarpaste, knead gently, then flatten into little ovals for the ears. Press these onto either side of the wider part of the head (see tips)."},{"Step 4":"To make the eyes, take 2 small balls of white sugarpaste and press them onto the head, flattening them slightly. Then make 2 very tiny balls of black sugarpaste and press onto the eyes (or see tips). If you like, make a small long cone shape from the black sugarpaste and flatten it slightly for a tail."},{"Step 5":"To make the buttercream frosting, put the butter in a large mixing bowl and add the icing sugar, vanilla extract and 1 tbsp boiling water. Beat well until smooth, light and fluffy."},{"Step 6":"Working on one cake at a time, spread buttercream over the top of a cake and stick on a head, then press white mini marshmallows around it, all over the top. Stick on the tail, if using. Let the children pile in…"}],"image":"https://apipics.s3.amazonaws.com/cakes_api/10.jpg"}