{"id":"6","title":"Spiced plum cake with swiss meringue frosting","difficulty":"Easy","portion":"Serves 8-10","time":"Hands-on time 45 min","description":"Usher in autumn with our spiced plum cake. A golden sponge studded with juicy red plums is coated in a thick layer of swiss meringue frosting.","ingredients":["350-400g red plums, halved and stoned","2 tbsp golden syrup","2 tbsp soft dark brown sugar","6 cardamon pods, crushed with the flat of a cook’s knife","1 cinnamon stick","225g butter, softened","225g golden caster sugar","3 medium free-range eggs","1 tsp baking powder","75g ground almonds","1 tsp ground cinnamon","200g self-raising flour","150g egg whites (about 5)","300g white caster sugar"],"method":[{"Step 1":"Heat the oven to 170ºC fan/ gas 5. Toss the plums in a small roasting tin with the golden syrup, brown sugar and the whole spices. Bake for 30 minutes until the plums are tender and the juice is syrupy. Set aside to cool. Remove and discard the whole spices."},{"Step 2":"Turn down the oven to 160ºC fan/gas 4. For the cake, use an electric mixer to beat the butter and golden caster sugar until pale and creamy, then add the eggs one at a time, beating between additions (see Know How). Mix the baking powder, ground almonds and ground cinnamon with the flour, then mix into the cake batter in a couple of additions."},{"Step 3":"Gently stir in 2-3 spoonfuls of the cooled plum syrup, then ripple through the cooked plums. Spoon the cake batter into the prepared tin, level the top, then bake for 45-55 minutes, Turn the oven down a notch if the cake starts to brown too much."},{"Step 4":"Leave to cool in the tin on a wire rack for 10 minutes, then unclip the tin and let the cake cool completely."},{"Step 5":"To make the frosting, heat 4cm water in a pan over a low-medium heat to a gentle simmer. Put the egg whites and sugar in a stand mixer bowl (or mixing bowl if using a hand mixer). Rest the bowl over the simmering water and, using a flexible spatula or wooden spoon, stir constantly for 10 minutes or until the sugar has dissolved and the mixture reads 72°C on a digital thermometer. Keep the water at the gentlest simmer or you risk cooking the egg whites and you’ll have to start again."},{"Step 6":"Once the mixture reaches 72°C, remove from the heat and whisk on medium speed until stiff peaks form (that don’t flop over) and the meringue is no longer warm to the touch."},{"Step 7":"Spoon the cooled meringue frosting over the top and sides of the cake, swirling it into attractive patterns, then (if you like) use a blowtorch to caramelise the swirls."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/6.jpg"}