{"id":"47","title":"Mary Berry’s malted chocolate cake","difficulty":"Easy","portion":"Serves 8-10","time":"Takes 20 min to prepare, 25-30 min to bake, plus cooling","description":"Mary Berry’s malted chocolate cake recipe is made with a malted icing and topped with Maltesers. It’s a real crowd-pleaser and family favourite.","ingredients":["30g malted chocolate drink powder, such as Ovaltine","30g cocoa powder","225g butter, softened, plus extra for greasing","225g caster sugar","225g self-raising flour","1 tsp baking powder","4 eggs","3 tbsp malted chocolate drink powder","1½ tbsp hot milk","125g butter, softened","250g icing sugar, plus extra for dusting","50g dark chocolate (at least 50 per cent cocoa solids), melted","1 tbsp boiling water","About 20 Maltesers, to decorate"],"method":[{"Step 1":"You will need two 20cm round sandwich tins. Preheat the oven to 180°C/160°C fan/Gas 4 and grease the tins with butter and line the bases with baking paper."},{"Step 2":"Measure the malted chocolate drink powder and cocoa powder into a large bowl, pour over 2 tablespoons of water and mix to a paste. Add the remaining cake ingredients and beat until smooth."},{"Step 3":"Divide evenly between the prepared tins and bake in the oven for 20–25 minutes. Set aside in the tins to cool for 5 minutes, then turn out on to a wire rack to cool completely."},{"Step 4":"To make the icing, measure the malted chocolate drink powder into a bowl,  add the hot milk and mix until smooth. Add the butter, icing sugar and melted chocolate and mix again until smooth, then add the boiling water to give a gloss to the icing."},{"Step 5":"Place one cake on a plate and spread over half the icing. Sandwich with the other cake and spread (or pipe) the remaining icing on top, using the tip of a rounded palette knife to create a swirled effect from the centre to the edge of the cake. Arrange the Maltesers over the top and dust with icing sugar before serving."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/47.jpg"}