{"id":"48","title":"Chocolate celebration layer cake","difficulty":"Easy","portion":"Serves 22-24","time":"Takes 1 hour 15 minutes to make, 1 hour 10 minutes to cook","description":"Patissier Eric Lanlards’s chocolate cake recipe makes for an elegant, glamorous and celebratory centre piece and a very special birthday cake.","ingredients":["350g unsalted butter, softened, plus extra for greasing","350g golden caster sugar","50ml black treacle","8 large free-range eggs, lightly beaten","50g dark chocolate (70 per cent cocoa solids), melted","1 tbsp chocolate extract (we like Nielsen-Massey)","2 tsp vanilla bean paste or extract","2 tsp coffee extract (we like Nielsen-Massey)","300g self-raising flour","50g cocoa powder","2 tsp baking powder","50g ground almonds","Blackberries to decorate (optional)","125g unsalted butter, softened","200g icing sugar, sifted","1 tsp vanilla bean paste or extract","2 tsp chocolate extract","30g dark chocolate (70 per cent cocoa solids), melted","2 tbsp single cream","250g single cream","2 tsp vanilla bean paste or extract","2 tsp glucose syrup (from the baking aisle of large supermarkets)","250g dark chocolate (70 per cent cocoa solids), melted","25g unsalted butter, softened"],"method":[{"Step 1":"Preheat the oven to 170°C/fan150°C/gas 3½. Grease and line 2 x deep round cake tins (one 15cm diameter, the other 20cm) with baking paper."},{"Step 2":"In a large bowl, cream the 350g butter with the golden caster sugar using an electric hand mixer until light and fluffy. Beat in the treacle, then add the eggs, a little at a time, with the mixer on a slow speed. Fold in the 50g melted chocolate, 1 tbsp chocolate extract, 2 tsp vanilla bean paste/extract and the coffee extract. Sift in the flour, cocoa powder and baking powder, then fold in the ground almonds. You should have a smooth, glossy cake batter. Pour the mixture into the prepared cake tins so each one is three-quarters full. Bake the small sponge for 55 minutes and the large one for 1 hour 10 minutes. Push a skewer into the middle of each to check they’re done (the skewer should come out clean)."},{"Step 3":"Remove the sponges from the oven and cool in their tins for 10 minutes, then turn out onto wire racks to cool completely (see Know-how)."},{"Step 4":"To make the butter icing, use an electric hand mixer to cream the 125g butter with the icing sugar in a mixing bowl until soft and light. Add the 1 tsp vanilla bean paste/extract, 2 tsp chocolate extract, 30g melted chocolate and 2 tbsp cream. Beat until smooth and fluffy, taking care not to over-beat as it may split."},{"Step 5":"Carefully slice each cooled sponge into 3 layers (see Know-how). Put the top layer of the large sponge cut-side up on a serving plate, then spread with butter icing (see tip). Top with the second large sponge layer and spread with more icing. Repeat with the remaining sponge layers, stacking the small cake layers on top. Set aside in a cool place."},{"Step 6":"For the ganache, gently warm the cream in a small pan. Add the 2 tsp vanilla bean paste/extract and the glucose syrup, then fold in the 250g melted chocolate, gently stirring until the mixture is smooth. Stir in the 25g butter, then set aside for a few minutes, stirring occasionally, until it has a spreadable consistency. Spread all over the cake, using a palette knife to smooth the surface. Decorate with blackberries and candles, if you like, then serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/48.jpg"}