{"id":"20","title":"Tunnock’s teacake traybake","difficulty":"Easy","portion":"Serves 16","time":"Hands-on time 25 min, Oven time 25 min","description":"Our traybake take on Tunnock’s teacakes sees a thick layer of pillowy meringue sandwiched between a biscuity base and a blanket of chocolate. Slice into squares and share with friends as afternoon tea.","ingredients":["170g medium oatmeal","170g wholemeal flour","½ tsp fine sea salt","½ tsp baking powder","25g golden caster sugar","30g dark muscovado sugar","150g chilled, unsalted butter, diced","3 tbsp milk","200g dark chocolate, melted","3 medium free-range egg whites","150g caster sugar","2 tbsp golden syrup","½ tsp fine sea salt","½ tsp vanilla extract","33cm x 23cm swiss roll/roulade cake tin, lined with non-stick baking paper with a 3cm overhang on 2 ends"],"method":[{"Step 1":" Heat the oven to 180°C/160°C fan/gas 4. To make the base, pulse the oatmeal, flour, salt, baking powder and sugars in a food processor, add the butter and pulse to breadcrumbs. Add the milk and whizz until the mixture comes together. Alternatively, mix the dry ingredients in a bowl, then rub in the butter and use a knife to stir in the milk."},{"Step 2":"Tip into the tin, then use the back of a metal spoon to press it down and smooth the top. Bake for 25 minutes or until the biscuit has come away from the edges of the tin and feels firm to the touch. Cool in the tin set on a wire rack."},{"Step 3":"Put all the meringue ingredients in a large heatproof bowl set over a panof simmering water (don’t let the bowl touch the water). Using an electric hand mixer, whisk the mixture for 6-8 minutes until thickened – the mixture must be very stiff to hold its shape. Spoon over the cooled biscuit base."},{"Step 4":"Leave the meringue to set, then pour over the melted chocolate, smoothingit over with the back of a spoon. Leave in a cool place to set, then use a hot sharp knife to cut into 16 rectangles."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/20.jpg"}