{"id":"55","title":"Ultimate chocolate mousse cake","difficulty":"Medium","portion":"Serves 10-12","time":"Takes 45 min to make, 45-50 min to cook, plus overnight chilling","description":"A sumptuous, rich and moist chocolate cake recipe that’s great to serve at birthdays and celebrations – it’ll serve 10 to 12 guests. You can add a splash of Grand Marnier for a special twist, too.","ingredients":["225g plain chocolate (70% cocoa solids)","5 large free-range eggs, separated","150g golden caster sugar","125g unsalted butter, softened","50g ground almonds","4 tbsp Grand Marnier (optional)","Rice paper daisies (optional), to decorate","142ml pot double cream","225g plain chocolate (70% cocoa solids)","4 large free-range eggs, separated","200g plain chocolate (70% cocoa solids)","50g butter","2 tbsp icing sugar"],"method":[{"Step 1":"Preheat the oven to 180°C/fan 160°C/gas 4. Line the base of a 20cm springform cake tin with baking paper."},{"Step 2":"For the cake, put the chocolate in a small bowl set over a pan of gently simmering water and melt slowly. Take off the heat, stir until smooth and set aside to cool slightly."},{"Step 3":"Put the egg yolks and sugar in a bowl and beat with an electric whisk, until pale and thick. Keep whisking, adding the softened butter, a little at a time, then lower the whisk setting and whisk in the melted chocolate, then stir in the ground almonds."},{"Step 4":"In a clean bowl, whisk the egg whites to soft peaks. Beat a quarter of the egg whites into the chocolate mixture to loosen, then fold in the rest. Pour into the tin. Bake for about 45-50 minutes, until risen and firm but still a little moist in the centre when pierced with a skewer. Cool in the tin. When cool, remove and halve horizontally. Put the top layer, cut-side up, back in the tin and drizzle with half the liqueur, if using."},{"Step 5":"Make the mousse. Lightly whip the cream and set aside. Melt the chocolate over a pan of gently simmering water. Beat in the egg yolks, then fold in the cream. Whisk the egg whites in a bowl to soft peaks, then fold into the chocolate mixture. Spoon over the cake layer in the tin, spreading it to the edges."},{"Step 6":"Position the other cake layer cut-side down on top of the mousse and drizzle with the remaining liqueur, if using. Chill overnight."},{"Step 7":"Remove the cake from the tin and put on a plate. For the icing, melt the chocolate, butter and icing sugar in a bowl over a pan of gently simmering water. Spoon over the top of the cake and let it drip slightly over the edges. Decorate with the rice flowers, if using, and serve cut into wedges."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/55.jpg"}