{"id":"9","title":"Rhubarb and custard layer cake","difficulty":"Easy","portion":"Cuts into 16 slices","time":"Hands-on time 60-70 min, oven time 70-85 min, plus cooling and setting","description":"This glorious rhubarb and custard layer cake is so pretty: its jaw-dropping decoration makes it perfect for special occasions such as Easter Sunday or Mother’s Day. If you want to make the cake less fancy, it tastes just as good unadorned.","ingredients":["250g unsalted butter, softened, plus extra to grease","250g caster sugar","1 tsp vanilla extract","4 large free-range eggs","250g self-raising flour","3-4 tbsp whole milk","9-12 tbsp (about 200g) shop-bought rhubarb jam – or see tips","300ml whole milk","½ tsp vanilla bean paste","3 large free-range egg yolks (see Tip)","60g caster sugar","45g cornflour","200ml double cream","400g forced rhubarb, cut into 5cm pieces","1 unwaxed orange","125g caster sugar","125g unsalted butter, softened","80g icing sugar","100g full-fat cream cheese (we used Philadelphia) at room temperature","Squeeze of lemon/orange juice","100g Lindt white chocolate, chopped","200g Lindt Lindor white chocolate truffles, chopped","Candied rhubarb (see Tip)","Electric mixer","2 x 20cm cake tins, greased and lined with compostable baking paper","Extra compostable baking paper","Deep baking dish","Foil","Piping bag fitted with 0.5cm nozzle"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Beat the butter, sugar and vanilla extract in a large mixing bowl until pale and fluffy. Add the eggs, one at a time, beating well between each addition. Fold in the flour with a pinch of salt, adding 3-4 tbsp milk, as needed, to form a smooth batter."},{"Step 2":"Divide the batter between the cake tins and bake in the centre of the oven for 20-25 minutes until golden and risen and a skewer pushed into the centre comes out clean. Turn out onto a wire rack and leave to cool."},{"Step 3":"For the filling, put a small pan over a low heat and heat the milk and vanilla bean paste until simmering. Whisk the egg yolks, sugar and cornflour in a bowl. Slowly whisk in the hot milk, then return the mixture to the pan. Cook over a medium heat, whisking, for 2-3 minutes until thick. Cover with slightly damp compostable baking paper to prevent a skin forming, then leave to cool. Whisk the cream to firm peaks. Beat the custard to soften, whisk in a dollop of cream to loosen further, then fold in the rest of the cream."},{"Step 4":"For the roasted rhubarb, heat the oven to 110°C/90°C fan/gas ¼. Arrange the rhubarb in a single layer in a deep baking dish. Pare 3 strips of orange zest, then slice the strips thinly and add to the rhubarb with the juice of the orange. Sprinkle over the sugar and mix gently. Cover with foil and bake for 50-60 minutes. Remove from the oven, uncover and carefully pour any juices into a pan. Boil the juices rapidly for 5-6 minutes until slightly reduced. Cool, then pour back over the rhubarb."},{"Step 5":"For the buttercream, whisk the butter and icing sugar in a mixing bowl until fluffy. Gradually beat in the cream cheese, bringing back to a smooth consistency before adding more. Add a squeeze of lemon/orange juice to taste."},{"Step 6":"To assemble the cake, put 1 tbsp buttercream in the centre of a serving plate. Halve each cake horizontally and set one half on the buttercream to secure it. Spread 3-4 tbsp jam over the centre of the top, then pipe or spread a quarter of the custard over this. Repeat the cake, jam and custard layers twice more, then top with the final cake half. Cover the cake in a thin layer of buttercream. Set aside or chill until ready to serve or decorate (optional)."},{"Step 7":"For the decoration, put the chopped chocolate in a small heatproof bowl set over a pan of barely simmering water, making sure the bowl doesn’t touch the water. Leave to melt (don’t stir), then spread over the lined baking tray and leave to set. Once hard, break into large shards. Put the chopped truffle balls in the same bowl and set back over the pan of barely simmering water to melt. Set aside for 10-15 minutes to cool slightly and thicken."},{"Step 8":"Drizzle some melted truffles over the top of the cake, encouraging a few drips down the sides. Spoon the remaining custard on top, then nestle in some of the roasted rhubarb. Add a drizzle of melted truffles, followed by candied rhubarb (see box, opposite) and chocolate shards. Slice and serve with extra roasted rhubarb and syrup on the side, if you like (or see tips)."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/9.jpg"}