{"id":"37","title":"Coconut and lime angel cake","difficulty":"Easy","portion":"Serves 12","time":"Hands-on time 35 min, oven time 45-50 min, plus around 2 hours cooling","description":"Coconut and lime represent the flavours of summer in this easy baking recipe. Angel cake is a light and airy butterless sponge.","ingredients":["125g plain flour","300g caster sugar","10 large free-range egg whites","Finely grated zest 4 limes, 1 tbsp juice","1 tsp cream of tartar","½ tsp salt","300ml double cream","3 tbsp icing sugar","Juice 1 lime","75ml coconut cream (we like Blue Dragon)","3 tbsp coconut rum (we like Koko Kanu)","Coconut flakes to decorate","A 25cm diameter angel cake pan with a removable base and cooling legs (from cake shops and Amazon)"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Sift the flour and 100g of the caster sugar into a bowl and set aside."},{"Step 2":"Whisk the egg whites in a large bowl with an electric mixer on medium for 1 minute or until frothy. Add the lime zest, juice, cream of tartar and salt. Whisk for 2-3 minutes until the mixture forms soft peaks when the whisk is raised. Increase the speed to high, then add the remaining caster sugar, a little at a time, until the mixture is glossy."},{"Step 3":"Sift a third of the flour/sugar mixture over the egg mix and fold gently with a metal spoon or balloon whisk to just combine. Repeat with the remaining two thirds, folding as gently as possible."},{"Step 4":"Carefully transfer the batter to the cake pan, then run through it with a knife to remove any air pockets. Bake in the middle of the oven for 45-50 minutes until risen, golden and springy."},{"Step 5":"Take out of the oven and immediately place upside-down on the pan’s cooling legs. Leave to cool for 1 hour 30 minutes (we know this seems odd, but trust us!). Run a knife around the cake’s inner and outer edges, then push the cake out, still attached to the pan base, onto a wire rack. Using a palette knife, carefully lift away the pan base. Cool."},{"Step 6":"To make the icing, whisk the cream, icing sugar, lime juice, coconut cream and rum in a large mixing bowl with a balloon whisk or electric mixer. Stop once the mixture develops soft, pillowy peaks. Spread the icing all over the cake to cover, then scatter with a generous amount of coconut flakes. Use a serrated knife to slice the cake. It’s best eaten the day it’s baked."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/37.jpg"}