{"id":"18","title":"Caramelised white chocolate, burnt butter and tahini cake","difficulty":"A challenge","portion":"Serves 20","time":"Hands-on time 1 hour 40 min, oven time 1 hour 20-25 min, plus chilling","description":"Bake John Whaite’s epic white chocolate, burnt butter and tahini celebration cake to really impress your guests or celebrate a birthday.","ingredients":["150g white chocolate (we used Waitrose Belgian white chocolate), chopped","300g unsalted butter, diced","Grated zest 1 lemon","300g caster sugar","300g self-raising flour","6 large free-range eggs","100g caster sugar","100g liquid glucose (from the baking section of supermarkets)","200g mixed white and black sesame seeds (or use all white)","225g unsalted butter, at room temperature","100g tahini","1 tsp vanilla bean paste/extract","½ tsp salt","300g icing sugar","200g dark chocolate (at least 70% cocoa solids)","1 tbsp golden syrup","50g unsalted butter","3 x 20cm sandwich tins, greased, bases lined with non-stick baking paper; piping bag fitted with a 1cm nozzle; palette knife"],"method":[{"Step 1":"Heat the oven to 120°C/100°C fan/gas ½. Put the white chocolate on a baking tray and put in the oven for an hour. Every 15 minutes or so, give the chocolate a stir with a spatula. It will start to turn a little darker in colour and chalky in consistency (don’t worry – it will be fine). After an hour the chocolate should taste caramelised. Take out of the oven and put in a heatproof mixing bowl."},{"Step 2":"Turn the oven up to 180°C/160°C fan/gas 4. Put the 300g butter in a pan set over a high heat, swirling the pan as the butter melts and bubbles. When the bubbling starts to subside you’ll be left with a fine, cappuccino-like foam on top and the butter will smell nutty. Take off the heat and pour into the bowl with the chocolate. Stir to mix the chocolate into the butter, then add the lemon zest. Cool briefly, then whisk in the sugar and flour, then the eggs, to give a fairly runny batter. Divide evenly among the cake tins and bake for 20-25 minutes until lightly golden (a skewer pushed into the centre should come out clean). Leave the cakes in the tins to cool for 5 minutes, then invert onto a rack to cool completely (see Make Ahead)."},{"Step 3":"For the brittle, have 2 large pieces of baking paper and a rolling pin to hand. Put the sugar and glucose in a pan with 50ml cold water. Heat gently and stir with a wooden spoon until the sugar has more or less dissolved. At this point, stop stirring, turn the heat to high and bring to the boil. Don’t stir or the mix may crystallise – just let it bubble. Once the syrup has turned an orangey amber, take the pan off the heat and quickly stir in the sesame seeds before the caramel sets. Immediately tip the mixture into the centre of one of the sheets of baking paper and top with the second piece. Carefully (because the brittle will be hot) use a rolling pin to roll the brittle mix between the pieces of baking paper until very thin. Set aside to cool and set hard."},{"Step 4":"For the buttercream, use an electric hand mixer to beat the butter and tahini in a mixing bowl until combined, aerated and pale in colour. (If using a stand mixer, use the whisk attachment.) Add the vanilla, salt and icing sugar, then whisk for 1-2 minutes more."},{"Step 5":"Once the sponges have cooled, put one sponge, top-side down, on a cake stand and cover the upper surface with a thin layer of buttercream. Repeat with the remaining sponges, also top-side down. Cover the entire cake as neatly as possible with more buttercream, scraping it thin with a palette knife so some cake shows through and saving some buttercream to pipe on top of the cake. Chill the cake for a good 20 minutes to firm up the buttercream."},{"Step 6":"For the chocolate topping, put the chocolate, syrup and butter in a small heatproof bowl and stir, set over a pan of barely simmering water (don’t let the water touch the bowl). When melted and combined, leave to cool for 2 minutes, then pour over the top of the chilled cake so some dribbles down over the edge. Leave at room temperature. "},{"Step 7":"Fill the piping bag with the rest of the buttercream and pipe 11 generous blobs around the top of the cake. Smash the brittle into shards of different shapes and sizes, then arrange 11 of them on top of the cake, leaning against the blobs of buttercream. Enjoy the remaining brittle shards with ice cream."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/18.jpg"}