{"id":"23","title":"Orange blossom, lemon thyme and almond cake","difficulty":"Easy","portion":"Serves 12","time":"Hands-on time 25 min, cooking time 30 min, plus cooling","description":"This stunning cake sees zesty orange and almond sponge slathered in honey and orange blossom cream, then drizzled in rosé red berry syrup. Why not bake it as a Mother’s Day surprise or for a summery afternoon tea centrepiece?","ingredients":["100ml light olive oil","100g golden caster sugar","3 medium free-range eggs","Grated zest and juice 1 orange","2 tsp orange blossom water","100g plain yogurt","150g self-raising flour","100g ground almonds","3 tbsp golden caster sugar","A few lemon thyme sprigs, plus extra to serve","100ml rosé wine","150g raspberries","100ml double cream","150g crème fraîche","1 tbsp runny honey","½-1 tsp orange blossom water (depending on strength)","20cm springform cake tin, base lined and lightly greased"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Put the olive oil, sugar, eggs, orange zest and juice, orange blossom water, yogurt, self-raising flour and ground almonds in a large bowl and whisk until just combined. Pour into the prepared tin and bake for 35 minutes or until a skewer pushed into the centre comes out clean. Cool on a wire rack in the tin for 5-10 minutes, then turn out and leave to cool completely."},{"Step 2":"Meanwhile make the rosé red berries. Put the sugar, thyme and rosé wine in a medium pan and heat until the sugar has dissolved. Bring to the boil, then reduce to a simmer for 5 minutes until thickened to a syrup. Remove from the heat and leave to cool for 10 minutes. Add the berries, stir gently and set aside."},{"Step 3":"In a bowl, whisk the cream, crème fraîche, honey and as much orange blossom water as you think it needs until it forms soft peaks. Put the cake on a plate or cake stand and spoon the cream on top. Add the berries, drizzle with the syrup and scatter with extra thyme leaves."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/23.jpg"}