{"id":"3","title":"Paul Hollywood’s chocolate fudge cake","difficulty":"Easy","portion":"Serves 10-12","time":"Hands-on time 20 min, Oven time 25-30 min","description":"In the words of Paul himself: “If you love chocolate cake, you have to try this one.”","ingredients":["175g soft margarine, plus extra to grease","225g light soft brown sugar","200g caster sugar","3 large free-range eggs","1 tsp vanilla extract","250g plain flour","125g cocoa powder","1½ tsp baking powder","½ tsp fine salt","375ml soured cream","For the chocolate frosting","150g dark chocolate, broken into small pieces","100g cocoa powder","100ml just boiled water","225g unsalted butter, softened","6 tbsp icing sugar","3 x 20cm loose-bottomed sandwich tins"],"method":[{"Step 1":"Using a stand mixer fitted with the whisk attachment or electric hand mixer, beat the margarine and sugars together until the mixture is pale and fluffy – this will take around 5 minutes. Scrape down the sides of the bowl with a spatula and whisk again."},{"Step 2":"In a separate bowl, beat the eggs with the vanilla extract. With the mixer still running on a low-medium speed, slowly pour the beaten eggs into the mixture."},{"Step 3":"Sift the flour with the cocoa powder, baking powder and salt. Stir a large spoonful into the whisked mixture, then mix in a large spoonful of the soured cream. Repeat until all the flour and soured cream are incorporated. Beat until you have a smooth batter."},{"Step 4":"Heat the oven to 160°C fan/gas 4. Grease 3 x 20cm loose-bottomed sandwich tins and line the bases with baking paper. Divide the batter equally among the prepared tins. Bake for 25-30 minutes until the cakes are risen and slightly shrunk away from the sides of the tin. Leave to cool in the tins before transferring to a wire rack to cool completely."},{"Step 5":"To make the frosting, melt the chocolate in a heatproof bowl set over a pan of simmering water, making sure the base of the bowl is not in contact with the water. Stir until smooth, then set aside to cool. In another bowl, mix the cocoa powder with the boiling water to make a thick paste."},{"Step 6":"In a large bowl, beat the butter until soft and fluffy, then add the icing sugar and whisk until pale and fluffy. Add the melted chocolate and cocoa paste and beat until the frosting is smooth."},{"Step 7":"To assemble the cake, put one cake layer on your serving plate and spread with a quarter of the frosting. Put a second cake layer on top and spread with another quarter of the frosting. Position the final cake layer on top and cover the top and sides with the remaining frosting. Leave the frosting to set before cutting the cake."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/3.jpg"}