{"id":"46","title":"Pop cakes","difficulty":"Easy","portion":"Makes 12","time":"Hands-on time 25 min, oven time 25-30min, plus cooling and at least 6 hours freezing","description":"These pop cakes are inspired by Enid Blyton‘s book The Magic Faraway Tree – they’re eaten by the children who climb the giant enchanted tree. Try this fun recipe for a kids’ party or afternoon tea.","ingredients":["Sunflower oil for greasing","12 tsp clear honey","425g plain flour","¼ tsp baking powder","¼ tsp salt","200g granulated sugar","225g unsalted butter","2 large free-range eggs","1 tsp vanilla extract","150g icing sugar","Juice ½-1 lemon","Popping candy (from Waitrose, sweet shops and online baking suppliers) and sugar strands to decorate – optional","Ice cube tray","12-hole muffin/fairy cake tin"],"method":[{"Step 1":"At least 6 hours before you want to make the cakes (but preferably the day before), lightly oil 12 ice cube moulds, divide the honey among the moulds, then freeze until solid."},{"Step 2":"To make the cakes, heat the oven to 180°C/fan160°C/gas 4. Lightly oil a 12-hole muffin fairy cake tin. Mix the flour, baking powder and salt in a bowl and set aside. In another large bowl, beat the sugar with the butter using an electric mixer until light and glossy. Add the eggs, one at a time, beating after each addition, then add the vanilla. Turn the mixer to low and beat in the flour, in 2-3 additions, until well combined into a stiff dough."},{"Step 3":"Tear off 12 x 1.5cm balls of dough (using about half the dough), then press into the bases of the muffin tin holes. With the rest of the dough, make 12 more balls and keep them handy. Working quickly, remove the tray with the honey cubes from the freezer and lever them out of the tray. Put one on top of each blob of dough in the tin, then press the remaining dough balls over the top, completely encasing the honey cube so it can’t escape from the pop cake when it melts. Put straight in the oven (or freeze – see make ahead) and bake for 25-30 minutes until the pop cakes are crisp and pale golden."},{"Step 4":"Remove from the oven and leave to cool for 30 minutes. Turn out and leave to cool completely."},{"Step 5":"Make the icing by putting the icing sugar into a bowl. Stirring constantly with a fork or small whisk, pour in enough lemon juice to make a thick icing (you’ll need less juice than you think). Dip the pop cakes into the icing so the tops are evenly covered, then hold upside-down for a few seconds to allow the excess to drip off. Scatter with popping candy and sugar strands (if using), leave for 20 minutes to set the icing, then serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/46.jpg"}