{"id":"8","title":"Chocolate cake with caramel poached pears and chocolate buttercream","difficulty":"Medium","portion":"Serves 12-15","time":"Hands-on time 30 min, plus cooling","description":"Give chocolate cake an autumnal twist. Fill this rich chocolate sponge with silky swiss meringue buttercream and top with caramel poached pears:.","ingredients":["300g caster sugar","80g light muscovado sugar","180g dark chocolate (60-70% cocoa solids)• 130g butter, diced","1 tbsp espresso powder","170ml buttermilk","1 medium free-range egg, plus 2 medium egg yolks (reservethe whites for the buttercream)"," 300g plain flour","40g dutch-processed cocoa powder (such as Green& Black’s; see Know How)","1¼ tsp bicarbonate of soda","300g caster sugar","1 cinnamon stick","2 star anise","1 vanilla pod, split lengthways, seeds scraped","5 small firm pears, peeled (such as bosc, comice or williams)","150g caster sugar","140g egg whites (about 5)","¼ tsp salt","300g unsalted butter, diced  and softened","100g dark chocolate, melted and cooled","100g milk chocolate, melted and cooled","1 tsp vanilla extract"," 2 x 20cm loose-bottomed round cake tins, lined with compostable baking paper","Digital probe thermometer","Electric hand or stand mixer"],"method":[{"Step 1":"Heat the oven to 160ºC fan/gas 4. To make the cake, put both sugars, the chocolate, butter, espresso powder and 250ml water in a pan, then stir over a low heat until melted and smooth. Whisk in the buttermilk, followed by the egg and yolks, until smooth and well combined."},{"Step 2":"Sift the flour, cocoa and bicarb into a large bowl. Make a well in the middle, then pour in the chocolate mixture and whisk until just combined."},{"Step 3":"Divide the batter between the prepared tins and bake for 45-50 minutes until a skewer pushed into the centre comes out clean. Cool the cakes in the tins for 10 minutes, then turn out onto a wire rack and set aside to cool completely (see Make Ahead)."},{"Step 4":"To make the poached pears, put the sugar in a pan that will just fit the pears, along with 3 tbsp water. Stir over a low heat until the sugar dissolves, then bring to the boil and simmer, swirling the pan from time to time, to create a dark caramel. Take the pan off the heat and add a splash of water (be careful as it will spit). Add 1 litre water, the spices and vanilla seeds and pod, then bring to the boil. Reduce the heat to low, add the pears and simmer for 25-30 minutes until tender. Reserve 250ml poaching liquid, then leave the pears to cool in the remainder (see Make Ahead)."},{"Step 5":"Put the reserved liquid in a pan and bubble until slightly thickened, syrupy and reduced by about ½. Set aside to cool."},{"Step 6":"To make the swiss buttercream, put the sugar, egg whites and salt in a large clean bowl set over a pot of barely simmering water. Cook, stirring, until the sugar dissolves and the mixture reads 72°C on a thermometer. Transfer to a bowl/stand mixer bowl and whisk with an electric mixer on medium until thick, glossy and completely cool."},{"Step 7":"Whisk in the butter, 2 cubes at a time, incorporating each addition into the meringue before adding the next. Continue until all the butter is added. The mixture will look curdled at first, but keep whisking and it will come back together. Increase the mixer speed to high and whisk for 2 minutes more. Add both cooled chocolates, then whisk again until combined. Set aside at room temperature until ready to assemble (see Make Ahead)."},{"Step 8":"To assemble, put one cake bottom-side up on a serving plate or cake stand. Drizzle with 2 tbsp of the reduced pear syrup, then spread with a third of the buttercream. Halve, core and thinly slice 2 of the pears, then arrange on top of the buttercream. Sandwich with the second cake. Drizzle more syrup over the top, then pile on the remaining buttercream, creating pillowy waves (or smooth the top and sides to fully frost if you prefer). Dip the poached pears in the reduced syrup so they’re glossy and arrange on top of the cake. Drizzle with more syrup when ready to serve."}],"image":"https://apipics.s3.amazonaws.com/cakes_api/8.jpg"}