{"id":"11","title":"Peanut butter drip cake","difficulty":"Medium","portion":"Serves 20","time":"Hands-on time 1½ hours, oven time 20-25 min, plus chilling ","description":"A dark chocolate sponge is sandwiched and covered with peanut buttercream, drizzled with a rich chocolate ganache then topped with chocolate biscuits and sweets.","ingredients":["80g dark cocoa powder (we used Green & Blacks)","350g light muscovado sugar","1 tbsp espresso powder","300ml boiling water","300g unsalted butter, softened, plus extra for greasing","150g dark chocolate, roughly chopped","6 medium free-range eggs, fridge-cold, beaten","1 tbsp vanilla bean extract","220g plain flour","1 tsp bicarbonate of soda","1 tsp baking powder","225g unsalted butter, softened","250g smooth peanut butter","375g icing sugar","1 tsp vanilla extract","½ tsp fine sea salt","2 tbsp milk","150g dark chocolate (at least 70% cocoa solids), finely chopped","300ml double cream","3 x 20cm sandwich tins, greased and base-lined with non-stick baking paper","An electric mixer"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/gas 3½. Put the cocoa powder, 100g of the muscovado sugar and the espresso powder into a large measuring jug. Pour in the boiling water and whisk with a balloon whisk until smooth."},{"Step 2":"In a medium pan set over a low heat, melt the butter and the remaining sugar until dissolved. Add the dark chocolate and slowly melt together, stirring occasionally."},{"Step 3":"Once melted, take off the heat, pour in the cocoa and coffee mixture, beaten eggs and vanilla bean extract, then whisk with a balloon whisk until combined. Sift the flour, bicarb and baking powder into a large mixing bowl, then pour over the chocolate mixture with a pinch of salt. Gently mix with a balloon whisk to form a smooth batter."},{"Step 4":"Divide the batter equally between the prepared tins and level using a spatula. Bake for 20-25 minutes until the sponges have risen and a skewer inserted into the centre comes out clean. Cool for 5 minutes in the tin, then turn out onto a wire rack to cool completely."},{"Step 5":"Meanwhile, make the peanut buttercream. Put the butter and peanut butter in a mixing bowl and whip using an electric mixer until light and fluffy. Add the icing sugar, one-third at a time, whisking between each addition, until smooth and stiff. Whisk in the vanilla, salt and enough milk to make a mixture that spreads easily."},{"Step 6":"Once the sponges have cooled, use a serrated knife to level the tops, if needed. Put 1 tsp buttercream in the centre of a cake plate or stand, then put the first sponge in the centre. Smooth a 5mm layer of buttercream on top of the first sponge, then repeat with the next 2 sponges until all 3 cakes are stacked on top of each other. Smooth a thin layer of buttercream all over the cake – don’t worry if you pick up some of the crumbs – this layer is called the ‘crumb coat’. Once the cake is evenly covered, transfer to the fridge to chill for 30 minutes."},{"Step 7":"Cover the cake with the rest of the icing in a smooth layer, then return to the fridge while you make the ganache."},{"Step 8":"For the ganache, put the chocolate in a large heatproof bowl and put the cream in a pan set over a medium heat. Slowly bring the cream to the boil. As soon as it starts to bubble, pour over the chocolate and leave to stand for 2 minutes. Stir until the chocolate has completely melted, then transfer the ganache to a piping bag."},{"Step 9":"Snip a small hole at the bottom of the piping bag and pipe the ganache steadily and generously around the edge of the cake so that some of it runs down the side creating the ‘drips’. Once you’re happy with the drips, cover the top of the cake with the remaining ganache. Smooth with a palette knife, then return to the fridge to set for 30 minutes."},{"Step 10":"Decorate with a selection of your favourite chocolates or sweets – we went for Oreos, M & M’s and Kit Kats. Be creative!"}],"image":"https://apipics.s3.amazonaws.com/cakes_api/11.jpg"}