{"id":"65","title":"Chinese chicken with noodles","difficulty":"Medium","portion":"Serves 6","time":"Hands-on time 50 min, oven time 1 hour 30 min","description":"A restorative and soul-warming broth recipe made with fresh ginger, spring onions and the juiciest chicken.","ingredients":["1 whole free-range chicken (around 1.8kg)","100ml kecap manis (from the world food aisle of large supermarkets)","100ml light soy sauce (use a reduced-salt version if you prefer)","100ml dark soy sauce (see above)","80g brown sugar","3 star anise","80ml dry sherry such as fino","80g fresh ginger, thickly sliced","500ml fresh chicken stock","Flavourless oil for frying","1 large onion, finely chopped","3 garlic cloves, sliced","180g dried fine egg noodles (we like Blue Dragon)","150g shredded kale","4 spring onions, finely sliced","Large bunch fresh coriander, roughly chopped, plus extra to garnish","Lime wedges to serve"],"method":[{"Step 1":"Heat the oven to 150°C/130°C fan/gas 2. Put all the ingredients for the chicken stock into a deep ovenproof lidded casserole that will comfortably fit the chicken. Add 350ml water and bring to the boil, stirring to dissolve the sugar. Put the chicken into the casserole breast-side down."},{"Step 2":"Bring back to the boil, cover with the lid, then transfer to the oven and cook for 45 minutes. Carefully flip the chicken over and cook for another 45 minutes, then remove and leave to rest on a lipped chopping board. Strain the stock (discard what’s left behind in the sieve), then return the liquid to the pan and bubble over a high heat for 5 minutes to reduce slightly. Taste the stock: it might need a splash more sherry to balance the sweet and salty flavours. Leave on a gentle simmer while you make the noodles."},{"Step 3":"Heat a large glug of oil in a large frying pan over a medium heat. Add the onion and garlic, then cook for 7 minutes until translucent and turning a little golden at the edges."},{"Step 4":"Meanwhile, boil the noodles for about 4 minutes or according to the packet instructions, then drain and rinse under warm running water to prevent them sticking."},{"Step 5":"Add the kale to the frying onions with a small splash of water and cook for 3 minutes, then add the noodles, spring onions and coriander and cook for a minute or two until everything is hot and combined. Strip the chicken meat from the carcass, then divide among bowls. Add the noodles, pour over the stock and serve with extra coriander leaves and lime wedges."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/65.jpg"}