{"id":"20","title":"Ken Hom’s chicken on crispy noodles","difficulty":"Easy","portion":"Serves 2","time":"Hands-on time 30 min","description":"“A favourite of many dim-sum diners in Hong Kong in which thin, crisp-fried egg noodles are served with shredded chicken and sauce. The texture of the noodles contrasts with the softness of the chicken. In this recipe the chicken is velveted: that is, coated with egg white and cornflour, to keep the meat moist and tender.” Ken Hom","ingredients":["225g boneless, skinless free-range chicken breasts, shredded","1 free-range egg white","2 tsp cornflour","1 tsp salt","½ tsp freshly ground white pepper","225g fresh thin Chinese egg noodles (you could use dried noodles cooked 2 minutes less than the pack instructions)","3 tbsp groundnut or vegetable oil","175g fresh bean sprouts","2 tbsp shaoxing rice wine or dry sherry","2 tbsp oyster sauce","1 tbsp light soy sauce","300ml chicken stock","½ tsp freshly ground black pepper","1 tbsp cornflour mixed with 1½ tbsp water","3 tbsp spring onions, finely chopped, to garnish"],"method":[{"Step 1":"Combine the chicken, egg white, cornflour, salt and white pepper in a small bowl. Mix well, cover and chill in the refrigerator for at least 20 minutes."},{"Step 2":"Meanwhile, blanch the noodles for 2 minutes in a large pot of salted boiling water, then drain well."},{"Step 3":"Heat a non-stick frying pan and, when hot, add 1½ tablespoons of the oil. Evenly spread the blanched noodles over base of the pan, turn the heat to low and allow the noodles to brown slowly (this should take about 5 minutes or so). When the noodles are brown on one side, gently flip them over using a fish slice and brown the other side, adding more oil if needed. When both sides are browned, transfer the noodles to a serving plate and keep warm."},{"Step 4":"When the chicken is ready, bring 300ml water to a boil in a saucepan. Remove the saucepan from the heat and immediately add the chicken pieces, stirring vigorously with a chopstick to keep them from sticking together. When the chicken pieces turn white, after about 2 minutes, quickly drain the chicken (discard the cooking water)."},{"Step 5":"Heat a wok over a high heat. When hot, add the bean sprouts, then the rice wine, oyster sauce, soy sauce, chicken stock, black pepper and salt to taste. Bring the mixture to a boil, add the cornflour mixture and bring it to a simmer again. Return the chicken to the sauce and give everything a few stirs. Taste, adjust the seasoning if needed, then pour the chicken and sauce over the noodles. Garnish with the spring onions and serve straightaway."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/20.jpg"}