{"id":"178","title":"Szechuan salmon with pink peppercorns","difficulty":"Easy","portion":"Serves 4","time":"Takes 30 minutes to make, 12-15 minutes in the oven, plus marinating and cooling","description":"This low fat and high protein salmon recipe is full of spicy Szechuan flavour.","ingredients":["1 tbsp pink, Szechuan or black peppercorns","1 tbsp sugar","4 salmon steaks, about 250g each, scaled","4 tbsp rice or sherry vinegar","4 tbsp light soy sauce","1 small iceberg lettuce, outer leaves discarded","1 cucumber","250g red seedless grapes, some halved","25g Japanese-style pickled ginger","Small bunch of fresh coriander or Vietnamese-style mint or basil, roughly chopped"],"method":[{"Step 1":"Shake the peppercorns around in a dry, hot frying pan for about 1 minute, until they smell aromatic. Lightly crush the peppercorns with the sugar using a mortar and pestle, rub onto both sides of the salmon steaks and place in a dish. Combine half the vinegar and soy sauce and pour over the fish. Set aside in a cool place for 1-2 hours, turning halfway."},{"Step 2":"Preheat the oven to 200°C/fan180°C/gas 6. Lift the salmon from the marinade and place on a baking tray lined with non-stick baking paper. Discard the marinade. Cook for 12-15 minutes, until just cooked through but still pink and juicy in the middle. Allow to rest for 10 minutes if serving hot, or, better still, allow to cool completely."},{"Step 3":"Make the salad. Shred the iceberg roughly and put into a large bowl. Quarter the cucumber and deseed by running the back of a teaspoon down the length of the seed cavity. Cut into long, thin slices and add to the bowl, along with the grapes. Mix the remaining vinegar and soy sauce with the ginger and some black pepper, pour over the salad and toss together. Check the seasoning and add a little more soy if you like, but not too much or the salad will turn brown. Divide between plates and top with the herbs. Place a salmon steak alongside and serve immediately."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/178.jpg"}