{"id":"73","title":"Spiced brisket with chilli, lime, peanut and coriander","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 30 min,oven time 5 hours 50 min","description":"Try our slow-cooked beef brisket recipe made with a fresh ginger, chilli and Chinese five-spice sauce. An impressive main served with roast potatoes or steamed rice and greens.","ingredients":["2 tbsp vegetable oil","400g shallots, quartered","5 garlic cloves, crushed","500ml good quality beef stock","200ml clear honey","2kg British beef brisket","Steamed jasmine rice to serve","250ml shaoxing rice wine (from the world food section of large supermarkets)","70ml light soy sauce","70ml dark soy sauce","100g fresh ginger, finely chopped","1 tbsp chinese five-spice powder","2 large red chillies, halved","Vegetable oil for frying","150g unsalted peanuts","2 red chillies, sliced","Large handful fresh coriander, roughly chopped","3 limes, cut into wedges"],"method":[{"Step 1":"Heat the oven to 140°C/fan120°C/gas 1. Heat the oil in a large, deep frying pan. Add the shallots and fry for 5 minutes or until beginning to colour. Stir in the garlic and cook for 1 minute, then add the beef stock and spoon in 100ml of the honey. Heat for a further minute."},{"Step 2":"Mix all the sauce ingredients in a jug. Untie the brisket and put it in a deep roasting tin, then pour over the sauce along with the stock mixture. Cover the meat with a layer of baking paper, then cover the tin with 2 layers of foil, folding the edges around. Put on the oven’s middle shelf."},{"Step 3":"After 2½ hours, lift the foil and paper, turn over the brisket and baste with the juices. Return to the oven, resealed inside the paper and foil, for another 2½ hours."},{"Step 4":"Once the brisket has had its full cooking time and is tender (see tips), remove from the oven and turn the heat up to 220°C/fan200°C/gas 7. Carefully pour all the juices from the roasting tin into a deep frying pan. Set the frying pan over a high heat and bubble for 20 minutes or until the juices are reduced. Taste and season with salt and pepper."},{"Step 5":"Spoon 2 ladlefuls of the reduced sauce over the brisket, then drizzle over the remaining honey. Return to the oven for 15 minutes or until the outside of the brisket has caramelised and turned crisp."},{"Step 6":"For the topping, heat a little vegetable oil in a large frying pan and lightly toast the peanuts. Leave to cool slightly, then roughly chop and mix with the chillies and coriander. Serve the brisket with a good squeeze of lime juice, topped with the peanuts, chillies, coriander and lime wedges, and some steamed jasmine rice."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/73.jpg"}