{"id":"66","title":"Seared Asian-style beef and stir-fried savoy cabbage","difficulty":"Easy","portion":"Serves 2","time":"Hands-on time 30 min","description":"Mix savoy cabbage with seared steak and Asian ingredients for a quick, easy dinner that’s full of flavour.","ingredients":["400g British onglet (also called hanger or skirt) or sirloin steak","2 tbsp soy sauce","½ tbsp sunflower oil, plus extra","1 onion, sliced","2 garlic cloves, sliced","½ star anise","Thumb-size piece fresh ginger, coarsely grated","1 red chilli, finely sliced","30g unsalted roasted peanuts, roughly chopped","1 small or ½ medium savoy cabbage (outer leaves discarded), shredded, wilted in a colander with a kettle of boiling water and left to steam","1 tbsp fish sauce","Juice 1 lime, plus extra wedges to serve","Small bunch each fresh coriander and thai basil (or mint), roughly chopped, plus extra to serve"],"method":[{"Step 1":"Put the steak in a shallow dish and pour over the soy sauce. Heat a large frying pan or wok over a high heat. Pour in the oil and swirl the pan to coat. Add the onion and stir-fry for 2-3 minutes until softened. Turn the heat to medium and add the garlic, then stir-fry for 1 minute until the raw smell fades – keep it moving or it will burn. Remove the pan from the heat and set aside."},{"Step 2":"Heat a heavy-based frying pan over a high heat. Remove the steak from the dish (reserve the soy sauce) and rub with oil. When the pan is smoking hot, add the steak and cook for 2 minutes on each side for medium-rare, pressing down to flatten so it crisps and caramelises. Once cooked to your liking, remove to a plate and set aside to rest."},{"Step 3":"Return the first pan/wok to a high heat and, once the onions sizzle again, add the star anise and ginger, then stir-fry for 2 minutes. Once fragrant, add the chilli and peanuts, then stir-fry until the peanuts start to colour. Add the wilted cabbage and stir-fry for 5 minutes or until the cabbage has coloured a little."},{"Step 4":"Pour in half the soy sauce from the steaks (discard the rest) and the fish sauce, then squeeze in the lime and cook for 2 minutes. Scatter over the herbs and stir. Taste and season. Divide between 2 plates. Slice the steak and put on top of the stir-fry, pouring any resting juices on top. Serve immediately with lime wedges."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/66.jpg"}