{"id":"68","title":"Bao buns with braised shortrib and pickled daikon","difficulty":"Easy","portion":"Makes about 32 buns","time":"Hands-on time 1 hour, oven time 3-3½ hours, plus resting, rising and proving","description":"Rich, tender beef shortrib is balanced by sharp pickles in this authentic bao bun recipe by Erchen Chang, co-founder of London restaurant Bao. Try preparing them for a special occasion, such as Chinese New Year.","ingredients":["300g plain flour, plus extra to dust","4g fast-action dried yeast","140ml lukewarm milk or water","500g plain flour","60g caster sugar","½ tsp salt","10g fast-action dried yeast","½ tsp baking powder","20ml sunflower oil, plus extra to grease and for brushing","290ml lukewarm milk or water","Sunflower oil for frying","1.5kg British beef shortribs, ribs separated","6 garlic cloves","1 large onion, quartered","5 tbsp soy sauce","1½ tbsp Chinese rice wine vinegar","240ml shaoxing wine","Few pinches caster sugar (to taste)","1 small daikon, peeled","2 medium carrots, peeled","100ml Chinese rice wine vinegar","50g caster sugar","1 tsp salt","Mayo and chopped coriander leaves","Bamboo or metal steamer"],"method":[{"Step 1":"To make the old dough, combine the dry ingredients in a bowl with a tiny pinch of salt, make a well in the centre and mix in the milk/water. Put on a lightly floured work surface and knead for 3-4 minutes until soft. Return to the cleaned bowl, cover with a clean tea towel or cling film and leave to rise in a warm place for at least 3 hours."},{"Step 2":"When the old dough has risen, make the new dough in the same way, adding the oil and milk/water to the dry ingredients. As the dough comes together it will look much drier than the old dough, but keep pushing it around the bowl to pick up any loose flour. Tip out onto a lightly floured surface and knead until fairly smooth. Tip the old dough on top of the new one and knead together for 3-4 minutes until combined and soft. Put the dough in a large oiled mixing bowl. Lightly grease a piece of cling film and cover the bowl. Leave in a warm place to rise while you make the filling and quick- pickled veg (see tips)."},{"Step 3":"Meanwhile, put a large frying pan over a high heat. When hot, add a good glug of sunflower oil. Fry the shortribs for 1-2 minutes, turning, until browned. Put in a deep roasting tin that fits the ribs snugly. Quickly brown the garlic and onion for 2-3 minutes in the frying pan, tossing regularly, then tip over the ribs."},{"Step 4":"Heat the oven to 170°C/150°C fan/gas 3½. Mix the soy sauce, vinegar and shaoxing, then pour into the roasting tin. Add enough water to come a quarter of the way up the ribs. Cover the tin tightly with foil, then roast for 3-3½ hours until tender."},{"Step 5":"While the beef is cooking, grate/shred the daikon and carrots using a food processor or box grater. Combine the vinegar, sugar, salt and 50ml cold water in a bowl. Mix the daikon and carrot with the pickling juice, then cover and leave for at least an hour at room temperature. Drain off the liquid, squeeze out any excess, then return to the bowl and chill until needed."},{"Step 6":"Once the ribs are cooked, remove the foil and set the ribs aside. Pour the liquid into a pan and reduce over a high heat for 10 minutes until syrupy and strongly flavoured (add a couple of pinches of sugar if you think it needs it). Carve the meat from the ribs (discard the bones), then toss with some sauce and keep covered with foil somewhere warm."},{"Step 7":"Roll the dough into a sausage shape on a lightly floured work surface. Cut into lengths and shape into 32 balls, roughly the size of golf balls. Flatten into ovals with a rolling pin, brush with oil, then fold in half over the thick end of a chopstick to give a small gap. Remove the chopstick, twirling it round as you go to increase the size of the hole a little, then leave to prove in a warm place, loosely covered with a tea towel, for 15 minutes or so. The buns will swell."},{"Step 8":"Put a steamer over a large pan containing 5cm water (make sure the water doesn’t touch the steamer). Put over a medium heat and bring to the boil. Put in a batch of buns, put the lid on and steam for 15 minutes. Keep the cooked ones warm under foil while you steam the others."},{"Step 9":"To assemble, open each bun and spread mayo on the bottom half. Put some meat on top, then spoon over more sauce. Top with the pickle and a sprinkle of chopped coriander leaves, then eat immediately."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/68.jpg"}