{"id":"50","title":"Barbecued Asian lamb","difficulty":"Easy","portion":"Serves 6","time":"Takes 20 mins to make, 35 mins to cook, plus marinating and resting","description":"Lamb works particularly well with the smokiness created by the barbecue coals and, in this recipe from Donal Skehan, the addition of a marinade full of wonderful Asian ingredients heightens those flavours. This barbecued lamb recipe is the taste of summer.","ingredients":["6 garlic cloves, crushed","1 thumb-size piece of fresh ginger, finely grated","1 red chilli, finely chopped","3 tbsp honey","2 tbsp sunflower oil","3 tbsp rice wine vinegar","4 tbsp dark soy sauce","1 tbsp toasted sesame oil","2kg leg of lamb, butterflied","1 tsp toasted sesame oil","1 tbsp soy sauce","1 tbsp fish sauce","1 tbsp rice wine vinegar","1 tbsp honey","3 tbsp sesame seeds, toasted","1 chinese cabbage, halved and finely shredded","4 carrots, grated or julienned","1 cucumber, sliced into long ribbons using a mandoline or peeler","3 spring onions, finely sliced"],"method":[{"Step 1":"Mix all the ingredients for the lamb (except the lamb itself) in a large baking dish or large resealable plastic bag. Mix or shake well so everything is combined, then add the lamb and rub well to cover in the marinade. Transfer to the fridge to marinate for at least 2 hours or overnight."},{"Step 2":"Make the slaw dressing: in a bowl, whisk the oil, soy sauce, fish sauce, vinegar, honey and most of the sesame seeds. When ready to serve, put the cabbage, carrots, cucumber and spring onions in a serving bowl and toss with the dressing."},{"Step 3":"Remove the lamb from the fridge about 40 minutes before you’re ready to cook it. Thread 2 large metal skewers crossways through the lamb so it’s easy to transfer to the barbecue and turn during cooking."},{"Step 4":"To cook the lamb on a gas barbecue, bring the barbecue to a high heat, then sear the lamb on each side for 3-4 minutes. Turn the heat down low, then cover with the lid or foil. Cook for about 30 minutes until a meat thermometer registers 53°C (for medium rare), turning the meat every 10 minutes. If the lamb blackens too much, place it on a sheet of aluminium foil to prevent it blackening further."},{"Step 5":"To cook on a charcoal barbecue, start with the lamb on the hotter part of the barbecue (the one with the double layer of coals  and sear for 3-4 minutes, then move it to the cooler part of the barbecue (with a single layer of coals), following the same cooking times and technique, and cooking it to the same temperature as in step 4."},{"Step 6":"When the lamb is cooked, transfer to a grooved chopping board (to catch the juices), cover with foil and rest for 10 minutes. Slice thinly and serve with the slaw and a sprinkle of the remaining sesame seeds."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/50.jpg"}