{"id":"47","title":"Spicy chicken chow mein noodles","difficulty":"Medium","portion":"Serves 4-6","time":"Hands-on time 40 min","description":"On a hot day in Beijing, Ning Ma would eat these spicy chicken noodles cold. Now served in her restaurants Mama Lan, this traditional recipe is a favourite during summer.","ingredients":["1 spring onion, halved","Small thumb-size piece fresh ginger, cut in half and bashed","1 tsp salt","1 tbsp shaoxing wine (from the world food section of large supermarkets or from Asian grocers)","6 British free-range bone-in chicken thighs, skin removed","2 tbsp red vinegar (from Asian grocers) or red wine vinegar","1 tsp salt","1 tsp caster sugar","3 tbsp chilli oil (we used Cooks & Co Olive Oil with Chillies, from Ocado)","120g tahini","½ tsp salt","½ tbsp caster sugar","½ tbsp rice wine vinegar","100ml boiling water","½ tbsp light soy sauce","225g dried vermicelli rice noodles","300g beansprouts, blanched in boiling water for 2 seconds","1 cucumber, deseeded and cut into thin 6cm-long strips","4 tbsp salted dry roasted peanuts, roughly chopped","Chilli oil to taste","Handful fresh coriander leaves","1 red chilli, thinly sliced diagonally","½ tbsp sesame seeds, lightly toasted in a dry pan"],"method":[{"Step 1":"Put all the chicken ingredients, apart from the chicken, in a large pan with 1 litre water. Bring to the boil, add the chicken, then simmer for 20-25 minutes or until the chicken is cooked. The meat should come off the bone with little effort. Lift the chicken onto a plate and leave to cool, then shred into strips. Discard the skin, bones and cooking liquid."},{"Step 2":"Mix the marinade ingredients in a medium mixing bowl, add the shredded chicken and marinate for 1 hour or longer."},{"Step 3":"Mix the sesame paste ingredients in a small mixing bowl and set aside."},{"Step 4":"Soak and cook the noodles according to the packet instructions, run under cold water for 2-3 minutes to remove the starch, then keep chilled until ready to serve. To assemble the ban mein, put the cold noodles in a bowl or on a platter and arrange the marinated chicken on top. Spoon over some of the sesame paste followed by the beansprouts and cucumber in a mound in the middle of the bowl. Sprinkle the peanuts around the outside, spoon over as much of the chilli oil as you want, then decorate with the coriander leaves, sliced chilli and sesame seeds. Serve cold."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/47.jpg"}