{"id":"7","title":"Wun’s kung pao chicken","difficulty":"Easy","portion":"Serves 3-4 as part of a meal","time":"Hands-on time 45 min, plus marinating","description":"Discover how to make the perfect kung pao chicken with this step-by-step recipe from chef Arty Florea of Wun’s Tea Room in London.","ingredients":["500g skin-on free-range chicken thighs, boned","5 tbsp cornflour","5 tbsp tapioca flour (see Know How)","1 litre vegetable oil for frying","Toasted sesame seeds to serve","1 tsp chilli flakes","Grated zest and juice 1 orange","40ml soy sauce","2cm fresh ginger, chopped","¾ tsp chinese five-spice powder","½ tsp 13-spice mix (see Easy Swaps)","1 tsp salt","150ml sunflower oil","250ml buttermilk (see Easy Swaps)","1 tbsp shaoxing rice wine","2½ tsp sichuan peppercorns","110g doubanjiang (see Know How)","65ml black rice vinegar (or use regular rice wine vinegar)","1 tbsp light soy sauce","140g honey","175g salted butter","160g natural yogurt","Food processor","Blender or large pestle and mortar","Tongs","Probe thermometer"],"method":[{"Step 1":"Put the marinade ingredients and 75ml water in a food processor or spice grinder and whizz until smooth (or pound together in a pestle and mortar)."},{"Step 2":"Cut each chicken thigh into 4-6 pieces and put in a bowl. Add the marinade, toss to coat, then set aside for at least 20 minutes (see Make Ahead)."},{"Step 3":"For the kung pao sauce, whizz the sichuan peppercorns in a spice grinder (or pound in a pestle and mortar), then tip into a pan with the doubanjiang, black rice vinegar, soy sauce, honey and 100ml water. Add the butter, then put the pan over a medium heat to warm through and melt the butter – you don’t want it to boil. Mix in the yogurt, then keep warm until ready to serve."},{"Step 4":"Heat a large deep pan with the vegetable oil (no more than two-thirds full) until it reads 180°C on a probe thermometer (or a cube of bread turns brown in 15 20 seconds)."},{"Step 5":"Meanwhile, mix the cornflour and tapioca flour in a large bowl. Add the marinated chicken and use your hands to make sure each piece is well coated. The coating may look uneven, but this will create delicious crispy bits. Working in batches, use tongs to lower the chicken into the hot oil and fry until the pieces are crisp, lightly golden and cooked all the way through (about 3-4 minutes)."},{"Step 6":"Drain the fried chicken, then add to a bowl, toss with a few spoonfuls of the kung pao sauce and sprinkle with sesame seeds – enjoy!"}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/7.jpg"}