{"id":"188","title":"Roast duck with star anise and orange sauce","difficulty":"Easy","portion":"Serves 4","time":"Hands on time 25 mins, 1 hour roasting time, plus overnight drying and resting","description":"For east-west fusion flavours, try this whole roast duck recipe with a fruity, spicy, Chinese-style sauce for your next Sunday roast.","ingredients":["2kg oven-ready duck","3 oranges","25g Billington’s Golden Granulated Sugar","4 tbsp red wine vinegar","450ml good-quality chicken stock","2 tsp redcurrant jelly","2 star anise, broken into separate ‘petals’","3 tbsp lemon juice","1 tbsp orange liqueur, such as Cointreau","1 tsp arrowroot","Bunch of watercress, to garnish"],"method":[{"Step 1":"Unwrap the duck and dry it well with kitchen paper. Put it on a rack over a roasting tin and leave it somewhere cool overnight. This will dry the skin of the duck and help to make it even crispier."},{"Step 2":"The next day, preheat the oven to 230°C/fan210°C/gas 8. Sprinkle some salt and pepper inside the cavity of the duck and then plenty of salt over the skin and return it to the rack. Roast for 20 minutes, then lower the oven temperature to 180°C/fan160°C/gas 4 and continue to roast for 40 minutes."},{"Step 3":"Meanwhile, make the sauce. Pare the zest from 1 of the oranges with a vegetable peeler and cut it into long, very thin strands. Drop into a pan of boiling water, leave for 5 seconds, then drain and refresh under cold water. Leave to drain on kitchen paper. Squeeze all the oranges and measure out 150ml of juice."},{"Step 4":"Put the sugar and vinegar in a small pan and place over a low heat, stirring once or twice until the sugar has completely dissolved. Bring to the boil and cook until it has turned into an amber-coloured caramel. Carefully add the chicken stock (it might splutter a bit), the redcurrant jelly, orange juice and star anise. Bring to the boil and boil rapidly until it has reduced by three-quarters to about 150ml. Stir in the lemon juice and orange liqueur and season to taste with a little salt and pepper."},{"Step 5":"Mix the arrowroot with 1 tablespoon of cold water, stir into the sauce and simmer for 1 minute, until thickened and clear. Stir in the orange zest and keep warm."},{"Step 6":"Take the duck out of the oven, lift it onto a board and cover it loosely with foil. Rest for 10 minutes. To carve, cut off the legs and cut each one in half at the joint. Cut each of the breasts away from the carcass in one piece and cut each one into long thin slices. Divide the meat between warmed plates and spoon a little of the sauce over each piece of duck leg and the slices of breast meat. Garnish with watercress and serve with creamy mashed potatoes and peas."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/188.jpg"}