{"id":"53","title":"Battered prawns with spiced herb relish","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 40 min","description":"Serve this crispy prawn recipe with fresh herb relish at your next dinner party as an everyone-dig-in starter. It’s sure to leave your guests wanting more.","ingredients":["1 litre sunflower oil for frying","24 sustainable king prawns, heads removed, peeled and deveined, tails left on","1 large free-range egg","200ml coconut milk","100g plain flour","25g cornflour","½ tsp salt","Juice 1 lime, plus wedges to serve","1 tbsp cumin seeds","1 tbsp coriander seeds","120ml olive oil","Large bunch fresh coriander","Large bunch fresh mint","Large bunch fresh Thai basil (or regular basil)","1 garlic clove","Juice 2 limes","3-4cm piece fresh ginger, grated","2 bird’s eye chillies, or 1 deseeded if you prefer less heat","½ tsp salt","Digital probe thermometer"],"method":[{"Step 1":"To make the batter, mix together the egg and coconut milk in a large mixing bowl using a balloon whisk. Gradually whisk in the flour, cornflour, salt and lime juice. Set aside while you prepare the relish. "},{"Step 2":"Heat a small frying pan over a low-medium heat. Toast the cumin and coriander seeds for 2 minutes or until fragrant. Tip into a food processor and allow to cool. "},{"Step 3":"Add the remaining relish ingredients to the food processor, reserving a few coriander leaves, then whizz to a paste (or pound in a mortar and pestle). Taste and season. "},{"Step 4":"Heat the sunflower oil in a medium heavy-based, deep frying pan to 190°C when tested with a digital probe thermometer. Lay kitchen paper in a roasting tray. Add the prawns to the batter and coat well. Carefully lower 4 prawns at a time into the hot oil using a slotted spoon and fry for 3-4 minutes until the batter is golden and crisp and the prawns are cooked. Remove and drain on the kitchen paper (keep warm) while you cook the next batch of 4. Check occasionally that the oil is hot enough, using the thermometer. "},{"Step 5":"Once all the prawns are ready, transfer them to a serving plate, then sprinkle with salt and the reserved coriander leaves. Serve with the relish and lime wedges to squeeze over."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/53.jpg"}