{"id":"69","title":"Hainanese chicken rice","difficulty":"Medium","portion":"Serves 4-6","time":"hands-on time 45 min, simmering time 1 hour 45 min, plus cooling","description":"Goz Lee shares his Grandma’s recipe of this Hainan and Singapore-inspired chicken rice – it’s full of flavour with chillies, ginger and garlic.","ingredients":["1 free-range chicken, around 1.5kg"," 2 tbsp toasted sesame oil, plus extra to drizzle","10cm fresh ginger, thinly sliced","1 garlic bulb, bashed to separate","4 spring onions","Sliced cherry tomatoes, cucumber and fresh coriander to garnish","2 tbsp vegetable oil","1 tsp toasted sesame oil","5cm fresh ginger, finely chopped","½ garlic bulb, cloves finely chopped","300g jasmine rice","8 red chillies, stems removed","2 bird’s eye chillies, stems removed","1⁄2 garlic bulb, cloves halved","5cm fresh ginger","Juice 1 lime, plus extra to taste","1 tbsp vegetable oil","Soy sauce and sugar to taste"],"method":[{"Step 1":"Rub salt into the chicken skin and cavity. Drizzle 1 tbsp sesame oil into the cavity and rub 1 tbsp on the skin. Put the ginger, garlic and spring onions in the cavity of the chicken."},{"Step 2":"Put the chicken in a large pot and cover with cold water. Bring to the boil, then simmer for 15 minutes. Turn off the heat, cover the pot and let the chicken poach for 35-40 minutes."},{"Step 3":"Remove the chicken and pierce with a sharp knife in the thigh – the fibres should be set and visible, not gelatinous. If they’re not, poach for 10-15 minutes more. Remove (reserve the poaching liquid), take the solids out of the cavity and put them in the poaching liquid. Set the chicken on a plate to cool slightly. Discard the skin and remove the meat (set aside), then put the bones into the poaching liquid and simmer until reduced by half to a stock. Taste, season, strain, then return to the pan and keep warm."},{"Step 4":"For the rice, heat the oils in a wok or large pan, then fry the ginger and garlic for 3 minutes. Add the rice and stir-fry for 5-7 minutes to coat."},{"Step 5":"Put the rice in a pan and cover with 600ml of the stock (keep the rest hot). Bring to the boil, then cover and cook gently for 15 minutes until the rice is tender and the liquid is absorbed."},{"Step 6":"For the chilli sauce, pound the chillies, garlic, ginger, lime juice and oil in a pestle and mortar or whizz in a mini food processor to a paste. Add 175ml hot chicken stock, a dash of soy sauce and 1 tsp sugar, then taste. Add more soy, sugar or lime juice if needed."},{"Step 7":"To serve, chop the reserved chicken meat and arrange on a plate with the rice and salad garnish. Drizzle soy sauce and sesame oil over the chicken. Serve with the chilli sauce and remaining stock (in bowls as a chicken broth)."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/69.jpg"}