{"id":"145","title":"Chinese duck noodle broth","difficulty":"Easy","portion":"Serves 8","time":"Takes 20 minutes to make and about 3½ hours on the hob","description":"A whole duck is used to make this fragrant, comforting duck and noodle broth, giving the stock incredible richness and flavour. Freeze in batches for when you need a nourishing pick-me-up.","ingredients":["About 1.8kg whole duck, cut into 4 (ask your butcher to do this for you)","1½-2 litres home-made or good-quality fresh chicken stock, hot","100ml light soy sauce","75ml Chinese cooking wine","2 tbsp dark soft brown sugar","6 garlic cloves, sliced","1 red chilli, split in half lengthways","5cm piece fresh ginger, sliced","5 star anise","1 cinnamon stick, broken in half","Grated zest of 1 orange","400g-500g dried medium egg noodles","4 pak choi, trimmed and roughly torn","Finely sliced spring onion, fresh coriander and lime wedges, to serve"],"method":[{"Step 1":"Place the duck into a large saucepan with enough boiling water to cover. Bring to the boil, then simmer for 5 minutes, spooning off any scum from the surface. Strain through a colander into a bowl."},{"Step 2":"Rinse the pan, return it to the heat with the duck and enough stock to cover. Add the soy sauce, wine, sugar, garlic, chilli, ginger, spices and zest. Cover, bring to the boil, then simmer, covered, for 3 hours, skimming off the fat often, until the meat is tender."},{"Step 3":"Lift out the duck with a large slotted spoon and set aside to cool slightly. Bring the broth to the boil, then simmer for 30 minutes, until reduced by a third, skimming off any fat from the surface."},{"Step 4":"When the duck is cool enough to handle, strip the duck from the bones (discard the bones) and chop the meat into chunky pieces. Set aside."},{"Step 5":"When the broth is reduced, strain through a fine sieve, return to the pan and check the seasoning. Add the noodles, stir and cook for about 3 minutes or until just tender."},{"Step 6":"Lift the noodles into warm bowls. Add the pak choi and duck pieces and ladle over the broth. Garnish with the spring onions, coriander and serve with lime wedges to squeeze over."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/145.jpg"}