{"id":"38","title":"Bao buns with orange and pomegranate glazed lamb","difficulty":"Medium","portion":"Makes 8 buns","time":"Hands-on time 1 hour 40 min, oven time 3 hours 20 min, plus pickling","description":"These buns are sticky, meaty and moreish; another great recipe by Dan Doherty.","ingredients":["200g white wine vinegar","80g caster sugar","10g salt","1 red onion, finely sliced","1.2kg lamb shanks","Olive oil for frying","1 onion, chopped into 2cm pieces","1 carrot, chopped into 2cm pieces","1 celery stick, chopped into 2cm pieces","2 garlic cloves, crushed","1 bay leaf","175ml red wine","500ml fresh chicken stock","1 fresh rosemary sprig","1 fresh thyme sprig","50g brown sugar","Zest and juice 2 oranges","100ml pomegranate molasses","100g shelled pistachios","8 Asian steamed buns","1 cucumber, finely sliced","Fresh coriander sprigs and mint leaves"],"method":[{"Step 1":"The day before you want to serve the bao buns, make the quick-pickled onion. Put the vinegar, sugar and salt in a small saucepan with 100ml water and bring to the boil. Turn off the heat and allow to cool. Put the sliced onion in a bowl, then pour over the pickling liquid. Cover and chill in the fridge overnight."},{"Step 2":"Heat the oven to 150째C/130째C fan/gas 2. Lightly rub the lamb shanks with oil and heat a drizzle more oil in a large frying pan. Fry the shanks for around 15 minutes or until browned all over. Transfer to a casserole that has a lid."},{"Step 3":"In the same frying pan over a medium heat, cook the chopped onion, carrot, celery, garlic and bay leaf for about 20 minutes or until tender with a little colour. Add the wine and reduce the mixture by three quarters, then pour it all over the shanks. Cover with the chicken stock, then add the rosemary and thyme. Put the lid on the casserole and cook in the oven for about 3 hours or until the shanks give way when pressed with a spoon and the meat comes off the bone easily. Remove the casserole from the oven, then turn up the temperature to 180째C/160째C fan/gas 4."},{"Step 4":"Allow the shanks to cool in the stock. When cool enough to handle, transfer to a baking tray. Gently pull the meat from the bones (discard the bones) and leave the meat in the tray."},{"Step 5":"Strain the stock into a heavy-based pan and add the glaze ingredients. Reduce it over a medium heat to form a glaze with a runny honey-like consistency, taking care not to let it burn (around 10 minutes)."},{"Step 6":"Put the tray of lamb onto the middle rack of the oven, then cook for 10 minutes. Meanwhile, spread the pistachios over the base of a large oven tray. Remove the lamb from the oven and pour over half the glaze, then return to the oven for a further 10 minutes. Position the oven tray with the pistachios just beneath the lamb."},{"Step 7":"Remove the lamb and nuts from the oven. Let the nuts cool, then lightly crush in a pestle and mortar. Pour the remaining glaze over the lamb, then sprinkle with the nuts."},{"Step 8":"Steam the buns according to the pack instructions. To serve, further shred the lamb with forks and pile into the buns. Top with sliced cucumber, pickled red onion and fresh coriander and mint."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/38.jpg"}