{"id":"82","title":"Sticky ginger beef and sprouting broccoli stir-fry","difficulty":"Easy","portion":"Serves 4","time":"Takes 25 minutes to make. 5 minutes to cook","description":"The classic Asian flavours in this lip-smacking beef stir-fry work well as a takeaway-style dish or as part of a Chinese New Year spread.","ingredients":["500g purple sprouting broccoli (prepared weight)","2 x 250g sirloin steaks, each about 2.5cm thick","2 tsp soy sauce","2 pieces stem ginger in syrup, cut into fine shreds, plus 2 tsp stem ginger syrup","¾ tsp Chinese five-spice powder","2 tsp cornflour","½ tsp each salt and freshly ground black pepper","4 tbsp hoisin sauce","1 tsp sambal oelek (Indonesian chilli paste) or minced red chilli from a jar","4 tsp Chinese rice wine vinegar or white wine vinegar","1 large bunch of spring onions","2 tbsp sunflower oil","1 medium-hot, long red chilli, deseeded and thinly sliced","4 large garlic cloves, thinly sliced","75g fresh ginger, finely shredded","2 tbsp shaoxing or Chinese rice wine (see Know-how)","1 tbsp toasted sesame oil"],"method":[{"Step 1":"Steam the sprouting broccoli spears for 3-6 minutes or until just tender, then remove and set aside."},{"Step 2":"Trim away the fat from the sirloin steaks and cut the meat across the grain into long, very thin strips. Mix the soy sauce, stem ginger syrup, five-spice powder, cornflour, salt and black pepper in a medium-size bowl. Stir in the beef and set aside."},{"Step 3":"Mix the hoisin sauce, sambal oelek, wine vinegar and shredded stem ginger in a small bowl. Set aside. Trim the spring onions, then separate the green part from the white. Cut the white part lengthways in half, then across into two. Shred the green parts lengthways, then set them aside in a bowl of cold water to make them curl."},{"Step 4":"Heat a wok or large deep frying pan until hot, then add the sunflower oil and swirl it around to coat the sides. Add the chilli, garlic and shredded fresh ginger and stir-fry for 15 seconds. Add the beef and stir-fry over as high a heat as you can for 1-2 minutes until it is only just cooked and no longer pink. Add the shaoxing wine and stir-fry for 15 seconds more, then add the hoisin sauce mixture and toss together well. Add the sprouting broccoli and the white part of the spring onions and stir-fry for a minute until heated through. Sprinkle over the sesame oil and spoon onto a warmed serving plate. Lift the curled spring onions out of the water, dry briefly on kitchen paper and sprinkle over the top. Serve with steamed rice."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/82.jpg"}