{"id":"9","title":"Hunan-style crispy mushroom noodle salad","difficulty":"Easy","portion":"Serves 2-4 as part of a meal","time":"Hands-on time 30 min, oven time 15 min","description":"Ching-He Huang’s vegan Chinese mushroom noodle salad combines panko-fried shimeji mushrooms, rice noodles and loads of veg for a tasty, healthy meal.","ingredients":["500g shimeji mushrooms, separated (see Know-how)","Pinch ground white pepper","Pinch Chinese five-spice powder","4 tbsp potato flour or cornflour","6 tbsp aquafaba (see tip)","100g panko breadcrumbs (vegan if need be)","6 sprays light olive oil spray","1 tsp rapeseed oil","2.5cm piece fresh ginger, finely grated","4 long dried chillies","1 tbsp tamari or reduced-salt light soy sauce","2 tbsp sweet chilli sauce","Juice and zest 1 large orange","1 romaine/cos lettuce, shredded","½ cucumber, cut into half-moons","1 large carrot, cut into fine matchsticks","200g ready-to-eat vermicelli rice noodles","1 tbsp sesame seeds, toasted","Spring onion curls to serve (see tip)"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. Lay the mushrooms on a roasting tray and season with a pinch each of salt, white pepper and Chinese five-spice. Put the flour, aquafaba and breadcrumbs in three separate dishes. One at a time, dip each mushroom in the flour, coating well, then in the aquafaba. Finally dip quickly in the breadcrumbs and return to the roasting tray. Spray the mushrooms with olive oil, then roast for 15 minutes until crisp."},{"Step 2":"Meanwhile make the sauce: heat a wok or deep frying pan over a high heat until smoking. Add the oil, then the ginger and stir-fry for a few seconds. Add the chillies, tamari or soy sauce, sweet chilli sauce and orange zest and juice. Bring to the boil and reduce until thickened."},{"Step 3":"Drizzle the sauce over the crispy mushrooms and toss to coat. Arrange the salad ingredients on plates, then add the mushrooms and drizzle over more of the sauce if you like. Sprinkle over the sesame seeds, top with spring onion curls and serve immediately."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/9.jpg"}