{"id":"67","title":"Poached wontons in chilli-garlic sauce","difficulty":"Easy","portion":"Serves 4-6 as a starter","time":"Hands-on time 1 hour 15 min","description":"Chef Bing Luo from London’s Shard shares his recipe for these winter-warming wontons in chilli-garlic sauce.","ingredients":["250g plain flour, plus extra to dust","1 medium free-range egg, beaten","75ml cold water","½ tsp fine sea salt","100g free-range pork mince (see Chef’s Tips For Success)","3g fine sea salt","Pinch ground white pepper","10g grated fresh ginger","1 tsp light soy sauce","1 tsp toasted sesame oil","2 medium free-range eggs","2 tbsp light soy sauce","1 tbsp toasted sesame oil","1 garlic clove, finely chopped","1 tbsp chilli oil","1½ tsp chinkiang vinegar (see Know-how)","2 tbsp fresh chicken stock or water","Sliced red chilli and fresh coriander to serve (optional)","A pasta machine for rolling"],"method":[{"Step 1":"For the wonton dough, sift the flour into a large mixing bowl. Add the egg and cold water and bring it together with your hands. It will take a while as there isn’t much water in the recipe – the drier the dough, the better (see Chef’s Tips for Success). If the dough really won’t come together, add 1 tbsp water – it should be quite dry and ragged."},{"Step 2":"Knead the dough for 5-10 minutes until smooth. Using a rolling pin, roll out the dough into a rough rectangle, then fold it up several times and roll into a rectangle again. Do this 4 times to give a smooth dough, then roll it thin enough to go through a pasta machine – about 5mm thick."},{"Step 3":"Cut the dough into 3 equal pieces to fit through the pasta machine. Roll the dough through the machine several times. Run twice through on the widest setting, then twice through on the next setting down and so on, to the second thinnest setting (1-2mm). Cut the dough in half if it gets too long and unmanageable."},{"Step 4":"Dust the work surface with flour, then use a palette knife or ruler as a guide (Bing uses a thin rolling pin here) and cut the dough into 10cm squares using a sharp knife. Discard any leftover pastry. Cover the squares in cling film."},{"Step 5":"Put all the filling ingredients into a medium bowl and whizz to a thick pulp using a stick blender. To make the sauce, combine all the ingredients in a bowl and mix well."},{"Step 6":"Hold a wonton with a corner pointing at your body. Use a teaspoon (Bing uses a Chinese spatula here) to put a marble-size dollop of filling onto the centre of the wonton. Fold roughly in half towards you to make a triangle – don’t line the edges up perfectly. Wet the top of one of the narrow corners. In one move, use your finger to gently push in the centre of the filling [J] as you bring the narrow corners together, making sure the wide corner pointing at you flips up. Press the dry narrow corner onto the wet narrow corner to form a dumpling. Set aside while you make the rest (see tips)."},{"Step 7":"Cook the dumplings in batches= in a pan of boiling water for 6 minutes (see Tips for Success), then carefully remove with a slotted spoon."},{"Step 8":"Put 4-5 dumplings in each bowl, splash with a little of the dressing and top with sliced red chilli and fresh coriander, if you like."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/67.jpg"}