{"id":"60","title":"Chinese-style sticky pork ribs","difficulty":"Medium","portion":"Serves 6-8","time":"Hands-on time 20 min, oven time 2½-3 hours, barbecuing/grilling time 15 min","description":"Coated in a glaze – made from Chinese five-spice, honey and soy – then charred on the barbecue or grill, serve these stickiest-ever pork ribs for an eat-with-your-hands kind of dinner party.","ingredients":["2 x 8-rib racks British free-range pork belly ribs (sometimes known as baby back ribs)","Glug sunflower oil","1 onion, finely sliced","1 tsp Chinese five-spice","1 large thumb-size piece fresh ginger, grated","3 garlic cloves, crushed","2 tbsp hoisin sauce","1½ tbsp rice vinegar","1½ tbsp soy sauce","1 tbsp clear honey","1 tbsp tomato ketchup","Toasted sesame oil, sesame seeds and thinly sliced red chilli and spring onion to serve"],"method":[{"Step 1":"Heat the oven to 160°C/140°C fan/gas 3. Put the racks in a large roasting tin, bone-side up, then cover with just-boiled water from the kettle and season well with salt. Place a sheet of baking paper on top of the ribs to keep the meat submerged in the liquid, then cover the tin tightly with foil. Put in the oven and cook for 2½-3 hours until the meat is very tender when pressed with a spoon. Lift the racks out of the water, pat dry with kitchen paper, then put on a board to cool a little."},{"Step 2":"Meanwhile, to make the glaze, heat the sunflower oil in a large frying pan. Add the onion and cook over a medium-high heat for 10 minutes, stirring often, until very soft and slightly caramelised. Add the five-spice, ginger and garlic, then cook for 3-4 minutes more until fragrant. Stir in the hoisin sauce, rice vinegar, soy, honey and ketchup, then transfer to a blender (or tip into a bowl and use a stick blender) and whizz until you have a smooth glaze. Reserve a ladleful for dipping."},{"Step 3":"Light a barbecue or heat a grill to high. Thickly brush the glaze all over the ribs, then cook for 15 minutes, turning twice and brushing on more glaze as you go, until the meat is caramelised and lightly charred. If you’re using the grill, put the ribs meat-side up in a baking tray and cook for the same amount of time without turning (brush with more glaze halfway through cooking)."},{"Step 4":"Serve the ribs drizzled with toasted sesame oil and scattered with sesame seeds, sliced chilli and spring onion, with the reserved glaze on the side for dipping."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/60.jpg"}