{"id":"180","title":"Five-spice duck and ginger noodle soup","difficulty":"Easy","portion":"Serves 4","time":"Ready in 35 minutes","description":"An authentic Chinese noodle soup recipe, packed with healthy vegetables and moreish spicy flavours.","ingredients":["Pinch of crushed dried chillies","1/4 tsp Chinese five-spice powder","1/2 tsp sugar","2 large duck breasts, skin removed","2 litres fresh chicken stock, hot","5cm piece fresh ginger, cut into thin strips","2 tsp sunflower oil","200g dried wholewheat noodles (we like Blue Dragon)","1 medium-hot red chilli, deseeded and thinly sliced","Bunch of spring onions, trimmed and thinly sliced on the diagonal","200g beansprouts","4 heads pak choi, roughly chopped","Handful fresh coriander sprigs","Dark soy sauce, to serve"],"method":[{"Step 1":"Lightly grind the crushed chillies in a pestle and mortar, then mix in a shallow dish with the five-spice powder, sugar, some sea salt and freshly ground black pepper. Put the duck breasts skinned-side down on the spices. Cover with a plate and weigh down with a few cans. Set aside for 10 minutes."},{"Step 2":"Meanwhile, bring the stock and ginger to the boil in a pan. Season with a little salt and keep hot. Bring another pan of lightly salted water to the boil ready for the noodles."},{"Step 3":"Meanwhile, heat the sunflower oil in a frying pan over a high heat. Add the duck breasts, spice-side down, lower the heat slightly and cook for 3 minutes each side for medium-rare. Set aside to rest for 5 minutes."},{"Step 4":"Meanwhile, cook the noodles in the boiling water according to the packet instructions. Drain and divide between 4 warm bowls. Sprinkle with the chilli and half the spring onions. Add the beansprouts and pak choi to the chicken stock and cook for 1 minute. Ladle over the noodles."},{"Step 5":"Thinly slice the duck on the diagonal and place on top of the noodle soup. Scatter with the remaining spring onions and coriander sprigs and serve with the dark soy sauce on the side."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/180.jpg"}