{"id":"35","title":"Prawn toast scotch eggs","difficulty":"Medium","portion":"Makes 12","time":"Hands-on time 45 min, cooking time 15 min","description":"Two of your favourite nibbles are combined in one crunchy, crispy, gooey-in-the-middle snack with Ravinder Bhogal’s prawn toast scotch eggs.","ingredients":["3 tbsp white wine vinegar","12 quail eggs","400g raw sustainably sourced king prawns, peeled","3 fat garlic cloves, finely chopped","1 tbsp grated fresh ginger","1 tsp caster sugar","1 tsp toasted sesame oil","1 tsp chilli flakes, toasted for a few minutes in a dry pan","1 tsp light soy sauce","5 spring onions, finely chopped","125g uncooked Thai or Chinese prawn crackers","100g panko breadcrumbs","150g plain flour for coating","3 medium free-range eggs, beaten","Groundnut or vegetable oil for deep frying","Bowl of iced water; food processor; a digital probe thermometer would be useful, too"],"method":[{"Step 1":"Bring a small pan of water to the boil. Meanwhile mix the vinegar into the bowl of iced water and have it on standby. Lower the quail eggs into the boiling water and simmer for 2 minutes. Using a slotted spoon, scoop out the eggs and put them in the iced vinegar water. Leave to cool for 5 minutes, then peel the eggs and set aside."},{"Step 2":"Put the prawns, garlic, ginger, sugar, sesame oil, toasted chilli flakes and soy sauce in a food processor and whizz until you have a coarse, sticky paste. Mix in the spring onions, then divide the prawn mixture into 12 equal portions."},{"Step 3":"Put the prawn crackers in a clean food processor bowl and whizz to a breadcrumb consistency. Mix with the panko breadcrumbs and put in a shallow bowl or tray. Put the plain flour and beaten eggs into 2 more separate shallow bowls."},{"Step 4":"Wrap each quail egg in a portion of the prawn mixture. The easiest way to do this is by rolling it into a ball, then flattening it into a disc large enough to wrap around the egg. Gently press the edges together over the top of each egg to seal, being careful not to squash the delicate egg inside."},{"Step 5":"Once all the eggs have been wrapped in the prawn mixture, roll them first in flour, then coat in the beaten egg, then roll in the cracker/breadcrumb mix. For extra crunch, roll in egg and breadcrumbs again."},{"Step 6":"Heat the oil a deep, heavy-based saucepan (no more than half-full) to 180°C. (If you don’t have a digital probe thermometer a cube of bread added to the pan will turn golden in 30-40 seconds at this temperature.) Line a baking tray with kitchen paper. Use a slotted spoon or frying basket to lower the scotch eggs into the hot oil, then fry, in batches, for 3 minutes. Lift out carefully using the slotted spoon/frying basket and set on the lined tray to drain. Serve warm as a nibble."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/35.jpg"}