{"id":"8","title":"Crispy pork potsticker dumplings","difficulty":"Easy","portion":"Makes 20 dumplings (serves 2 as a meal or 3-4 as a snack)","time":"Hands-on time 40 minutes","description":"Some say potstickers, which originated in China and have become a worldwide favourite, came about when a chef let his dumplings boil dry, stick to the pan and crisp up. Make these beauties and they won’t stick around for long.","ingredients":["150g plain flour","100ml boiling waterFor the filling ","150g higher welfare lean pork mince","60g chinese leaf /napa cabbage, shredded and chopped","2 spring onions, finely sliced, plus extra to serve","3 garlic cloves, finely chopped or grated","2 tsp ginger, finely chopped or grated","3 tbsp dark soy sauce","1 tbsp sesame oil","1 tbsp shaoxing rice wine vinegar (or good quality dry sherry)","Toasted sesame seeds to serve (optional)","3 tbsp veg oil for frying","4 tsp cornflour","1 tbsp plain flour","150ml water","2 tbsp rice wine vinegar","½ tsp salt","3 tbsp dark soy sauce","2 tbsp rice wine vinegar or Chinese black rice vinegar","1 tbsp sesame oil","1 tsp brown sugar (optional)","½ tsp sesame seeds"],"method":[{"Step 1":"To make the dumpling dough, put the flour in a large mixing bowl and slowly pour in the boiling water. Use a fork or spatula to mix until dough comes together in clumps, adding more flour or water as needed."},{"Step 2":"Tip the dough out onto a lightly floured surface and knead briefly for about a minute (it will be quite shaggy at this point). Put the dough back into the bowl, cover and leave to rest for 10 minutes. Take the dough back out and knead again until very smooth, about 4-5 minutes. Cover and rest for a further 30 minutes."},{"Step 3":"Roll the rested dough into a sausage about 40cm long. With a very sharp knife, slice the dough sausage into approx 2cm long slices, you should get about 20. Roll each piece into a ball, then roll out to 8-10cm diameter discs. Pop onto a lightly floured baking tray, cover with a clean damp tea towel and set aside while you prepare the filling."},{"Step 4":"Put all the filling ingredients except the sesame seeds and veg oil in a large bowl, season well with salt and white pepper, then mix well to combine."},{"Step 5":"Working with one dumpling wrapper at a time (keeping the rest covered with the clean damp tea towel), lightly brush the edges of the dough with cold water. Put 1-2 tbsp of filling in the middle of the wrapper, then fold over as though to create a half moon shape, but don’t seal the edges. Working from one end, first pinch together the two edges, then make a small pleat in one of the edges and press it to the other side of the wrapper to seal. Keep making a small pleat in one side and pressing to the other to seal all the way along to the end. This will gather the filled wrapper like a pouch and give a row of pleats across the top. Alternatively, simply seal the two edges into a half moon, squeezing out any excess air, and make a few small pleats along the sealed edge. Arrange on the floured baking tray with the crimped edge sticking up (see Make Ahead)."},{"Step 6":"In a small jug, mix together the skirt ingredients, whisking until the mixture is smooth. Heat a large non-stick frying pan with a lid over medium-high heat. Add 3 tbsp vegetable oil and arrange half the dumplings in the pan spaced apart, crimped edge sticking up. Fry in the hot oil for 2-3 minutes until the bottoms are crisp and golden, then add half the skirt mixture and a splash of water. Put the lid on and simmer for 5 minutes. Making sure the dumplings and skirt are crispy and golden before removing from the heat. repeat with the remaining dumplings and skirt mixture."},{"Step 7":"While the dumplings are cooking, whisk all the sauce ingredients in a small bowl. Turn the crispy cooked dumplings out onto a serving plate. Scatter with extra spring onions and toasted sesame seeds. Serve with the dipping sauce alongside."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/8.jpg"}