{"id":"127","title":"Sweet and sour pork","difficulty":"Easy","portion":"Serves 4","time":"Hands on time 20 mins, plus 40 mins cooking time","description":"You can eat this delicious sweet and sour pork recipe with cooked noodles or rice.","ingredients":["1 onion","1 orange pepper","2 carrots","2 celery sticks","500g pork loin or chicken breast, skin removed","3 tbsp red wine vinegar","4 tbsp tomato purée","2 tbsp light soft brown sugar","½ tsp mustard powder","2 tsp soy sauce","425g can pineapple chunks in natural pineapple juice","1 tbsp vegetable oil","2 tsp cornflour","Cooked noodles and wilted greens, to serve"],"method":[{"Step 1":"Cut the onion in half. Rest the halves cut side down on a chopping board (so they won’t move about) and cut into small pieces. In the same way, cut the pepper in half, remove the seeds, then cut into thin strips. Peel the carrots, cut in half widthways, then in half lengthways. With the cut side down, slice them diagonally into thin pieces. Slice the celery into thin pieces – cut it slightly diagonally as it makes a pretty shape. Slice the meat into thin strips."},{"Step 2":"Measure the red wine vinegar, tomato purée, sugar, mustard powder and soy sauce into a large jug. Strain the juice from the can of pineapple into the jug, and set the chunks aside. Use the empty can to measure half a can of water (about 200ml) into the jug. Mix everything together."},{"Step 3":"Heat the oil in a wok or frying pan over a medium heat. Add the onion and pepper and fry gently for 10 minutes until soft. Add the carrots and celery and fry for a few more minutes. Spoon onto a plate."},{"Step 4":"Add the meat to the pan and fry for a few minutes until golden – move the meat around in the pan so that it browns all over. Put the vegetables back into the pan. Pour the pineapple juice mixture over the vegetables and meat. Leave to bubble gently for 10-15 minutes."},{"Step 5":"In a small bowl, mix together the cornflour and a little water. Add this to the pan with the pineapple chunks and stir everything together. Leave to cook for another 5 minutes. Serve with noodles and wilted greens."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/127.jpg"}