{"id":"58","title":"Singapore style stir fried noodles","difficulty":"Medium","portion":"Serves 4","time":"Hands-on time 1 hour 35 min, plus marinating","description":"Debbie Major combines roasted pork and stir fried veg with curry powder in this Singapore inspired recipe.","ingredients":["25g dried sliced Chinese mushrooms, such as shiitake","200ml hot chicken stock","200g dried rice vermicelli noodles","1 tbsp toasted sesame oil","2 tbsp sunflower oil","175g British free-range streaky bacon rashers, cut across into thin strips","1 medium onion, finely chopped","3 garlic cloves, finely chopped","5cm piece fresh ginger, finely chopped","1 medium-hot red chilli, seeded and thinly sliced","4 tsp mild curry powder","150g cooked peeled North Atlantic prawns","2 tbsp dark soy sauce","1 bunch (about 6) spring onions, thinly sliced","1cm piece fresh ginger, finely grated","1 garlic clove, crushed","1 tsp hoisin sauce","1 tsp tamari or dark soy sauce","1 tsp light soft brown sugar","½ tsp five-spice powder","1 tsp sunflower oil","Few drops red food colouring (optional)","1 tsp clear honey","1 medium-size (350g) British free-range pork fillet, trimmed "],"method":[{"Step 1":"For the red roast pork, put all the ingredients except the pork into a shallow dish large enough to hold the pork fillet and stir to combine. Add the pork fillet and turn it over several times to coat. Cover and leave to marinate for at least 1 hour, overnight in the fridge if possible. "},{"Step 2":"Heat the oven to 220°C/200°C fan/gas 7. Lift the pork onto a rack set over a small, foil-lined roasting tin. Roast for 10 minutes, then lowerthe oven to 180°C/160°C fan/gas 4 and roast for 25 minutes. "},{"Step 3":"Meanwhile, put the dried mushrooms in a heatproof bowl. Pour over the hot chicken stock and leave them to soak for 30 minutes. "},{"Step 4":"Remove the pork from the oven and, when cool enough to handle, cut in half lengthways, then across into thin slices. Cover and set aside. Drain the mushrooms, squeeze out the excess liquid and set both aside. "},{"Step 5":"Drop the noodles into a pan of boiling water, take off the heat and leave them to soak for 2 minutes. Drain well, then toss in a bowl with the toasted sesame oil. "},{"Step 6":"Heat the sunflower oil in a wok or a large, deep frying pan. Add the bacon and fry for a few minutes until crisp and golden. Remove with a slotted spoon onto a plate. Add the onion and fry for 5 minutes until golden. Add the mushrooms, garlic, ginger and chilli, then stir-fry for 2 minutes. Add the curry powder and fry for 1 minute more. Add the pork, prawns, noodles, reserved mushroom liquid and soy sauce, then toss together gently over a high heat using two forks for about 2 minutes until everything has heated through. Add the spring onions, toss again, then serve. "}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/58.jpg"}