{"id":"171","title":"Peking duck rice paper rolls recipe","difficulty":"Easy","portion":"Makes 24 rolls","time":"Takes 25 minutes to make, about 1¼ hours in the oven, plus glazing, overnight chilling and resting","description":"Ching He-Huang’s authentic Peking duck rice paper rolls are a Chinese recipe to savour.","ingredients":["2kg whole duck, giblets removed","5 tbsp runny honey","2 tbsp dark soy sauce","4 tbsp Chinese five-spice powder","2 tbsp brown sugar","24 rice paper rolls (from Chinese supermarkets) or Chinese pancakes for duck (from major supermarkets)","½ large cucumber, deseeded and cut into matchsticks","Bunch of spring onions, trimmed and shredded","1 tsp toasted sesame oil","1 tbsp sunflower oil","6 tbsp hoi sin sauce","5 tbsp caster sugar","1 tbsp dark soy sauce","1 tbsp cornflour"],"method":[{"Step 1":"Place the duck, breast-side up, on a rack over a large roasting tin and pour over 2 litres boiling water, then discard the water and pat the duck dry with kitchen paper. (This technique is often used in Chinese cookery to loosen the skin from the body, which will help it crisp up in the oven.) Line the roasting tin well with foil, replace the rack and sit the duck on top, breast-side up."},{"Step 2":"Mix the honey, soy sauce, five-spice powder and sugar to make a glaze. Set 4 tablespoons aside for later. Brush some of the remaining glaze over the duck, inside and out. Let it dry and brush with the glaze again. Repeat to use up the glaze. When the glaze is dry, chill overnight."},{"Step 3":"Preheat the oven to 200°C/fan180°C/gas 6 and bring the duck back up to room temperature. Cook for 40 minutes, then carefully turn the duck over on the rack. Brush with the reserved glaze and roast for a further 30-35 minutes, until cooked. Remove from the oven, cover with foil and set aside to rest for 20 minutes."},{"Step 4":"Meanwhile, heat a saucepan over a medium heat. Add all the sauce ingredients except the cornflour. Add 100ml water and heat until it starts to bubble. Mix the cornflour with 1 tablespoon water, add to the sauce and stir until thickened. Cool."},{"Step 5":"Carve and slice the duck, removing all the meat. Put on a warm serving plate, covered with foil."},{"Step 6":"In batches, put the rice paper rolls in a bowl of hot water for less than 1 minute, then remove and lay them on a plate to soften. (Alternatively, heat the Chinese pancakes for duck according to packet instructions.) To roll, spread a little sauce over 1 rice paper roll or pancake, add some cucumber, spring onions and duck, then roll up and eat while warm."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/171.jpg"}