{"id":"30","title":"Wok-fried fragrant scallops","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min","description":"Ching-He Huang created this dish for a traditional Chinese New Year menu. It’s an elegant starter of pan-fried scallops dressed in sesame, soy and chilli served with crisp watercress. If you like, serve the scallops in their pretty shells to add extra wow-factor.","ingredients":["1 tbsp rapeseed oil, plus extra for frying","A few sichuan peppercorns, toasted in a dry pan and ground in a pestle and mortar, to taste","1 small cayenne chilli, deseeded and finely chopped (see tip)","1 tbsp shaoxing rice wine or dry sherry","Ground white pepper","8 hand-dived king scallops","200g watercress, trimmed","Squeeze lemon juice","Drizzle olive oil","2 garlic cloves, crushed","2.5cm piece fresh ginger, finely grated","4 tbsp premium dark soy sauce","4 tbsp rice vinegar (available from supermarkets)","2 tbsp toasted sesame oil","1 spring onion, finely sliced","1 red chilli, deseeded and finely chopped","Small handful fresh coriander, finely chopped"],"method":[{"Step 1":" Mix all the dressing ingredients together in a small bowl (see Make Ahead), then taste and adjust the seasoning as needed. Set aside."},{"Step 2":"In another small bowl, mix the oil, ground sichuan pepper, cayenne and rice wine with 4 pinches each of salt and ground white pepper."},{"Step 3":"Heat a drizzle of rapeseed oil in a large frying pan over a medium-high heat, then add the scallops and cook for 2 minutes. Carefully turn them over (in the order in which you put them in the pan), then pour in the sichuan mixture and continue frying until just cooked through (about 2 more minutes, or to your liking)."},{"Step 4":"In a medium bowl, toss together the watercress, lemon juice and olive oil. Divide among 4 plates, top with the scallops and cooking juices from the pan, then drizzle with the dressing. Serve straightaway."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/30.jpg"}