{"id":"2","title":"Prawn and lemongrass hot and sour soup","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 40 min, plus cooling","description":"Georgina Hayden’s fragrant hot and sour soup is packed with prawns, noodles and zingy fresh herbs. Batch cook and freeze the broth ready for busy nights.","ingredients":["400g raw shell-on prawns","1.25 litres fish stock","2 lemongrass stalks, trimmed and roughly chopped","4cm knob fresh ginger, roughly chopped","4 lime leaves, roughly chopped","1-2 bird’s eye chillies, roughly chopped","3 garlic cloves, roughly chopped","4 tbsp fish sauce","½ tbsp caster sugar","Juice 2 limes","150g oyster and/or enoki mushrooms, roughly torn","300g cooked rice noodles to serve","4 spring onions, trimmed and finely sliced, to serve","½ bunch of coriander and/or mint, leaves picked, to serve"],"method":[{"Step 1":"Shell the prawns, then put the shells in a large saucepan with the stock (reserve the prawns in the fridge). In a pestle and mortar crush the lemongrass, ginger, lime leaves, chillies and garlic cloves just enough tobruise them, break them up and release their flavours. Add them to the stock and put the pan over a medium heat. Gently bring to the boil, then reduce to a simmer and cook for 20 minutes."},{"Step 2":"Strain the flavoured stock, discarding all the solids, then return the clear broth to the pan. Add 3 tbsp of the fish sauce, the sugar and the juice of 1½ limes. Taste and add more of everything to suit your taste: you’re looking for a punchy, tangy, salty broth. Add the prawns and mushrooms to the pan and simmer for 2 minutes until just cooked through. At this point, you can freeze the broth (see Make Ahead)."},{"Step 3":"When you’re ready to serve, defrost and gently reheat the broth (if needed). Divide the cooked noodles among 4 bowls, then ladle over the piping hot broth. Divide the prawns and mushrooms among the bowls and scatter over the sliced spring onions. Finish with the herbs."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/2.jpg"}