{"id":"114","title":"Sesame seed crusted chicken stir-fry","difficulty":"Easy","portion":"Serves 4","time":"Takes 20 minutes to make, 15 minutes to cook","description":"The sesame seeds add a delicious crunchy twist to chicken in this quick and easy stir-fry recipe.","ingredients":["1 large free-range egg","100g pack sesame seeds","3 skinless chicken breasts, thickly sliced","400g pack Thai ribbon noodles (such as Sharwood’s Stir-fry Pad Thai Noodles, from Tesco and Waitrose)","3 tbsp sesame oil","2 garlic cloves, sliced","1 small red chilli, deseeded and finely diced","1 each red and yellow pepper, sliced","130g (½ x 260g pack) mixed sliced runner beans and peas","300g pack Chinese stir-fry vegetables (from major supermarkets)","2 tbsp soy sauce","½ tsp caster sugar","Juice of 1 lime, plus lime wedges, to garnish","1 tbsp rice wine vinegar"],"method":[{"Step 1":"Place the egg in a bowl, lightly whisk and season with salt and pepper. Pour the sesame seeds into a separate bowl. Dip the chicken slices in the egg, then roll them in the sesame seeds."},{"Step 2":"Place the noodles in a bowl and cover with boiling water. Soak for 5 minutes, then use a fork to loosen and separate the noodles. Drain."},{"Step 3":"Meanwhile, heat 1 tbsp of the sesame oil in a frying pan over a medium-high heat. Add the sesame chicken, and cook for 5 minutes until golden all over and cooked through."},{"Step 4":"Heat another 1 tbsp sesame oil in a wok or the frying pan over a high heat, and quickly stir-fry the garlic and chilli for 30 seconds, then add the peppers and cook for 1 minute. Add the mixed beans and peas, then the Chinese vegetables, and cook for a further 3-4 minutes."},{"Step 5":"Make a dressing by mixing together the soy sauce, caster sugar, lime juice, vinegar and remaining sesame oil. Pour over the stir-fried vegetables and heat through. Divide the noodles among bowls, top with the vegetables and chicken, and serve with lime wedges."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/114.jpg"}