{"id":"97","title":"Chinese crispy duck","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 20 min, oven time 2 hours 10 min, plus overnight marinating","description":"This crispy duck recipe with pancakes is an easy homemade version of the irresistible Chinese delicacy, and perfect for Chinese New Year.","ingredients":["4 free-range duck legs (400g in total)","3 tsp salt","2 tsp whole Sichuan peppercorns","2 star anise","2 pieces of cassia bark or 2 cinnamon sticks","40g piece of fresh ginger, unpeeled, lightly crushed","4 spring onions, white parts","only, lightly crushed","2 tbsp Shaoxing wine (available from Asian supermarkets or online)","Groundnut oil for deep frying (1 litre if using a round-bottomed wok)","½ cucumber","10 spring onions, white parts only","20 Chinese pancakes","Hoisin sauce","You’ll need an oil thermometer and a deep-fat fryer or wok. If using a round-bottomed wok, use a wok stand to keep it stable.","You’ll also need a pan to steam the pancakes – or another wok if you have one.","You’ll need a bamboo (not metal) steamer that will fit onto your pan, or into your wok. Alternatively, you can heat them in a microwave."],"method":[{"Step 1":"To marinate the duck, prick the legs all over with a skewer, then put in a large bowl. Add the salt and peppercorns. Pound the star anise and cassia with a pestle and mortar to break them into smaller pieces, then add them to the bowl, along with the crushed ginger, spring onions and Shaoxing wine. Rub the salt and spices all over the duck legs. Set aside, covered, in the fridge for at least a couple of hours, or overnight."},{"Step 2":"Drain off and discard any juices, then put the duck legs, along with the spices, in a heatproof glass or ceramic bowl. Cover the bowl with foil and place in a large pan. Pour in boiling water to halfway up the side of the bowl. Cover, then steam over a high heat for 2 hours until the duck is tender and the meat comes away from the bones easily. Top up the pan with water regularly so it doesn’t dry out."},{"Step 3":"Meanwhile, prepare the trimmings. Cut the cucumber into 5cm lengths, then into fine, even slivers. Cut the spring onion into fine, even slivers. Put the sliced veg into small serving dishes."},{"Step 4":"Once the duck has steamed, remove the bowl from the steamer. Tasty liquid will have come out of the duck legs – strain and keep it to use as stock for soup or a bowl of noodles (it will be salty, so you may need to dilute it). Remove the duck legs from the liquid, discarding any whole spices sticking to them, then set aside to dry (if you’re planning to deep-fry them immediately, pat them dry with kitchen paper)."},{"Step 5":"To deep-fry the duck, heat the oil in a wok or deep-fat fryer to 180°C. To check the temperature, drop a cube of bread in the oil – it should brown within 1 minute. Use tongs to lower the duck legs into the oil, then deep-fry for 5 minutes until they are a deep mahogany brown, turning occasionally."},{"Step 6":"Pour a little boiled water into another pan (or wok) over a medium heat. Lay a stack of pancakes directly onto the slats of a bamboo steamer that will fit into your pan, then cover with the steamer’s lid. Steam for 1-2 minutes to heat them through. (Or you could microwave them on high for 10 seconds.) Spoon some hoisin sauce into a serving dish."},{"Step 7":"Remove the duck legs to a serving dish, then use a couple of forks to shred the skin and meat."},{"Step 8":"Serve with the steamer of pancakes, the cucumber, spring onion and hoisin sauce. To eat, spread hoisin sauce on a pancake, add pieces of duck and slivers of onion and cucumber, then roll up and tuck in."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/97.jpg"}