{"id":"61","title":"Pork, prawn and shiitake bean curd wraps","difficulty":"Easy","portion":"Serves 4 as a snack, 2 as a meal","time":"Hands-on time 35 min","description":"A dim sum inspired dish, without all the calories – Sophie Michell’s recipe makes for a light and tasty meal.","ingredients":["4 dried shiitake mushrooms (or dried wild mushrooms)","150g British free-range pork mince","100g peeled sustainable raw king prawns, finely chopped","5cm piece fresh ginger, finely grated","2 spring onions, finely chopped","1 tbsp Chinese rice wine (or sherry)","2 tbsp light soy sauce","1 tsp cornflour","2 bean curd sheets (about 40cm x 30cm each)","50ml sweet sherry","2 tbsp light soy sauce","1 tsp cornflour"],"method":[{"Step 1":"Begin by making the filling. Soak the shiitake mushrooms in a bowl of freshly boiled water for 10 minutes, then drain and reserve 100ml of the soaking water. Chop the mushrooms and put in a large mixing bowl. Add the pork mince and chopped prawns and mix together. Stir in the ginger, spring onions, Chinese rice wine (or sherry) and soy sauce, and sprinkle over the cornflour. Season with ground black pepper and mix well."},{"Step 2":"Boil the kettle and put the bean curd sheets on a baking tray. Pour the boiled water over and soak for 1 minute, then carefully drain off the water. Spread out the sheets separately on a clean work surface. Divide the filling in half, then form into 2 sausage shapes about 2.5cm wide and place them lengthways in the middle of each sheet. Roll the wrappers tightly around the fillings to make 2 large sausage shapes. Chop each into 4 equal pieces."},{"Step 3":"You can either bake or steam the wraps. To bake, heat the oven to 200°C/180°C fan/gas 6. Put the wraps on a baking tray, cover with foil and bake for 15 minutes. To steam, put them in a double-layer bamboo steamer over a pan of boiling water for 10 minutes."},{"Step 4":"Meanwhile, make the sauce. Put the reserved mushroom soaking water in a small saucepan with the sweet sherry and soy sauce. Stir, then simmer over a low heat for"},{"Step 5":"10 minutes. In a small bowl, mix the cornflour with a touch of cold water, then whisk into the sauce to thicken."},{"Step 6":"Put the wraps on a serving plate, drizzle over some sauce, then serve the rest in a small bowl. Eat with steamed Chinese greens, if you like."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/61.jpg"}