{"id":"3","title":"Steamed lap cheong with five treasure fried rice","difficulty":"Easy","portion":"Serves 4, or 6 with other side dishes","time":"Hands-on time 25 min","description":"Lap cheong, Chinese sausages, are the jewel in these steaming bowls of five-treasure fried rice, packed with prawns, egg and vegetables.","ingredients":["2 lap cheong (Chinese wind-dried sausage; available from Asian supermarkets or souschef.co.uk)","3 tbsp vegetable oil","4 large free-range eggs, beaten","500g cooked jasmine rice","100g shiitake mushrooms, sliced","1 red pepper, finely diced","Bunch spring onions, finely sliced on an angle","50g frozen peas","180g cooked prawns","1 cooked chicken breast, shredded","40g cashews","2 tbsp light soy sauce or tamari","½ tsp ground white pepper","1 tbsp crispy chilli oil or toasted sesame oil, plus extra to serve","Bamboo steamer"],"method":[{"Step 1":"Set a bamboo steamer over a pan of simmering water and a large non-stick wok (ideally carbon steel) over a high heat."},{"Step 2":"Put the lap cheong sausages in the steamer and steam for 15 minutes. Once the wok is smoking hot, add the oil, give it a swirl, then pour in the beaten eggs. Stir the eggs for 10-20 seconds until around half of them have solidified, then add the rice and toss vigorously to combine, using your spoon to break up clumps. The remaining egg should coat the rice grains and turn golden."},{"Step 3":"Add the mushrooms, pepper and spring onions, then cook for 2 minutes, constantly tossing the wok, then tip in the peas, prawns, chicken and cashews. Continue to cook, tossing and stirring vigorously, ensuring the rice is constantly moving in the pan, breaking up clumps as you go. After about 5 minutes, everything should be cooked through and the rice should be beginning to crisp up. Add the soy sauce, white pepper and chilli (or sesame) oil, toss again, then transfer to a serving bowl."},{"Step 4":"Remove the lap cheong from the steamer and slice into discs the thickness of a pound coin. Arrange them on top of the rice, then serve with extra chilli or sesame oil drizzled over."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/3.jpg"}