{"id":"4","title":"Jeremy Pang’s General Tso’s chicken","difficulty":"Easy","portion":"Serves 2","time":"Hands-on time 40 min","description":"Learn how to make General Tso’s chicken with expert chef Jeremy Pang. The popular wok-fried chicken dish is the perfect balance of sweet, sour, spicy, savoury and salty. You’re going to love it.","ingredients":["10 dried red chillies","300g skinless, boneless chicken thighs, diced","200g cornflour, seasoned with ¼ tsp salt and ¼ tsp pepper","½ thumb-size piece ginger, finely sliced","2 garlic cloves, finely sliced","2 spring onions, finely sliced","Vegetable oil for deep-frying","30g caster sugar","1 tsp sriracha chilli sauce","1 tbsp sweet chilli sauce","1 tbsp oyster sauce","½ tbsp black rice vinegar (see Easy Swaps and Know How)","1 tbsp light soy sauce","½ tsp dark soy sauce","1 tsp sesame oil","½ tsp sugar","1 tbsp light soy sauce","1 medium free-range egg, lightly beaten","Sliced red chilli","Sliced spring onions","Steamed rice","Flash-fried green vegetables","Digital thermometer"],"method":[{"Step 1":"Soak the dried red chillies in hot water for 10 minutes, then drain. Mix the sauce ingredients with 50ml water in a small bowl."},{"Step 2":"Put the chicken in a mixing bowl and massage the marinade ingredients into it. Tip in the cornflour and massage in until each piece of meat separates and has a dry white coating."},{"Step 3":"Build your Wok Clock*: start at 12 o’clock with your coated chicken, followed by the ginger, garlic, spring onions, the soaked chillies and lastly the sauce."},{"Step 4":"Deep-fry the coated chicken in vegetable oil at 180°C for 4-5 minutes until golden brown. Transfer the chicken to a plate lined with kitchen paper."},{"Step 5":"If using your wok for deep-frying, carefully pour out the oil into a heatproof bowl to cool, then give your wok a quick wipe with kitchen paper. Put the wok back on the hob and bring 1 tbsp veg oil to a high heat. Add the ginger, garlic and spring onions and stir-fry for 30 seconds."},{"Step 6":"Next add the soaked chillies, followed by the sauce. Boil for 3-4 minutes until syrupy, then add the deep-fried meat, tossing the wok a few times to fully coat the chicken. Sprinkle with sliced red chilli and spring onions and serve immediately with steamed rice and flash-fried green veg."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/4.jpg"}