{"id":"11","title":"Hot and sour soup","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min, plus soaking","description":"Ching-He Huang’s healthy vegan hot and sour soup recipe is a wonderful way to kick off Chinese New Year celebrations.","ingredients":["50g dried wood ear mushrooms (see Know-how)","1 tbsp cornflour","1 tbsp rapeseed oil","2.5cm piece fresh ginger, grated","1 red chilli, deseeded and finely chopped","8 cherry tomatoes","3 leaves chinese leaf, finely sliced","1 carrot, sliced into matchsticks","1 daikon, peeled and sliced into matchsticks","225g tin bamboo shoots, rinsed, drained and sliced into matchsticks","1 tbsp vegan bouillon powder","2 tbsp tamari or reduced-salt light soy sauce","2 tbsp clear rice vinegar","1 tbsp toasted sesame oil","200g fresh firm tofu, drained and sliced into matchsticks","200g enoki mushrooms (from large supermarkets), separated into smaller bunches","3 spring onions, trimmed and sliced into matchsticks (see tip)","Small handful fresh coriander, stalks finely sliced and leaves set aside for garnish"],"method":[{"Step 1":"Put the wood ear mushrooms in a bowl. Pour over boiling water and leave to soak for 20 minutes, then drain and slice into matchsticks. In a small bowl, mix the cornflour with 2 tbsp cold water to form a paste."},{"Step 2":"Heat a wok or deep frying pan over a high heat and add the rapeseed oil. Once hot, add the ginger and chilli and stir for a few seconds, then add the whole tomatoes and toss for a few seconds more. Add the chinese leaves, carrot, daikon, bamboo shoots and bouillon powder, then pour over 1 litre water."},{"Step 3":"Bring to the boil, then reduce the heat to medium and simmer for 5 minutes until the chinese leaves are translucent. Add the wood ear mushrooms and cook for 1 minute, then add the tamari/light soy sauce, rice vinegar and sesame oil."},{"Step 4":"Pour in the cornflour paste to thicken the sauce. Stir in the tofu and enoki mushrooms and cook for 1 minute, then add the spring onions and coriander stalks. Season with ground white pepper."},{"Step 5":"Spoon into serving bowls and serve garnished with coriander leaves."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/11.jpg"}