{"id":"29","title":"Pork, celery and water chestnut wontons with ma la chilli oil","difficulty":"Medium","portion":"Makes about 36 (you’ll need 16 to serve 4)","time":"Hands-on time 1 hour","description":"This recipe was created by Ching-He Huang as part of a traditional Chinese New Year menu. She’s filled wonton wrappers with a fabulously tasty pork and water chestnut filling and drizzled them in a homemade ma la chilli oil. Divine.","ingredients":["1 medium free-range egg, beaten (plus another, beaten, to seal)","300g minced British free-range pork belly (if you’re buying pre-packed, look for mince with a higher fat content)","50g celery, finely chopped","50g tinned water chestnuts, drained and finely chopped","2 spring onions, finely chopped","2 tbsp freshly grated ginger","2 tbsp premium reduced-sodium light soy sauce","2 tsp shaoxing rice wine or dry sherry","2 tsp cornflour","2 tsp toasted sesame oil","Pinch ground white pepper","36 wonton egg wrappers (7.5cm squares; available from Asian supermarkets or online at theasiancookshop.co.uk)","5 tbsp rapeseed oil","1 tbsp chilli flakes","1 tsp sichuan peppercorns, toasted in a dry pan and ground","1 tbsp chinkiang black rice vinegar","1 tbsp premium reduced-sodium light soy sauce","1 tsp toasted sesame oil","1 spring onion, finely sliced","1 small handful of coriander, roughly chopped"],"method":[{"Step 1":"For the chilli oil, heat the rapeseed oil in a wok or small pan over a medium heat. Add the chilli flakes and the sichuan pepper and stir to combine. Cook over a medium heat for 1-2 minutes, being careful not to let the chilli flakes burn. Pour into a heatproof bowl. Stir in the black rice vinegar, soy sauce, sesame oil and a pinch of fine salt, then set aside to cool (see Make Ahead)."},{"Step 2":"In a large bowl, mix together all the ingredients for the dumpling filling except the wrappers and the beaten egg to seal (see food team’s tips)."},{"Step 3":"To make the wontons, lay out the wrappers in batches on a clean work surface. Put roughly 1½ tsp filling in the middle of each. Brush the edges of the wrapper with a little beaten egg, then gather them up and mould around the filling into a ball shape, twisting at the top to secure the dumpling. Repeat with the remaining wrappers. Set aside 4 wontons per person and freeze any unused dumplings (see Make Ahead)."},{"Step 4":"Bring a large, wide pan of water to the boil, then turn the heat down to a simmer. Using a slotted spoon, gently lower in the dumplings in batches and simmer gently for 4-5 minutes or until they float to the surface and turn a translucent yellow (see Ching’s tip). Cut a dumpling open to check the fillingis cooked. Using the slotted spoon, transfer the dumplings to a serving platter or 4 individual bowls. Spoon over a little dumpling cooking water to stop them drying out, then drizzle over a little chilli oil (see food team’s tips). Garnish with the spring onions and coriander and serve."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/29.jpg"}