{"id":"164","title":"Blackened five-spice duck with mini roast potatoes","difficulty":"Easy","portion":"Serves 6","time":"Takes 40 minutes to make, about 1 1/2 hours in the oven, plus drying and overnight chilling","description":"This impressive Chinese-inspired blackened five-spice duck recipe makes an ideal dinner party dish – or alternative Sunday roast.","ingredients":["2 x 1.6kg whole ducks, giblets removed and discarded","4 tbsp clear honey","2 tbsp dark soy sauce","2 tbsp brown sugar","3 tbsp Chinese five-spice","1.5kg floury potatoes, such as Maris Piper, cut into 3cm dice"],"method":[{"Step 1":"Place the ducks breast-side up on a rack over a large roasting tin and pour 1 litre boiling water over each. Discard the water from the tin and pat each duck dry with kitchen paper. Line the roasting tin well with foil, replace the rack and sit the ducks on top, side by side, breast-side up."},{"Step 2":"Mix together the honey, soy sauce, sugar and Chinese five-spice to make a smooth glaze. Set 4 tablespoons aside. Brush half the remaining glaze over the top and sides of each duck. Let it dry then brush with the remaining glaze. Allow the glaze to settle then chill the ducks, uncovered, overnight."},{"Step 3":"On the day, remove the ducks from the fridge 1 hour before cooking. Preheat the oven to 200°C/fan180°C/gas 6. Cook the ducks in the hot oven for 35 minutes."},{"Step 4":"Meanwhile, par-boil the potatoes in salted water for 2-3 minutes. Drain well. Remove the ducks from the oven, turn them over on the rack and brush with the reserved glaze. Tip out 6 tablespoons of fat from the tin into another large roasting tin. Add the potatoes, season and toss. Return the ducks to the oven, place the potatoes underneath and roast for a further 35 minutes or until the ducks are golden and the juices run clear when tested with a skewer. Set aside, covered, to rest for 20 minutes."},{"Step 5":"Meanwhile, increase the oven temperature to 220°C/fan200°C/gas 7. Toss the potatoes and cook for a further 15-20 minutes or until golden and crisp. Set aside, covered."},{"Step 6":"Preheat the grill to medium. Place a duck breast-side-up on a board. Using a sharp knife, cut off the legs and thighs in 1 piece, then remove each breast from the bone and slice in half. You now have 6 portions. Repeat with the other duck to give 12 portions. Put the duck pieces on a large baking tray, skin-side up. Grill for 2 minutes to crisp up the skin."},{"Step 7":"Divide the duck between 6 warm serving plates and serve with the roast potatoes and baby savoy with pancetta and star anise."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/164.jpg"}