{"id":"27","title":"Sweet and smoky red-cooked cod (hong sao yu)","difficulty":"Easy","portion":"Serves 4, as part of a feast","time":"Hands-on time 20 min ","description":"Ching-He Huang‘s quick Chinese fish recipe, made with cinnamon, star anise, sichuan peppercorns and soy, is best served with jasmine rice.","ingredients":["500g sustainably sourced skinless cod loin fillet, cut into 2-3 inch chunks (look for Norwegian MSC-certified fish)","1 tbsp shaoxing rice wine or dry sherry","3 tbsp rapeseed oil","2-3 tbsp potato flour (or plain flour)","2.5cm piece fresh ginger, sliced into rounds","1 cinnamon stick","1 star anise","1 tsp sichuan peppercorns","3 tbsp premium reduced-sodium light soy sauce","2 tsp premium dark soy sauce","1 tbsp chinkiang black rice vinegar or balsamic vinegar (see know how)","3 tbsp soft brown sugar","Micro shiso leaves (from Asian supermarkets) or micro herb Asian salad mix (we used Growing Underground, available from Ocado)","Steamed jasmine rice","Steamed pak choi"],"method":[{"Step 1":"Mix the sauce ingredients in a jug with 300ml water, whisking well to dissolve the sugar. Pour into a small pan, then simmer over a medium-high heat until reduced by half."},{"Step 2":"Put the fish in a bowl with the shaoxing rice wine or sherry. Set aside for a few minutes."},{"Step 3":"Drain the fish, then season with a pinch each of salt and ground white pepper. Heat the rapeseed oil in a wok over a high heat. Put the potato flour on a large plate, then coat the fish pieces in the flour. Carefully drop the coated fish into the oil and fry for a few minutes until the flesh has turned an opaque white colour."},{"Step 4":"Meanwhile, strain the sauce into a separate small pan and bring back to a simmer, but don’t discard what’s left in the sieve."},{"Step 5":"Warm a serving bowl and gently transfer the fish to it. Pour over the hot strained sauce, then sprinkle over some of the remaining spices from the sieve. Serve topped with shiso leaves or herbs, with rice and pak choi alongside."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/27.jpg"}