{"id":"6","title":"Giant prawn toast","difficulty":"Easy","portion":"Serves 6-8 as a snack","time":"Hands-on time 15 min","description":"Giant prawn toast is a great sharing dish for Friday nights. Our mega prawn toast with dipping sauce is a fun riff on a takeaway favourite.","ingredients":["1 small (400g) loaf soft white unsliced bread","12 sustainable raw Scottish langoustines (or use sustainable North Atlantic prawns)","2 garlic cloves, crushed","3cm piece ginger, roughly chopped","1 tbsp sesame oil, plus extra","1 tbsp soy sauce","1 tbsp cornflour","1 medium free-range egg, separated (yolk beaten)","2 spring onions, finely chopped","Small bunch coriander, chopped, plus extra leaves to serve","4 tbsp sesame seeds, plus extra to serve","5-6 tbsp light olive oil","½ tsp chilli flakes","4 tbsp sweet chilli sauce","1 tbsp soy sauce","1 tbsp sesame oil","1 tsp white wine vinegar","2 tsp honey"],"method":[{"Step 1":"Heat the oven to 180ºC fan/gas 6. Turn the loaf on its side and slice the crust off the top and bottom of it. With the loaf still on its side, cut 2 x 1.5cm thick slices, lengthways."},{"Step 2":"Peel the langoustines and roughly chop 8, then add to a food processor with the garlic and ginger. Pulse to a rough mixture, adding a splash of water to loosen if need be. Add the sesame oil, soy, cornflour and egg white, then briefly pulse. Stir in the spring onions and coriander."},{"Step 3":"Evenly spread the mixture over the top of the slices of bread, taking it right to the edges. Slice the remaining 4 langoustines in half lengthways and divide among the slices. Brush egg yolk over and scatter with the sesame seeds."},{"Step 4":"Heat a very large pan over a medium heat with half the oil. When hot, add one slice, bread side down. Cook for 2-3 minutes, then turn and repeat until turning golden and crisp. Put prawn-side down on an oven tray (so the toast doesn’t go soggy) and repeat with the second piece. Put in the oven for 5 minutes or until cooked through."},{"Step 5":"Whisk the dipping sauce ingredients in a small bowl. Top the toasts with coriander leaves, extra sesame seeds and the chilli flakes, then drizzle with sesame oil. Slice and serve with the dipping sauce"}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/6.jpg"}