{"id":"131","title":"Sweet and sour chicken","difficulty":"Easy","portion":"Serves 4","time":"Takes 30 minutes to make and about 15 minutes to cook","description":"Sybil Kapoor’s sweet and sour chicken recipe is a fun one to make with the kids and you probably already have all the ingredients at home! Serve with steamed rice.","ingredients":["4 chicken breasts, skinned","2 red peppers, deseeded and quartered","2 small red onions","225g can bamboo shoots, drained","1 medium supersweet pineapple","2 tsp cornflour","4 tbsp light muscovado sugar","2 tbsp Kikkoman Soy Sauce","6 tbsp white wine vinegar","2 tbsp tomato ketchup","3 tbsp plain flour","1 medium free-range egg, beaten","5 tbsp sunflower oil"],"method":[{"Step 1":"Cut the chicken breasts into 2cm chunks, place in a small bowl and sprinkle over a little salt. Cut the red peppers and red onions into similar-size pieces and place in a separate bowl. Rinse the bamboo shoots, drain and dice. Add to the vegetables and set aside."},{"Step 2":"Top and tail the pineapple, then cut away the skin and thickly slice before coring each slice and cutting into chunks. In a separate bowl, mix the cornflour with 100ml water, the muscovado sugar, soy sauce, vinegar and ketchup."},{"Step 3":"Place the flour and egg in a bowl and beat with a whisk until it forms a smooth batter. Mix in the chicken and coat thoroughly. Preheat a wok or a large non-stick frying pan over a high heat. Add the sunflower oil and once sizzling hot, add half the chicken. Fry briskly for 2 minutes, then turn over and cook the other side for 2 minutes or until golden. Remove with a slotted spoon to a plate, then add the remaining chicken and repeat."},{"Step 4":"If necessary, drain all but 2 tbsp oil from the pan, then add the vegetables and stir-fry briskly for 30 seconds before adding the pineapple. Stir-fry for 1 minute, then mix in the chicken followed by the sauce. Boil briskly for another minute or so, stirring regularly, until the sauce thickens. Serve with steamed rice."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/131.jpg"}