{"id":"17","title":"Ken Hom’s crispy fish spring rolls","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 40 min","description":"Celebrate Chinese New Year with Ken Hom’s fish spring rolls – they’re deliciously crispy and will leave you fighting for seconds.","ingredients":["3 tbsp sea salt flakes","2 tbsp sichuan peppercorns","450g sustainable skinless white fish fillets, such as cod or sea bass, cut into 2.5cm squares","1 medium free-range egg white","2 tbsp shaoxing rice wine or dry sherry ","3 tbsp chopped spring onions","2 tsp cornflour","2 tsp toasted sesame oil","5cm piece fresh ginger","4 sheets filo pastry, about 30cm x 46cm (see Ken’s tip)","Cornflour for dusting","Vegetable oil for frying ","1 lemon, cut into wedges","Large, deep wok or pan; food processor or blender; digital probe thermometer; baking tray lined with kitchen paper"],"method":[{"Step 1":" To make the salt and pepper dip, heat a wok or large frying pan until hot, then add the salt and sichuan peppercorns. Stir-fry for 1 minute, remove and set aside to cool, then roughly grind with a pestle and mortar for 1 minute and set aside. You won’t need it all, but it lasts for weeks and goes with many things."},{"Step 2":" For the fish paste, mix the fish, egg white, rice wine, spring onions, cornflour and sesame oil in a food processor with a little salt and pepper. Coarsely grate the ginger, then squeeze the juice into the food processor and whizz to a smooth paste. (Use the pulse button or the paste will turn out rubbery.)"},{"Step 3":"Spread out the pieces of filo on a worktop, then divide the fish paste evenly among them in a sausage-like roll, about 25cm long (see Food Team’s tip). Roll up the filo, tucking in the ends as you roll. Repeat until the filo has been used up. Dust with cornflour and shake off any excess (see Make Ahead)."},{"Step 4":"Set the wok or pan over a high heat. When hot, pour in the oil and heat to 180°C on a digital probe thermometer (a cube of bread should turn golden in about 30 seconds). Gently lower in 2 of the fish rolls and cook until golden brown and crisp (about 5 minutes). Carefully remove with a slotted spoon and put on the prepared tray. Fry the remaining rolls. Serve with lemon wedges and the salt and pepper dip."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/17.jpg"}