{"id":"64","title":"Duck pancakes with quick-pickled spring onions","difficulty":"Easy","portion":"Serves 2","time":"Hands-on time 30 min, oven time 8 min","description":"These savoury pancakes, filled with crunchy pickled spring onions, perfectly cooked duck and hoisin sauce, are all the right levels of sweet, salty, tangy and crunchy.","ingredients":["2 x 180g free-range duck breasts","4 large Chinese lettuce leaves","Hoisin sauce to serve","75ml rice vinegar (or cider vinegar)","50g caster sugar","4 spring onions, finely shredded","¼ cucumber, finely shredded","50g beansprouts","160ml milk","2 large free-range eggs","80g rice flour","4 spring onions, very finely chopped","½ tsp toasted sesame oil","Sunflower oil for frying"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. For the quick-pickled spring onions, put the vinegar and sugar in a small pan over a low heat, then stir to dissolve the sugar. Add the shredded spring onions and cucumber and the beansprouts, then take off the heat and leave to cool."},{"Step 2":"Meanwhile, pat the duck skin dry with kitchen paper and season well with salt and pepper. Put a dry frying pan over a high heat and, when hot, fry the duck breast, skin-side down, for 5 minutes or until the skin crisps. Turn and fry on the other side for 30 seconds."},{"Step 3":"Transfer the duck breasts to a baking tray, skin-side up, and cover loosely with foil. Roast for 8 minutes for medium-rare (11 if you prefer well done). Take out of the oven and put the duck on a board to rest."},{"Step 4":"For the pancakes, whisk all the ingredients (except the sunflower oil) in a mixing bowl, then season with salt and pepper."},{"Step 5":"Heat a drizzle of sunflower oil in a large frying pan over a medium heat. Ladle in quarter of the batter and fry for 1 minute on each side until golden. Transfer to a plate. Repeat with the remaining batter to make 4 pancakes."},{"Step 6":"Slice the rested duck breasts. Lay one large Chinese lettuce leaf in the centre of each of the pancakes, then top with the quick-pickled spring onions and duck, pouring over any resting juices. Serve with hoisin sauce and the leftover pickle juice to spoon over, then wrap up to eat."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/64.jpg"}