{"id":"18","title":"Stuffed bitter melon with black bean sauce","difficulty":"Medium","portion":"Serves 4-6 as part of a sharing menu","time":"Hands-on time 20 min, steaming time 15-18 min","description":"For something a little bit different, serve up Ken Hom’s pork-stuffed bitter melon with black bean sauce as a starter to celebrate Chinese New Year.","ingredients":["2 large bitter melons (350-450g; see Know-how, or use cucumber)","225g British free-range 10% fat minced pork","2 tsp finely chopped fresh ginger","2 tbsp finely chopped spring onions","2 tbsp shaoxing rice wine or dry sherry","Pinch sugar","1 tbsp light soy sauce","1 tsp toasted sesame oil","1 medium free-range egg,lightly beaten","1 tsp cornflour, plus extrafor dusting","2 tbsp groundnut or vegetable oil","1 tbsp roughly chopped garlic","2 tbsp fermented black bean paste (see Know-how)","1 tbsp shaoxing rice wine or dry sherry","1 tbsp oyster sauce","200ml chicken stock","1 tsp cornflour mixed with 1 tsp cold water","2 tsp toasted sesame oil","Steamer or wok/deep panwith a lid and a rack set inside; lipped heatproof plate that will fit inside"],"method":[{"Step 1":"For the filling, mix all the ingredients in a bowl. Cut the bitter melon (or cucumber) into 2.5cm rounds, discarding the ends. With a small sharp knife, remove and discard the core of pulp and seeds."},{"Step 2":" Lightly dust the insides of the slices with cornflour. Fill each with a generous spoonful of the filling, then arrange on a heatproof plate (one that will fit inside the steamer). See Make Ahead and tip."},{"Step 3":"Set up a steamer (or put a rack in a wok or deep pan) and half fill with water. Bring to the boil over a high heat, then carefully lower in the plate. Turn the heat to low, then cover tightly and steam gently for 15-18 minutes (you may have to do this in two batches)."},{"Step 4":"Meanwhile to make the sauce, heat a wok or large frying pan over a high heat until very hot. Add the oil and, when slightly smoking, add the garlic and black bean paste, then stir-fry for 30 seconds. Add the remaining sauce ingredients, except the cornflour mixture and sesame oil. Simmer, then stir in the cornflour mixture until thickened. Bubble gently for 1 minute. Stir in the sesame oil, transfer the stuffed bitter melon to a serving plate, pour over the sauce and serve."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/18.jpg"}