{"id":"5","title":"MiMi Mei Fair’s ‘Hokkien’ noodles","difficulty":"Easy","portion":"Serves 2-3","time":"Hands-on time 30 minutes","description":"These noodles are a celebration dish worth making. Whether you’re cooking up a feast for Chinese New Year or simply a Friday night, Peter Ho of London restaurant MiMi Mei Fair has created a next-level Hokkien noodle dish. The delicate balance of fish sauce, Chinese chicken powder and ground white pepper makes for an umami sensation that’ll have you coming back for seconds.","ingredients":["2 sustainable scallops, sliced in half horizontally (defrosted if needs be)","3 sustainable raw king prawns, sliced in half horizontally (defrosted if needs be)","Pinch cornflour","Pinch caster sugar","Vegetable oil for frying","100g yellow egg noodles, cooked (or use straight-to-wok noodles)","100g rice vermicelli noodles, cooked (or use straight-to-wok noodles)","2 garlic cloves, chopped","2 free-range medium eggs, lightly beaten","20g chives, chopped into batons","50g bean sprouts, rinsed","15g fried shallots (we used shop-bought)","Juice 1 lime","2 tsp fish sauce","1 tsp chicken powder (eg chicken stock cube or bouillon or see Tips)","1 ½ tsp sesame oil","2 tbsp sugar","Pinch ground white pepper"],"method":[{"Step 1":"In a small bowl mix together the seasoning ingredients, then set aside. Season the scallops and prawns with pinch each of salt, sugar and corn flour, lightly sear on both sides in a wok/frying pan in a little oil, then set aside with the seasoning mix until later."},{"Step 2":"Add a splash more oil to the wok/frying pan, add the noodles and vermicelli, then stir-fry, tossing over a medium heat for 1 minute."},{"Step 3":"Push the noodles to one side of the wok, pour in a little more oil, then stir-fry the chopped garlic for 30 seconds. Pour in the eggs and gently mix with the garlic and noodles, add the chicken stock and seasoning mix, then simmer for 2 minutes on a low heat."},{"Step 4":"Add the chives and bean sprouts along with the seared scallops and prawns. Simmer for another 1 minute, gently mixing everything together whilst it’s cooking. Once ready, squeeze over the fresh lime juice and serve straight away."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/5.jpg"}