{"id":"41","title":"Home-smoked salmon with green herb lettuce salad","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 40 min, plus marinating","description":"”This recipe is light and bursting with Asian flavours. It makes a wonderful starter” – Thomasina Miers. And you can receive all the glory for going to the trouble of home-smoking your own salmon.","ingredients":[" 3 tbsp light brown soft sugar","3 tbsp light soy sauce","Juice 1 lime","Large thumb-size piece fresh ginger, finely grated","750g organic salmon fillets, skin on","125g white rice (uncooked)","1 cinnamon stick","2 star anise","1 tsp peppercorns","Bunch coriander, stems separated, leaves reserved for the salad","Small bunch fresh mint, leaves picked","1 baby shallot, finely sliced","2 soft round lettuces, leaves picked","2 handfuls radishes (about 150g), finely sliced","½ cucumber, sliced into thin half-moons","1 small garlic clove, crushed","1 red bird’s eye chilli, chopped","1 tbsp toasted sesame seeds, ground in a pestle and mortar","3 tbsp brown sugar","4 tbsp toasted sesame oil","2 tbsp fish sauce","Juice 3 limes","Wok or deep frying/sauté pan with a wire rack that will fit the salmon"],"method":[{"Step 1":"Make a marinade by mixing the sugar, soy, lime and ginger in a small bowl. Lay the salmon fillets in a single layer in a shallow glass or ceramic bowl, pour over the marinade, turn to coat, then cover and chill for at least 20 minutes."},{"Step 2":"Line the base of the wok/pan with 2 layers of foil. Put the rice, cinnamon, star anise, peppercorns and coriander stems (reserve the leaves for the salad) in the bottom of the wok/pan on the foil. When the salmon has marinated, drain it and sprinkle the drained marinade over the rice. Set the wire rack over the rice mixture and lay the salmon on top; wrap the wok/pan in 2 layers of foil to seal tightly."},{"Step 3":"Put the wok/pan on the hob over a high heat. After a few minutes you’ll see the beginnings of smoke. Turn down the heat to medium and smoke the fish for 12-15 minutes (depending on the thickness of your fish), turning once. The flesh will turn opaque when it’s just cooked. Set aside to cool."},{"Step 4":"Put the salad ingredients with the coriander leaves in a mixing bowl. To make the dressing, bash the garlic to a paste in a pestle and mortar with the chilli, sesame seeds and sugar. Whisk in the other dressing ingredients, taste and season. (Or whizz the dressing ingredients in a mini food processor.)"},{"Step 5":"Flake the salmon into large chunks (discard the skin). Dress the salad with half the dressing, arrange on plates with salmon chunks on top, then drizzle with the rest of the dressing to serve."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/41.jpg"}