{"id":"77","title":"Prawn and herb lettuce cups with ginger dressing","difficulty":"Easy","portion":"6-8","time":"Hands-on time 30 min, plus chilling","description":"These delicate Chinese-inspired prawn and herb lettuce cups make an elegant starter or nibble with drinks.","ingredients":["2 little gem lettuce hearts","2 tbsp rapeseed oil","1 tsp finely chopped garlic","1 tsp finely chopped fresh ginger","50ml shaoxing rice wine (from the world food aisle of large supermarkets and Asian food shops)","8 water chestnuts from a tin, drained and very finely chopped","400g sustainably sourced peeled king prawns, chopped into small pieces","3 spring onions, sliced","15 fresh mint leaves, roughly chopped","Handful fresh coriander, roughly chopped","4cm fresh ginger, cut into thin sticks","1 tbsp Chinese black vinegar (also sold as chinkiang vinegar, from the world food aisle of large supermarkets and Asian food shops)","2 tbsp soy sauce"],"method":[{"Step 1":"Pull the little gem lettuce hearts apart to give 12-16 cupped leaves that are large enough to fill. Cut off the roots to make it easier to separate the leaves neatly, if you like. Put on a plate, then chill in the fridge while you prepare the prawn filling (see tip)"},{"Step 2":"Mix all the dressing ingredients in a bowl with 1 tbsp water. Set aside at room temperature until ready to serve (see tip)"},{"Step 3":"Heat a large heavy-based, non-stick frying pan. Add the oil, then fry the garlic and ginger over a medium heat for 2-3 minutes or until fragrant – don’t let them burn or they’ll taste bitter. Add the rice wine and chopped water chestnuts to the pan, then bubble until almost all the liquid has evaporated. Add the chopped prawns, stir well and cook over a high heat for 1-2 minutes until completely pink and cooked through."},{"Step 4":"Transfer the prawn mixture to a medium bowl, then sprinkle over the spring onions and herbs and briefly mix."},{"Step 5":"Remove the lettuce leaves from the fridge and fill each with a heaped tablespoon of the prawn mixture. Arrange on a large serving platter, then serve straightaway while still crisp, with the ginger dressing to spoon over."}],"image":"https://apipics.s3.amazonaws.com/chinese_recipes_api/77.jpg"}