{"id":"46","title":"Breakfast burrito","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 25 min, cooking time 15 min","description":"Make a Mexican feast for breakfast with these flavour-packed burritos. Fill your tortilla with spicy beans, a fresh tomato salsa and your favourite breakfast bits and bobs.","ingredients":["4 small free-range eggs","8 rashers of smoked streaky bacon","1 tbsp light olive oil","1 red onion, finely chopped","200g passata","40g ketchup","1 tsp ground cumin","1 tsp sweet smoked paprika","1 tsp Tabasco","1 tsp Worcestershire sauce","1½ x 400g cans black beans (360g total drained weight)","½ red onion, finely chopped","150g mixed tomatoes, finely chopped","1 jalapeño or green chilli, finely chopped","Juice 1 large lime","Soured cream or chipotle mayo (we like Gran Luchito)","4 large tortilla wraps","Bunch fresh coriander, finely chopped","60g mature cheddar, grated","2 small avocados, peeled, stoned and halved","Finely grated zest and juice 1 lime","Mexican chilli sauce and sliced jalapeños"],"method":[{"Step 1":"For the beans, heat the oil in a small saucepan over a medium heat, add the onion and cook for 5 mins until golden brown. Add the passata, ketchup, cumin, paprika, tabasco, Worcestershire sauce and 2 tbsp water, then bring to the boil and gently simmer for 10 min. Add the beans, season with salt and pepper and cook for 5 more minutes. Add a splash more water to loosen, if necessary (see Make Ahead)."},{"Step 2":"For the pico de gallo salsa, mix the red onion, tomatoes, chilli, lime zest and juice. Set aside until needed."},{"Step 3":"Boil the eggs in a pan of boiling water for 6 min for runny yolks, 7 min for soft and 8 for hard boiled. Drain and run under cold water then peel. Meanwhile under a medium high grill, cook the bacon for 2 min each side until crisp."},{"Step 4":"To assemble spread the soured cream/chipotle mayo in the middle of the wraps, sprinkle with a little coriander then cheese. Spread over a thin layer of the beans, 2 slices of crispy bacon, then set the avocado (cut side up) in the middle, sprinkle over the rest of the coriander and the lime zest and juice, season and drizzle over the chilli sauce. Set the egg into the hollow of the avocado (you may need to spoon out a little of the flesh to help the egg fit), then add some more beans behind the egg to make an even sausage shape. Add the pico de gallo, Mexican chilli sauce and jalapeños then fold the top and bottom edges inwards and roll from right to left tucking in the wrap to secure the filling and slice in half."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/46.jpg"}