{"id":"94","title":"Beef chilli with dark chocolate","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 30 min, simmering time 40 min","description":"Ernesto Puga Cardoso won our Great Chilli Cook-Off competition with this beef and dark chocolate chilli recipe.","ingredients":["1 tbsp vegetable oil","1 onion, finely chopped","2 garlic cloves, chopped","1 red pepper, finely chopped","2 medium vine tomatoes, chopped","1 tsp hot chilli powder","1 tsp paprika","1 tsp ground cumin","500g 10% fat British Aberdeen Angus beef mince","100ml red wine","1 tsp dried oregano","1 tsp dried thyme","3 tsp tomato paste","400g tin chopped tomatoes","240ml quality fresh beef stock","2 bay leaves","1 medium cinnamon stick","400g tin kidney beans, drained and rinsed","400g tin sweetcorn","30g dark chocolate (85% cocoa solids), broken into pieces","Ripe avocado, soured cream, fresh coriander sprigs and soft flour tortillas to serve (optional)"],"method":[{"Step 1":"Heat the oil in a medium pan over a low heat. Add the onion and cook for 5 minutes, stirring occasionally, until translucent. Add the garlic, pepper and vine tomatoes and cook, stirring, for 6-8 minutes until the tomatoes have softened."},{"Step 2":"Make a space in the centre of the mixture, then add the chilli powder, paprika and cumin. Mix well, then cook for around 5 minutes."},{"Step 3":"Meanwhile, season and cook the mince in a separate pan over a high heat for 8 minutes or until browned."},{"Step 4":"Drain the mince, then add it to the tomato mixture, along with the wine. Stir over a high heat until the wine evaporates. Stir in the oregano and thyme, then the tomato paste. Reduce the heat to low and cook for 1 minute. Add the tinned tomatoes and stock. Cook for 5 minutes; stir occasionally."},{"Step 5":"Add the bay and cinnamon, then cover the pan with a lid and simmer for 30 minutes, stirring now and then."},{"Step 6":"Remove the lid and stir in the beans and sweetcorn, then cook, uncovered, for 10 minutes. Taste and season, then stir in the chocolate until it has melted. Remove the pan from the heat, then discard the bay leaves and cinnamon stick. Serve in bowls topped with avocado slices, soured cream, coriander sprigs and a grind of black pepper, with soft flour tortillas on the side, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/94.jpg"}