{"id":"16","title":"Enchiladas verdes","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 30 min","description":"These classic Mexican enchiladas verdes are filled with tender chicken thighs and covered with cheese and rich tomatillo sauce for a filling family dinner.","ingredients":["6 skinless and boneless free-range chicken thighs","400g tin pinto beans (or use black beans if you prefer)","200g mature cheddar, grated","6 large tortilla wraps","Small bunch coriander, leaves picked, to serve","1 small red onion, thinly sliced, soaked in cold water, to serve","1 red chilli, thinly sliced, to serve","1 green chilli, thinly sliced, to serve","100g queso fresco cheese or feta, crumbled, to serve and cut in half if large","790g tin tomatillos","50g coriander, leaves and stalks roughly chopped","½ white onion, roughly chopped","1-2 fresh jalapeño chilli, halved, seeds removed","2 large garlic cloves, peeled","Grated zest and juice 2 limes"],"method":[{"Step 1":"Heat the oven to 160ºC fan/gas 4. To make the salsa, put all the ingredients in a food processor or blender with a large pinch of salt and whizz until everything is finely chopped. Put the chicken thighs in the roasting dish and toss with 150ml of the salsa, cover tightly with foil, then cook in the oven for 30 minutes until cooked through. Shred the chicken and mix in a large bowl with the pinto beans, 150g of the cheddar and 2-3 tbsp of the salsa."},{"Step 2":"Increase the oven to fan 180ºC/gas 6. Pour half the remaining salsa into the baking dish. Dip a tortilla into the salsa, lightly coating both sides. Divide the chicken mix into 6 portions, then arrange one portion along the middle of a wrap. Roll up and put in the baking dish. Repeat with the remaining tortillas and filling. Drizzle over the remaining salsa, sprinkle with the remaining 50g cheddar, then bake in the oven for 20-30 minutes until bubbling and golden."},{"Step 3":"Serve piping hot, topped with the coriander, onion, chillies and queso fresco/feta, with extra lime and sour cream on the side if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/16.jpg"}