{"id":"137","title":"Classic chilli con carne","difficulty":"Easy","portion":"Serves 8","time":"Hands on time 25 mins, plus 2¼ hours cooking time","description":"Feed a crowd with our classic chilli con carne recipe, made with red wine, black treacle and little cinnamon for subtle sweetness.","ingredients":["2 tbsp olive oil","2 onions, finely chopped","3 garlic cloves, finely chopped","Small bunch fresh coriander, leaves picked and kept to one side; stalks reserved","2 green chillies, finely diced","1-2 tsp dried red chilli flakes","2 tsp ground cumin","2 tsp ground cinnamon","2 tsp dried oregano","1kg good-quality beef mince","2 tbsp tomato purée","200ml red wine","600g canned chopped tomatoes","2 tbsp black treacle","About 1 litre good-quality beef stock","2 red peppers, diced","400g can kidney beans, drained and rinsed","1 lime, cut into wedges"],"method":[{"Step 1":"Heat the olive oil in a large casserole and gently fry the onions, garlic, coriander stalks and chillies for 5 minutes until softened. Stir through the spices and oregano and cook for 2 minutes more."},{"Step 2":"Turn the heat up to medium-high, add the beef mince and brown it well, breaking it up with a wooden spoon. Once browned, add the tomato purée and cook over a medium heat for 2 minutes, then add the red wine, allowing it to reduce to a sticky sauce – this will take about 2 minutes."},{"Step 3":"Stir through the canned tomatoes and black treacle, and add enough beef stock to cover. Stir well and bring to boiling point. Put the lid on, reduce the heat and simmer for 1½ hours, stirring occasionally."},{"Step 4":"Remove the lid, add the red peppers and cook for a further 10 minutes. Then add the kidney beans, season really well and cook for 20 minutes more until the sauce is reduced to your liking. Taste and adjust the heat (with chilli flakes) and seasoning. Top with the coriander leaves and serve with steamed rice and lime wedges."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/137.jpg"}