{"id":"53","title":"Nachos with pulled pork and sweetcorn salsa","difficulty":"Medium","portion":"Serves 4-6","time":"Hands-on time 35 min, oven time 1 hour 40-45 min","description":"Layer up nachos with succulent pulled pork, cheddar and a sweet and zingy sweetcorn salsa. Friday night in just got a whole lot better, thanks to our easy nachos recipe.","ingredients":["3 tbsp olive oil","2 large banana shallots, finely sliced","600g British free-range pork shoulder, cut into 2cm cubes","3 fat garlic cloves, crushed","1½ tbsp ground cumin","1 tbsp ground coriander","1 tsp ground cinnamon","1 tsp mild chilli powder","½ tsp ground allspice","2 tsp each dried thyme and dried oregano","3 tbsp tomato purée","3 tbsp red wine vinegar","500ml chicken stock","2 tsp caster sugar","100ml whole milk","½ red onion, finely diced","1 tbsp red wine vinegar","1 tsp caster sugar","198g tin sweetcorn, drained and rinsed","½-1 jalapeño chilli or red chilli, deseeded and finely chopped","1 ripe avocado, peeled and cut into small dice","1 small bunch fresh coriander, finely chopped","Juice ½ lime","200g bag tortilla chips","Extra-mature cheddar, grated","Soured cream and pickled jalapeños (optional)"],"method":[{"Step 1":"To make the pulled pork, heat the oven to 200°C/180°C fan/gas 6. Heat the oil in a large flameproof casserole (one with a lid) on a medium heat, then fry the shallots for 5-6 minutes, stirring often, until slightly softened but not coloured. Turn up the heat, season the pork with salt, then add to the pan and fry for 4-5 minutes, stirring, until the meat has coloured slightly on the outside. Reduce the heat to medium, add the garlic and cook, stirring, for 1-2 minutes, then add all the spices and dried herbs. Stir to coat the meat and fry for 2 minutes until the spices are fragrant. (If they start to catch on the bottom of the pan adda splash of water and keep stirring.)"},{"Step 2":"Stir in the tomato purée and red wine vinegar and cook for 2-3 minutes. Pour in the chicken stock and add the sugar and milk, bring everything to a simmer, then put the lid on and transfer to the oven. Cook for 1½ hours, stirring halfway through, until the pork falls apart easily when pressed with a spoon."},{"Step 3":"When the meat is tender, remove it to a bowl using a slotted spoon and put the pan with the remaining sauce on the hob. Bring back to a simmer for 10 minutes or until reduced by half. Meanwhile, shred the pork with 2 forks, then add it back to the sauce, stir and set aside until ready to assemble the nachos."},{"Step 4":"To make the salsa, put the red onion, vinegar and sugar in a glass or ceramic bowl with a generous scattering of salt and stir to combine. Leave for 10 minutes so the onions lightly pickle, then stir in the remaining ingredients, taste and season again. Chill until ready to serve."},{"Step 5":"To assemble the nachos, heat the oven to 200°C/180°C fan/gas 6. Scatter the tortilla chips in a baking dish or tray, then spoon over the warm pork. Sprinkle with as much grated cheese as you see fit, then heat in the oven for 10-15 minutes until the cheese has melted. Spoon the salsa over the top, then serve with any extra salsa, and the soured cream and jalapeños if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/53.jpg"}