{"id":"123","title":"Mexican sweetcorn with smoky chilli, cheese and lime","difficulty":"Easy","portion":"Serves 8","time":"Takes 10 minutes to make, 30 minutes to cook, plus soaking and preheating barbecue","description":"Limes and chillies are the key ingredients in Debbie Major’s Mexican sweetcorn recipe.","ingredients":["8 large sweetcorn cobs in their husks (see tip)","6 dried Bart Hot Kashmiri Chillies (from Waitrose) or similar","25g butter, at room temperature","6 tbsp mayonnaise","75g finely grated Parmesan","3 limes, cut into wedges, to serve"],"method":[{"Step 1":"If cooking the cobs in their husks, soak them in a bucket of cold water for at least 1 hour. Meanwhile, heat a dry, heavy-based frying pan over a medium heat. Add the chillies and shake them around for 1 minute until they are toasted and slightly darkened. Remove the stalks, tip into a spice grinder, leave until cold, then grind into a fine powder. Tip into a bowl and set aside."},{"Step 2":"Drain the cobs of sweetcorn, then carefully peel back the outer leaves, leaving them still attached at the base. Pull away and discard the fine silky threads, spread the corn with butter, then sprinkle with salt. Pull the husks back around the corn and tie at the top with string. (If using peeled cobs, spread them with butter, season with salt and wrap in pairs in foil.)"},{"Step 3":"Light the barbecue and leave until it’s at a medium heat – this could take anything up to 30 minutes. When it’s ready, the coals should be covered in a layer of light grey ash. Rearrange the coals so they lie around the edge of the grate, leaving a space clear in the centre. Place the corn, side by side, in the centre of the barbecue and cook over the indirect heat for 20-25 minutes or until tender. Pull away the husks (or foil, if using) and if the cobs haven’t browned very much, put them directly on the bars for a few minutes, turning every now and then, until they’re tinged with dark spots."},{"Step 4":"Transfer the sweetcorn to a baking tray and spear the end of each cob with corn forks if you have them. Spread each one with mayonnaise, then sprinkle with a little salt and a generous amount of grated cheese. Sprinkle lightly with chilli powder, serve with lime wedges and devour."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/123.jpg"}