{"id":"19","title":"Sausage burritos with pea and avocado guacamole","difficulty":"Easy","portion":"Makes 4 large or 6 smaller burritos","time":"Hands-on time 30 min","description":"Shake up your routine and fill your next burritos with pork sausages and a twist on guacamole made with peas and avocados.","ingredients":["2 tsp olive oil","454g pack sausages, skins removed","3 tbsp Mexican spice mix (or use fajita seasoning)","1 red onion, sliced","2 mixed peppers, sliced – we used red and orange","198g tin sweetcorn, drained","2 avocados, roughly chopped","100g frozen peas, cooked","Juice 1 lime","4 large or 6 small tortilla wraps","2 x 250g pouches cooked basmati rice","125g mature cheddar, grated","Handful fresh coriander","Microwave","Compostable baking paper"],"method":[{"Step 1":"Heat 1 tsp of the oil in a large frying pan. Add the sausages and cook for 9-10 minutes until cooked through, breaking into small chunks with a wooden spoon. Add the spice mix and fry for 1 minute more, then remove with a slotted spoon."},{"Step 2":"Heat the remaining 1 tsp oil in the same pan and fry the onion and peppers for 5 minutes. Stir in the corn and fry for another 2 minutes."},{"Step 3":"Put the avocados, peas, lime juice and some salt and pepper in a mini blender and whizz until smooth – or mash with a fork for a chunkier texture."},{"Step 4":"Warm the tortillas and rice in the microwave according to the pack instructions, then set each tortilla on a square of baking paper. Divide the grated cheese, veg mixture, sausage and most of the coriander and hot rice among the tortillas. Add a dollop of guacamole, then roll up each tortilla and secure with the baking paper."},{"Step 5":"Heat a dry frying pan and add the burritos in their wrappers. Gently press down the burritos and cook for 2-3 minutes on each side until you can see through the paper that the tortilla is golden. Slice in half and serve with the remaining guacamole and coriander."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/19.jpg"}