{"id":"10","title":"Venison tacos with grilled spring onions and peanut salsa","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min, plus resting. Oven time 8-10 min.","description":"Dish up gourmet tacos at home with our recipe for venison tacos with grilled spring onions. Spoon the moreish Mexican peanut salsa on top and scatter with crumbled feta to serve.","ingredients":["2 venison steaks (about 250g each; or use British beef steaks)","1 tbsp ground nut or veg oil","2 bunches spring onions","Tortillas, 100g crumbled feta, chopped coriander and lime wedges to serve","250ml groundnut/veg oil","6-8 dried Mexican chillies (we used ancho, guajillo and chipotle; see Know How), seeds and stems removed, torn","4 large garlic cloves, sliced","50g raw blanched peanuts","1 tbsp sesame seeds","2 tsp apple cider vinegar or white wine vinegar","1 tsp dark brown sugar"],"method":[{"Step 1":"Rub the venison with half the oil, season on both sides with salt, then set aside."},{"Step 2":"For the salsa, heat the oil in a small pan over a low-medium heat. Add the chillies and fry for 6-8 minutes until a little puffed, toasted and smelling fragrant. Put the chillies in a bowl, leaving the oil behind. Add the garlic to the oil and cook, stirring often, until crisp and light golden, then remove with a slotted spoon and add to the chillies. Add the peanuts and sesame seeds to the oil and fry for 5 minutes until lightly toasted, then stir in the vinegar and sugar and return the chillies and garlic to the pan. Set the pan aside to cool for 15 minutes, then whizz the contents in a food processor until everything is finely chopped. Taste and season with salt."},{"Step 3":"Heat the oven to 160ºC fan/gas 4. Heat an ovenproof frying pan over a high heat, cook the venison for 2-3 minutes on each side until browned, then transfer to the oven and cook for 8-10 minutes for medium-rare. Put on a plate to rest in a warm place (take care with the hot handle)."},{"Step 4":"Wipe out the pan and return to a high heat. Toss the spring onions with the remaining oil, then cook for 3-4 minutes, turning occasionally, until charred and tender. Set aside to cool slightly, then chop or leave whole."},{"Step 5":"Warm the tortillas according to the packet instructions. Thinly slice the venison and toss with any resting juices. Serve with the warm tortillas and the spring onions for everyone to assemble into tacos topped with crumbled feta, peanut salsa, chopped coriander and a squeeze of lime."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/10.jpg"}