{"id":"57","title":"Mexican fish tacos","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 45 min","description":"Serve all the elements of these fish tacos in separate bowls for a sharing-style family dinner. The cooling guacamole nicely complements the heat from the spice rubbed cod – making it easy to tailor the dish to your taste.","ingredients":["800g sustainable cod fillets, cut into 3cm pieces","About 100g coarse salt","Splash rapeseed or olive oil","12 corn tortillas","Soured cream to serve","½ tsp cayenne pepper","1 tsp smoked paprika","½ tsp garlic powder","1 tsp ground cumin","1 tsp dried oregano","3 tbsp plain flour","½ red onion, finely chopped","1 red chilli, finely chopped","3 very ripe avocados","1 garlic clove, crushed","Juice 1-2 limes","Bunch fresh coriander, chopped","200g cherry tomatoes, quartered","Large bunch each fresh flatleaf parsley, basil and mint, chopped","3 tbsp red wine vinegar","3 tbsp olive oil","1 tbsp caster sugar","2 little gem lettuces, leaves torn","½ red onion, very thinly sliced"],"method":[{"Step 1":"Put the cod fillets onto a plate and cover with the salt. Leave for 15 minutes or so, then rinse off the salt using plenty of cold water and thoroughly pat the fish fillets dry with kitchen paper. Slice the fish into 3cm pieces and put into a bowl."},{"Step 2":"Mix all the spice rub ingredients together in a small bowl, then sprinkle over the cod and turn the fillets to coat evenly."},{"Step 3":"Put the guacamole ingredients into a mini chopper with salt and pepper, whizz to a rough paste and set aside. (Or mash the avocado in a bowl, then stir in the remaining ingredients and seasoning.) Toss together the salad ingredients and season well."},{"Step 4":"Heat a frying pan with a splash of oil. When the pan is really hot, add the fish and fry for 2-3 minutes. Turn the fish carefully, trying not to break it up too much (it will need 4-5 minutes in total), remove and set aside. Add the tortillas and fry for a minute on each side to warm. (If you have a gas hob, lightly char the tortillas in the flame using tongs.)"},{"Step 5":"Layer the fish, guacamole, salad and soured cream in the wraps to serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/57.jpg"}