{"id":"5","title":"Pork tacos with sweetcorn and feta","difficulty":"Easy","portion":"Serves 2-3","time":"Hands-on time 25 min, plus marinating","description":"Grill marinated chops on the barbecue to make these delicious pork tacos. Load charred tortillas with pork, chillies, herbs and crumbled feta.","ingredients":["2 bone-in free-range pork chops","3 tbsp olive oil","2 large corn-on-the-cobs","6 fresh jalapeño chillies","2 limes, halved","2 tsp coriander seeds","2 tsp cumin seeds","2 garlic cloves, bashed","4 tbsp cider vinegar","1 tsp brown sugar","Small bunch coriander, leaves and stalks finely chopped","6 small wheat or corn tortillas and crumbled feta to serve"," Digital thermometer"],"method":[{"Step 1":"Prepare the barbecue for direct heat (for cooking right over the coals; or see alternative cooking instructions in tips). Pat the pork chops dry, then rub with 1 tbsp oil and season well with salt. Grill the chops, corn and chillies (turning them all) until the corn and chillies are lightly charred and the pork is cooked through to your liking (they should read 63°C or over on a probe thermometer). Cook the limes cut-side down for 1-2 minutes until caramelised."},{"Step 2":"Toast the coriander and cumin seeds in a hot dry pan for about 1 minute until fragrant. Lightly crush in a pestle and mortar, then mix in a shallow dish with the garlic, vinegar, sugar and coriander stalks. Roughly chop 3 of the charred jalapeños and add to the marinade with the remaining 2 tbsp oil. Add the cooked chops, turning to coat, then set aside for 10 minutes."},{"Step 3":"Remove the pork from the marinade, cut off the bone, then slice and toss back through the marinade (this is known as a reverse marinade – a quick way of adding more flavour). Slice the kernels from the cobs and mix with the coriander leaves, the juice from half a lime and some seasoning. Briefly toast the tortillas on the barbecue (or in a pan) until slightly charred but still flexible, then pile on the pork and corn. Crumble feta over and drizzle with the remaining marinade. Serve with the rest of the charred chillies and limes."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/5.jpg"}