{"id":"108","title":"Chilli con carne with avocado and chilli salsa","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 45 min, simmering time 3 hours 20 min, plus overnight soaking.","description":"Debbie Major’s chilli con carne with avocado and chilli salsa is about depth and flavour as well as heat.","ingredients":["175g dried black beans, soaked overnight, then drained","1 large dried chipotle chilli or 1 tbsp chipotle chilli paste (from the world food aisle of large supermarkets or coolchile.co.uk)","4 tbsp sunflower oil","1kg British chuck or blade steak, cut into 2.5cm chunks","1 large onion, chopped","4 garlic cloves, crushed","2 tsp chilli flakes","1 fresh red habanero chilli or 2 fresh green jalapeño chillies, deseeded and chopped","2 tsp freshly ground cumin seeds","1 tbsp paprika","1 tsp medium-hot chilli powder","200g chopped skinned tomatoes, fresh or from a tin","2 tsp light muscovado sugar","600ml fresh beef stock","1 tsp dried oregano","4 fresh bay leaves","100ml soured cream to serve","3 medium vine tomatoes, skinned, deseeded and diced","2 small ripe avocados, diced","½ red onion, finely chopped","1 fresh jalapeño chilli, deseeded and finely chopped","10g fresh coriander leaves, coarsely chopped, plus extra to serve","Juice ½ lime","2 shakes Tabasco sauce"],"method":[{"Step 1":"Put the soaked black beans in a medium saucepan and cover with cold water. Boil vigorously for 10 minutes, then reduce the heat to low, cover and simmer for 45-50 minutes until tender. Drain."},{"Step 2":"Meanwhile, remove and discard the stalk and seeds from the dried chipotle chilli, if using, then put in a small bowl and cover with boiling water. Leave to soak for at least 30 minutes, then scrape out and chop the flesh (discard the skin)."},{"Step 3":"Heat 2 tbsp of the oil in a large, heavy-based flameproof casserole. Brown the meat in batches over a high heat until well coloured all over, then transfer to a plate."},{"Step 4":"Add the remaining oil and the onion to the casserole. Cover and cook gently for 10 minutes or until the onion is soft and nicely browned, stirring now and then."},{"Step 5":"Add the chopped chipotle/chipotle paste to the casserole with the garlic, chilli flakes, habanero/jalapeños, cumin, paprika and chilli powder. Fry over a medium heat for 1 minute."},{"Step 6":"Return the meat to the pan with the chopped tomatoes, sugar, stock, oregano and bay leaves. Season lightly, bring to the boil, then reduce to a gentle simmer and cook, covered, for 2 hours."},{"Step 7":"Add the cooked black beans to the casserole and simmer for a further 20-30 minutes until the meat is tender (see tip)."},{"Step 8":"When ready to serve, mix all the salsa ingredients in a medium bowl and season to taste with a little salt. Taste and adjust the seasoning of the chilli con carne if necessary, then divide among bowls. Drizzle with a little soured cream, spoon over a little of the salsa and garnish with chopped coriander. Serve with steamed rice or warm flour tortillas, if you like, with the rest of the salsa and soured cream on the side."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/108.jpg"}