{"id":"104","title":"Vegetarian chilli","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 20 min, simmering time 20 min, plus soaking and boiling of beans","description":"This is a cross between a Mexican mole and a veggie chilli recipe. Strong, dark chocolate adds richness while walnuts add crunch.","ingredients":["2 tbsp coconut oil or extra-virgin olive oil, or ghee (clarified butter)","1 large onion, finely chopped","2 garlic cloves, finely chopped","2 tsp cumin seeds or 1 tsp ground cumin","1 fresh chilli (more if you like it hot), deseeded and finely chopped","1 tsp paprika","1 tsp dried oregano","2 carrots, finely chopped","150g frozen sweetcorn, defrosted","3 large celery sticks (we used the leaves too), finely chopped","150g walnuts, very finely chopped","300g dried mixed beans, such as kidney, black and adzuki, black eye or borlotti, soaked in cold water overnight, then boiled in fresh water for 40-50 minutes until tender (or 3 x 400g cans cooked mixed pulses, drained)","2 x 400g tins tomatoes","2 tsp sea salt","60g strong dark chocolate (at least 80 per cent cocoa solids), roughly chopped","120ml natural yogurt","Large handful fresh coriander, leaves picked 4 corn tortillas, toasted over a naked gas flame or in a dry pan"],"method":[{"Step 1":"Heat the oil or ghee in a large, heavy-based saucepan or casserole over a medium heat. Add the onion, garlic, cumin, chilli, paprika and oregano, then cook for 2 minutes, stirring occasionally, until the spices smell fragrant and the onion is slightly softened but not browned."},{"Step 2":"Add the carrots, corn and celery, then cook for another 2 minutes. Add the walnuts, beans, tomatoes, 250ml water (see tip) and sea salt, bring to the boil, then turn down the heat and simmer for 20 minutes."},{"Step 3":"Add the chocolate, stir in carefully and cook for another 2 minutes."},{"Step 4":"Taste and season with salt and pepper. Serve in bowls, garnished with yogurt and coriander, with toasted tortillas on the side."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/104.jpg"}