{"id":"92","title":"Tres leches cake with white russian syrup","difficulty":"Medium","portion":"Serves 9-12","time":"Hands-on time 45 min, oven time 30-35 min","description":"A classic cake that you can find in Mexico, central and south America – but this time combined with the flavours of a white russian cocktail. It’s a great recipe to add to your dinner party repertoire.","ingredients":[" Sunflower oil or butter for greasing","4 medium free-range eggs","125g caster sugar","100g unsalted butter, melted","100g plain flour","Coffee beans to serve","Cocoa powder for dusting","170g can evaporated milk","150ml condensed milk","180ml whole milk (we like a creamy milk such as gold top)","30ml vodka","70ml Kahlúa","200ml double cream"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/ gas 4. Lightly oil or grease a 20cm square cake tin and line the bottom with baking paper (see tip). Separate the eggs, putting the whites in a large mixing bowl with the sugar. Whisk with an electric mixer to stiff peaks (about 4-5 minutes), then whisk in the yolks. Using a metal spoon, fold in the melted butter and finally the flour with a pinch of salt, taking care not to knock the air out of the mixture."},{"Step 2":"Gently pour the batter into the lined tin, then bake in the middle of the oven for 30-35 minutes until the cake is risen, golden and springy to the touch. Remove from the oven."},{"Step 3":"Mix all the ingredients for the syrup, apart from the double cream, in a bowl. When the cake is still warm, leave it in its tin and gently poke holes all over it with a skewer. Spoon over half the syrup slowly, letting it sink in before continuing (reserve the rest of the syrup in the fridge). Leave the cake to cool completely in the tin, then cover with cling film and leave to stand for at least 1 hour or overnight."},{"Step 4":"When ready to serve, mix the rest of the chilled syrup with the cream and divide among deep plates or shallow bowls. Remove the cake from the tin and slice into squares, then sit the squares in the cream mixture. Scatter with the coffee beans and dust with cocoa powder, then serve immediately."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/92.jpg"}