{"id":"132","title":"A real Mexican chilli","difficulty":"Easy","portion":"for 6 people","time":"Takes 30 minutes to make, 2 hours 45 minutes to cook","description":"The joy of a real Mexican chilli recipe is in its use of proper chunks of meat, which have bags more flavour and, thanks to slow cooking, melt in the mouth.","ingredients":["3-4 tbsp lard or olive oil","About 1.4kg pork shoulder, skin removed, diced into 4cm cubes","1 large onion, roughly chopped, plus another half","4 cloves (optional)","4 courgettes, diced into 2cm cubes","2 corn cobs, sliced into 5 rounds each","6 dried ancho chillies","4 medium tomatoes","3 garlic cloves, roughly chopped","1 tsp ground cumin","Handful fresh thyme leaves","2 tbsp chipotles en adobo","1 tbsp cider vinegar","1 heaped tsp dried oregano","Soured cream to serve"],"method":[{"Step 1":"Heat a large casserole over a high heat and, when it is smoking hot, add 1 tbsp lard or olive oil (I always have a pot of lard in my fridge from cooking bacon and joints). After 1 minute, add half the pork pieces and brown on all sides for 1-2 minutes. Remove to a plate and brown the rest of the meat, adding a little more fat if necessary."},{"Step 2":"Put the pork back in the pan, cover generously with cold water and add the onion half, studded with the cloves if you’re using them. Bring the liquid to the boil and immediately turn the heat right down until bubbles just break the surface. Poach the meat for 1½-2 hours. This gentle cooking will result in a tender and succulent chilli. Add the diced courgette and sliced corn cobs 20 minutes before the end of the cooking time."},{"Step 3":"Meanwhile, tear open the ancho chillies, then discard the seeds and stems. Toast the ancho chillies for 20-30 seconds in a hot, dry frying pan until the skin starts to soften and release a wonderful smell. Cover in boiling water and soak for 15 minutes until soft. In another saucepan, cover the tomatoes in boiling water for 30 seconds, then drain. When cool enough to handle, peel and roughly chop. Whizz the ancho chillies together with the chopped onion, garlic, cumin, thyme leaves, chipotles, vinegar and oregano in a blender or food processor. Add the tomato and a small ladle of the pork stock (once the pork has finished cooking) to loosen the chilli paste. Season well."},{"Step 4":"When the pork and vegetables are tender, drain the stock and reserve. Keep the pork and vegetables warm in a bowl. Return the casserole to a high heat and add the remaining lard or olive oil. When hot, add the chilli paste (be careful, it will spit), turn the heat down and stir briskly. "},{"Step 5":"After you have stirred it for a few minutes, add a ladle of the pork stock and keep stirring. Add another 300ml pork stock and bubble for about 15 minutes until you have a lovely thick sauce. Add the pork and vegetables back into the sauce for 4-5 minutes, stir well and serve the chilli over the Mexican rice. Serve with soured cream, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/132.jpg"}