{"id":"42","title":"Mexican-style pork carnitas","difficulty":"Easy","portion":"Serves 8-12","time":"Hands-on time 1 hr 10 min, soaking time 20 min, oven time 2½-3 hours","description":"Sue Quinn’s recipe for these Mexican-style pork carnitas is taken from her cookbook Cocoa (Quadrille £25). ","ingredients":["2 whole ancho chillies","2 whole guajillo chillies","2 tsp cumin seeds","2 tsp fennel seeds","2kg boneless pork shoulder, cut into fist-sized chunks, about 8cm / 3¼in","2 tbsp flaked sea salt","4 tbsp pork fat, lard or dripping (olive oil is fine), plus extra if needed","2 large white onions, chopped","6 garlic cloves, finely chopped","2 tsp hot chilli powder","1½ tbsp dried oregano","2 medium ripe tomatoes, chopped","1 Tbsp chipotle chilli flakes or 1 chipotle chilli in adobo sauce","2 litres diluted beef stock","6 bay leaves","1 tbsp red wine vinegar","30g dark chocolate (100% cocoa solids or as high a percentage as you can find), grated","Salt and freshly ground black pepper (optional)","Guacamole, rice or soft bread rolls, chopped tomato salsa, pickled vegetables, to serve"],"method":[{"Step 1":"Preheat the oven to 170°C / 340°F / Gas mark 3. Cut the whole chillies in half with scissors, discard the stalks and white veins, and collect the seeds. In a dry frying pan, fry the seeds until dark brown, almost burnt, then transfer to a spice or coffee grinder or small food processor. Set the whole chillies aside."},{"Step 2":"Add the cumin and fennel seeds to the frying pan and fry until toasted and fragrant. Add to the chilli seeds in the spice grinder and blitz to a powder. Set aside. Add the reserved whole chillies to the frying pan and fry until the skin is blistered, turning them over frequently. Transfer to a heatproof bowl, cover with boiling water (at least 200ml) and set aside for 20 minutes."},{"Step 3":"Meanwhile, pat the pork pieces dry and rub with the salt. Melt the fat in a large heavy casserole over a medium-high heat and fry the pork until golden brown all over. You will have to do this in batches, so transfer to a bowl as you go and add more fat if the pan becomes dry. Set the meat aside."},{"Step 4":"Add the onions to the pan, along with 1 tablespoon more of the fat if needed, then reduce the heat to low and fry gently until very soft, about 15 minutes. Add the garlic and cook for a few minutes more."},{"Step 5":"Add the reserved ground spices and chilli seeds to the onions, along with the chilli powder, oregano and tomatoes. Cook, stirring, over a medium heat for a few minutes until everything is amalgamated and the tomatoes have cooked down a little."},{"Step 6":"Drain the soaked chillies through a sieve [strainer], reserving the soaking liquid. Transfer to a food processor along with the chipotle chilli flakes (or chilli plus 1 tablespoon of the adobo sauce, if using) and 200ml of the chillies soaking liquid and blitz to a smooth paste. Add this to the onions and fry gently for 5 minutes."},{"Step 7":"Transfer the onion mixture to a large baking tray that has sides 7cm deep, add the meat and enough of the stock to almost cover – you want about 1cm to poke above the liquid. Tuck in the bay leaves so they are submerged. Set the tray on the hob and bring to the boil, skimming off any scum or fat. Cover tightly with foil and transfer to the oven. Cook for 2½–3 hours until the meat is very soft and can be pulled apart with forks. The top of the meat will have a dark crust and the liquid should be bubbling and a little reduced."},{"Step 8":"Scoop the meat out of the sauce onto a large serving plate and shred with 2 forks, adding a little of the sauce from the baking tray to moisten. Set the baking tray on the hob over a medium heat, or pour the sauce into a pan and simmer until reduced and thickened to your liking. Add the vinegar and grated chocolate and simmer for a few more minutes. Taste and add more vinegar, chocolate or salt and pepper."},{"Step 9":"Pour some of the sauce over the pork and take to the table. Serve the remaining sauce in a jug on the side for guests to help themselves, along with guacamole, rice or soft bread rolls, chopped tomato salsa and pickled vegetables."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/42.jpg"}