{"id":"8","title":"Chilaquiles with fresh tomatillo salsa","difficulty":"Medium","portion":"Serves 4","time":"Hands-on time 25 min, simmering time 10 min ","description":"Thomasina Miers’ vegetarian chilaquiles is her take on one of Mexico’s most treasured recipes. Serve for breakfast with a fried egg, ricotta or refried beans and plenty of salsa.","ingredients":["200g leftover tortillas or good quality plain tortilla chips","2 tbsp olive oil, plus extra for frying the tortillas (optional)","300g fresh tomatillos or 350g tinned (see Know How for stockists or use green tomatoes instead)","1 onion, cut into 8 wedges","3 garlic cloves, unpeeled","1 jalapeño chilli, de-stemmed","25g coriander, leaves and stalks","1 tbsp caster sugar","1½ tsp salt","500ml vegetable stock or water","Juice ½ lime","4 fried eggs","Sliced avocado","Soured cream","A few handfuls coriander leaves","Feta or lancashire cheese","Finely chopped red onion or quick-pickled onions"],"method":[{"Step 1":"If using up tortillas, cut them into triangles, pour a few tbsp of oil into a pan over a medium-high heat and shallow-fry until you have crisp tortilla chips. Set aside."},{"Step 2":"If you have fresh tomatillos, remove their husks and wipe with a damp cloth. Put a large frying pan over a medium-high heat and toast the onion, garlic, jalapeño and tomatillos. Shake and turn frequently until charred over and tender in the middle (6-7 minutes for the garlic and chilli and a little longer for the onion and tomatillos). When cool enough to handle, peel the garlic, then transfer to a blender/food processor along with the other charred ingredients, the coriander, sugar and salt. If you’re using tinned tomatillos, add them at this point. Whizz to a purée."},{"Step 3":"Warm the 2 tbsp oil in a pan over a medium heat and pour in the sauce. Fry, stirring, for 2-3 minutes until it darkens slightly. Pour in the veg stock or water and bring to a simmer. Add the lime juice and tortilla chips, then toss gently in the sauce for just long enough for some of them to soften. Taste and season if needs be, then remove from the heat and transfer to shallow bowls. Top with any serving suggestions or sides that you fancy."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/8.jpg"}