{"id":"110","title":"Mojito tin-can cupcakes","difficulty":"Easy","portion":"Makes 6 cakes","time":"Hands-on time 25 min, oven/simmering time 30 min","description":"These tin-can cupcakes, made with rum, fresh mint and lime, are perfect for taking with you on an adult picnic.","ingredients":["125g unsalted butter, softened","200g caster sugar","3 medium free-range eggs","200g self-raising flour","50g polenta or cornmeal","100g dark chocolate chunks","Zest and juice 2 unwaxed limes","75g crème fraîche","1 pinch fine sea salt","25g granulated sugar","Juice 2 limes","Handful fresh mint leaves","200g light muscovado sugar","200ml water","200ml rum","20g butter"],"method":[{"Step 1":"Heat the oven to 170°C/fan150°C/gas 3 1/2. In a mixing bowl or using a stand mixer, beat the butter and caster sugar until pale and fluffy."},{"Step 2":"Add the eggs one at a time, beating well after each addition. Fold in the flour, polenta/cornmeal, chocolate, lime zest and juice, crème fraîche and sea salt."},{"Step 3":"Spoon the mixture into 6 small tins (see tip) on a baking sheet. Bake for 25-30 minutes until a skewer pushed into the centre comes out clean."},{"Step 4":"Meanwhile, make the mint drizzle. In a small pan, dissolve the sugar in the lime juice, then mix in the mint leaves to infuse."},{"Step 5":"Once baked, spoon the mint drizzle over the cakes and set aside to cool."},{"Step 6":"For the rum caramel, bring the muscovado sugar and water to the boil in a small pan. Boil without stirring until the syrup turns into a golden caramel. Remove from the heat and carefully add in the rum and butter. The caramel may spit and sputter, so stand well back. Return to the heat and bubble for a few more minutes until you have a glossy, thick, pourable caramel."},{"Step 7":"Tie string around each tin to make a handle, then cover with baking paper, tie loosely with string to keep the paper on. Put the warm rum caramel in a vacuum flask and take it to your picnic, so you can spoon it over the cakes as you gobble them up with a teaspoon."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/110.jpg"}