{"id":"155","title":"Spicy steak and black bean chilli","difficulty":"Easy","portion":"Serves 4","time":"Ready in 2½ hours","description":"Try this slow-cooked steak and black bean chilli recipe served with rice, tortillas or even chips. It’s the ultimate in comfort food.","ingredients":["175g dried black beans, soaked overnight","2 tbsp sunflower oil","700g lean braising steak, cut into 2.5cm chunks","1 large onion, chopped","15g dried red chillies, such as Kashmiri, soaked overnight","6 garlic cloves, crushed","2 green jalapeño chillies, deseeded and roughly chopped","2 tsp ground cumin","1 tbsp sweet paprika","200g can chopped tomatoes","¼ tsp dried oregano","4 tbsp natural yogurt","2 tomatoes, deseeded and finely diced","1 fresh red chilli, deseeded and chopped","15g fresh coriander, coarsely chopped"],"method":[{"Step 1":"Drain the black beans, put into a pan and cover with cold water. Boil vigorously for 10 minutes, then lower the heat, cover and simmer for another 20 minutes or until just tender. Drain and set aside."},{"Step 2":"Meanwhile, heat 1 tablespoon oil in a large casserole. Brown the meat in 2 batches over a high heat. Lift onto a plate lined with kitchen paper and set aside. Add the remaining oil and the onion to the pan and cook for 5-6 minutes, until browned."},{"Step 3":"Drain the red chillies, reserving the soaking liquid, and remove and discard the stalks and seeds. Put into a mini food processor with the garlic, green chillies, cumin, paprika and 4 tablespoons of the chilli soaking liquid, then blend to a smooth paste. Add the chilli paste to the onions and fry over a medium heat for 1 minute."},{"Step 4":"Return the beef to the pan with the chopped tomatoes, 600ml water and the oregano. Bring to the boil, cover and simmer gently for 2 hours, until the beef is tender. Stir in the beans and cook for a further 5 minutes."},{"Step 5":"To make the salsa, mix the diced tomato, chilli and coriander. Season the chilli to taste and serve with cooked brown rice, a spoonful of yogurt and some of the salsa."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/155.jpg"}