{"id":"13","title":"Mexican-style barbecued beef brisket with quick-pickled onions","difficulty":"Medium","portion":"Serves 6-8","time":"Hands-on time 45 min, oven time 5½ hours, grill/barbecue time 10 min, plus marinating","description":"Beef brisket can be a tough joint, but this recipe guarantees fall-apart-tender meat with a Mexican flavour that will make your taste buds sit up and take notice.","ingredients":["2 tbsp vegetable oil","1 red onion, chopped","4 garlic cloves, crushed","1 tbsp ground cumin","1 tbsp ground coriander","1-2 green or yellow jalapeños, sliced","2 tbsp chipotle paste","6 tbsp dark muscovado sugar","2.25kg British beef brisket","3 dried cascabel chillies (available from Waitrose, Ocado or online from Souschef)","500ml good quality beef stock","250ml fruity red wine","200ml fresh orange juice","200ml passata","2 red onions, thinly sliced","Juice 3 limes","1 tbsp sea salt","Large handful fresh coriander, roughly chopped","Sliced green or yellow jalapeños","2 ripe avocados, chopped","Juice ½ lime, plus extra wedges","Steamed rice or warm tortillas"],"method":[{"Step 1":"Heat the oil in a large, deep frying pan. Add the chopped onion and fry for 5 minutes or until beginning to colour. Stir in the garlic, cumin, coriander, jalapeños, chipotle paste and sugar, season generously with salt and pepper, then cook for 1 minute more. Remove from the heat and allow to cool. If you like a smooth consistency, whizz in a mini food processor or pound in a pestle and mortar (optional)."},{"Step 2":"Rub the cooled onion and spice marinade all over the brisket, then transfer to a large food bag with any leftover marinade. Marinate for at least 2 hours or ideally overnight in the fridge (see Make Ahead). "},{"Step 3":"Meanwhile, for the pickled onions, toss the sliced onions with the lime juice and salt in a glass bowl, then leave for at least 2 hours until they’ve turned pink. "},{"Step 4":"Put the dried chillies, stock, wine, orange juice and passata in a large jug and stir until well combined."},{"Step 5":"Once ready to slow-cook, heat the oven to 140°C/120°C fan/gas 1. Put the brisket and any marinade from the bag in a large, deep roasting tin and pour over the stock mixture (including the chillies). Cover the meat with a layer of baking paper, then tightly cover the tin with 2 layers of foil, scrunching the edges to form a tight seal. Slow cook for 5-5½ hours, turning the meat over in the roasting tin halfway through the cooking time."},{"Step 6":"Once the brisket is fully tender (see tips) remove from the oven and set aside on a chopping board, loosely covered, to rest. Carefully pour the cooking liquid from the roasting tin into a saucepan and bubble over a high heat for 25-30 minutes to reduce to a sauce consistency. Taste and adjust the seasoning (see Make Ahead)."},{"Step 7":"Heat the grill to medium-high and cook for 5 minutes on each side, basting every 2 minutes with more sauce to give a charred sticky crust."},{"Step 8":"To serve, mix the coriander, jalapeños, avocados and lime juice in a bowl and serve alongside the brisket with the quick-pickled onions and steamed rice or warm tortillas."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/13.jpg"}