{"id":"38","title":"Fish and chip tacos with pea guacamole","difficulty":"Medium","portion":"Serves 4","time":"Hands-on time 20 min, oven time 20 min","description":"We’ve put an update on Friday fish and chips with these Mexican-inspired fish and chip tacos, complete with mushy pea guacamole and pickled red onions.","ingredients":["2 large maris piper potatoes, peeled and cut into matchsticks","Olive oil for frying and drizzling","1 red onion, sliced into thin half-moons","2 tbsp red wine vinegar","1 tsp sugar","150g fresh peas, blanched (or use defrosted frozen peas)","2 ripe avocados, flesh roughly chopped","1 garlic clove, crushed","1 lime, plus extra wedges to serve","Bunch fresh coriander, leaves picked","Splash olive oil","4 tbsp plain flour","2 tsp taco seasoning (we used Luchito brand)","4 x 150g skinless haddock fillets, pin-boned, each fillet cut into 4 chunky strips","4 corn tortillas","4 tbsp mayonnaise","1 tsp chipotle chilli paste"],"method":[{"Step 1":"Heat the oven to 220°C/200°C fan/gas 7. Toss the matchstick chips with olive oil to coat, then season well with salt and pepper. Spread out in a single layer on a baking tray lined with non-stick baking paper and bake in the oven for 20 minutes, tossing occasionally, until crisp and golden."},{"Step 2":"Put the red onion in a glass or ceramic bowl with the red wine vinegar, sugar and a pinch of salt. Toss well, then set aside."},{"Step 3":"For the pea guacamole, mash the peas with the avocado, garlic, juice ½ lime, a handful of coriander leaves and a splash of olive oil in a bowl, then season and set aside."},{"Step 4":"For the fish, put the plain flour on a large plate and mix with the taco seasoning. Toss the chunks of fish in the seasoned flour. Heat 1cm olive oil in a large, heavy-based frying pan. When hot, fry the fish, in 2 batches, for 3-4 minutes, turning once, until lightly golden all over and cooked through. Drain on kitchen paper."},{"Step 5":"Warm the tortillas in the hot oven for 1 minute, then transfer to a plate. In a small serving bowl, mix the mayonnaise with the chipotle paste and remaining juice ½ lime. Drain the red onions and put in a separate small serving bowl."},{"Step 6":"To serve, divide the pea guacamole, chips and fish among the tortillas. Drizzle over the chipotle mayonnaise, then top with the pickled onions and the reserved coriander leaves. Eat straightaway with extra lime wedges for squeezing over."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/38.jpg"}