{"id":"4","title":"Black bean and chicken burritos","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min","description":"Use leftover roast chicken to make these thrifty and delicious chicken burritos. These filling burritos are packed with black beans, rice and guacamole.","ingredients":["1 tbsp vegetable oil","Bunch spring onions, finely chopped","2 garlic cloves, finely chopped","1 tsp cumin seeds","400g tin black beans in water, rinsed and drained","2 tsp smoked paprika","100g cooked rice","1 large avocado","Juice 1 lime","1 red chilli, finely chopped","150g ripe cherry tomatoes, roughly chopped","Bunch fresh coriander, roughly chopped, reserving a few whole leaves to serve","4 large flour tortillas","125g cooked chicken, shredded","100g mild cheddar, grated","Hot sauce such as Tabasco or Cholula to serve (optional)"],"method":[{"Step 1":"Heat the oil in a frying pan, add the spring onions and cook for 3-4 minutes until beginning to soften. Stir in the garlic and cumin, cook for just a minute longer, then add the drained beans and paprika and cook for a further 3 minutes. Add a splash of water to the pan and, with a fork or potato masher, mash the beans until you have a coarse paste. Season to taste, then stir in the rice and remove from the heat."},{"Step 2":"Scoop the avocado into a bowl and mash well with a fork, adding the lime juice as you go. Stir in the chopped chilli, tomatoes and coriander, then season to taste."},{"Step 3":"Warm a flour tortilla in a dry frying pan over a medium heat. Put it on a chopping board, then spread a few tablespoons of the black bean and rice mixture in the centre. Spoon a quarter of the avocado mixture on top, then sprinkle on a quarter each of the chicken and the cheese and a few reserved coriander leaves. Roll up the tortilla tightly, tucking in the ends. Lay seam-side down on the chopping board, then prepare the other tortillas. Serve with hot sauce, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/4.jpg"}