{"id":"103","title":"Diana Henry’s Mexican chicken and pumpkin with pepita pesto","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min, oven time 40 min, plus marinating","description":"Diana Henry’s Mexican chicken recipe is marinated with fresh thyme, oregano, cumin and allspice before being roasted with pumpkin and served with a pumpkin seed pesto.","ingredients":["8 skin-on, bone-in British free-range chicken joints or thighs","1 tbsp soft light brown sugar","4 fresh thyme sprigs, leaves picked","3 tsp dried oregano","2 tsp ground cumin","2 tsp ground allspice","6 tbsp olive oil","Juice 1 lime","Juice ½ orange","900g well-flavoured pumpkin, peeled and cut into thick wedges (see tip)","60g feta, finely crumbled","20g pumpkin seeds","60g fresh coriander sprigs, plus extra to serve","20g unroasted cashew nuts","2 garlic cloves, chopped","Juice 1½ limes","125ml extra-virgin olive oil","1 red chilli, deseeded and finely chopped, plus extra to serve"],"method":[{"Step 1":"Put the chicken in a shallow glass or ceramic dish. Mix together the sugar, thyme, oregano, spices, 4 tbsp of the olive oil, both the citrus juices and some salt and pepper, then pour this marinade over the chicken. Turn the chicken pieces to coat well, then cover with cling film and marinate in the fridge for a couple of hours. Bring it to room temperature before you cook it."},{"Step 2":"For the pesto, put the pumpkin seeds in a dry frying pan and put over a medium heat. Stir for a couple of minutes, or until they turn a shade darker and smell a little toasted (this method also works for spice, seeds and nuts). Put in a food processor with all the other pesto ingredients except the chilli. Blend to a rough purée. Scrape into a bowl, stir in the chilli and set the pesto aside until you want to use it."},{"Step 3":"When ready to cook, heat the oven to 180C/fan160C/gas 4. Transfer the chicken, skin-side up, to a roasting tin or a large, shallow ovenproof dish – it should fit quite snugly. Dot the pumpkin wedges around the chicken. Brush the pumpkin with the remaining 2 tbsp oil and season. Put into the hot oven and roast for 40 minutes, basting every so often."},{"Step 4":"Check the chicken is cooked: if you stick the tip of a sharp knife into the underside of a thick joint, the juice that runs out should be clear with no trace of pink. Serve with some pesto spooned over (offer the rest on the side). Scatter with crumbled feta (see my recipe introduction) and extra coriander sprigs and chopped chilli, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/103.jpg"}