{"id":"90","title":"Spicy Mexican tortilla soup with avocado salsa","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 25min, simmering time 30 min, oven time 5 min","description":"A vegetarian soup recipe, full of Mexican flavour that makes best use of store cupboard ingredients; perfect for weeknight supper.","ingredients":["2 tbsp olive oil","1 large onion, finely chopped","2 garlic cloves, sliced","½ dried ancho chilli, soaked in boiling water for 15 minutes, then drained (see tips)","1 tsp sweet smoked Spanish paprika (pimentón)","1 tsp ground cumin","1 litre vegetable stock","2 x 400g tins chopped tomatoes","400g tin kidney beans, drained and rinsed","400g tin black beans, drained and rinsed","200g frozen sweetcorn","Soured cream and lime wedges to serve","3 soft flour tortillas","Olive oil to brush","2 ripe avocados","Extra-virgin olive oil to drizzle","Juice 2 limes","Small bunch fresh coriander, leaves picked and stems chopped","1 fresh jalapeño (or green) chilli, seeds removed, finely sliced"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/ gas 6. Heat the olive oil in a large, deep saucepan over a low-medium heat, then add the onion and garlic and cook gently, stirring now and then, for 8 minutes or until very soft. Split the ancho chilli open, scrape out the flesh inside (discard the skin) and add it to the pan with the paprika and cumin. Cook for 1-2 minutes until fragrant."},{"Step 2":"Add the vegetable stock and tinned tomatoes and bring to the boil, then cook for 15 minutes or until ￼￼the liquid has reduced slightly. Add the beans and sweetcorn and cook for 5 minutes more."},{"Step 3":"Meanwhile cut the tortillas into 8 small triangles and brush on both sides with a little olive oil. Lay the triangles in a single layer on a baking sheet, then toast in the oven for 4-6 minutes until golden and crisp – keep an eye on them as they can burn easily (there’s no need to turn them)."},{"Step 4":"For the salsa, cut the avocados into small cubes, put in a bowl, drizzle with the extra-virgin olive oil and squeeze over the lime juice. Add the coriander and chilli, then season well with salt and pepper and mix. 4 Serve the soup hot in bowls with the salsa, a dollop of soured cream and some tortilla chips, with extra lime wedges on the side."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/90.jpg"}