{"id":"70","title":"Smoked-lentil tacos with pico de gallo","difficulty":"Medium","portion":"Makes 6","time":"Hands-on time 35 min, simmering time 20 min, plus soaking","description":"”I haven’t eaten meat in a long time, but taking my first bite of these insanely tasty tacos made me feel as if I were. I used my secret weapons: tamari, sun-dried tomatoes and caramelised onions.” – Sarah Britton","ingredients":["250g cherry tomatoes, chopped","Small onion, very finely chopped","1 tsp very finely chopped red chilli","2 tbsp lime juice","Handful fresh coriander, chopped","210g dried green lentils, soaked and drained","1 tbsp coconut oil","3 small onions, sliced","1 tsp fine sea salt","1 large garlic clove, very finely chopped","35g sun-dried tomatoes, chopped","1 tsp hot smoked paprika","1½ tsp dried oregano","2 tsp tamari or soy sauce","300g finely shredded red cabbage","½ tsp fine sea salt, plus extra as needed","1½ tsp lime juice, plus wedges to serve","1 tbsp extra-virgin olive oil","1 tsp maple syrup, plus extra as needed","Handful chopped fresh flatleaf parsley or fresh coriander (leaves and tender stems), or a mixture","1 small red chilli, deseeded and sliced (leave the seeds in if you like more heat)","6 corn tortillas, warmed","1 ripe avocado, sliced","Hot sauce (optional)"],"method":[{"Step 1":"For the pico de gallo, combine the cherry tomatoes, onion, chilli, lime juice and coriander in a small bowl. Season with salt and set aside."},{"Step 2":"Next, cook the lentils. In a stockpot or large pan, cover the soaked lentils with water, bring to the boil, then reduce the heat to low and cook, covered, for about 20 minutes or until tender. Drain and rinse well."},{"Step 3":"Meanwhile, make the slaw. In a large bowl, combine the cabbage, salt and lime juice. Massage the cabbage with the mixture for about a minute until it begins to wilt. Drizzle with the olive oil and maple syrup. Season with more salt, as needed, and stir in the herbs and chilli."},{"Step 4":"Melt the coconut oil for the filling in a frying pan over a medium-high heat. Add the onions and salt, stir to coat, then cook for about 10 minutes or until the onions soften and begin to slightly caramelise."},{"Step 5":"Add the garlic, sun-dried tomatoes, paprika, oregano and tamari/soy sauce. Stir to coat, adding a little water if the pot is too dry. Cook for 2-3 minutes until fragrant, then add the cooked lentils and stir well. Taste and season with salt, if needed, then remove from the heat."},{"Step 6":"To assemble the tacos, divide the smoky lentil mixture among the tortillas, followed by the slaw and pico de gallo. Add the avocado, then some hot sauce, if you like. Serve with lime wedges to squeeze over."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/70.jpg"}