{"id":"12","title":"Turkey pozole","difficulty":"Easy","portion":"Serves 4-5","time":"Hands-on time 25 min, plus simmering time 35 min ","description":"This delicious version of pozole, a hearty Mexican soup, uses leftover turkey in place of the traditional pork, and is made with pozole corn.","ingredients":["1.5 litres chicken or turkey stock (or 2 chicken stock cubes dissolved in 1.5 litres water)","1/2 small onion, peeled (use the other half for the salsa)","3 garlic cloves, peeled","400-500g shredded cooked turkey or chicken","500g tin pozole corn (hominy), rinsed (or a 400g tin chickpeas, rinsed)","1 tbsp dried oregano","2 bay leaves","1 tsp cumin"," 1/2 small onion (leave the skin on), cut into 2 wedges","1 garlic clove (leave the skin on)","2 ancho chillies, stalks and seeds removed (see Know How)","2 dried guajillo chillies, stalks and seeds removed (see Know How)","4 medium tomatoes, or a 400g tin plum tomatoes","1 tsp brown sugar","Half iceberg lettuce, shredded","Small onion, finely sliced","100g radishes, thinly sliced","3 corn or flour tortillas, sliced into strips and shallow fried until crisp (or use tortilla chips)","Handful coriander leaves, picked or finely chopped","Lime wedges for squeezing","Hot sauce and/or soured cream (optional)"],"method":[{"Step 1":"Put the stock, onion and garlic cloves in a saucepan over a medium-high heat and bring to the boil. Reduce the heat, then simmer for 20 minutes."},{"Step 2":"Meanwhile, make the salsa. Char the onion wedges, tomatoes (if you’re using fresh) and garlic in a dry pan for 6-8 minutes until blackened. Peel and set aside."},{"Step 3":"Put the chillies in a small pan, then cover with boiling water and simmer for 5 minutes until the skins are softened. Drain, then add to a blender or food processor with the charred onion and garlic, tomatoes, sugar, 250ml cold water and a large pinch of salt. Add the softened onion and garlic from the stock, then whizz until smooth."},{"Step 4":"Pour the salsa back into the pan, then simmer for 10 minutes until reduced by about half. Add the salsa to the stock, then add the shredded meat, pozole corn or chickpeas, dried oregano, bay, cumin, and some more seasoning. Simmer gently for 5 minutes until warmed through and the meat takes on the flavour of the broth."},{"Step 5":"Ladle the soup into bowls and garnish with lettuce, onion, radishes, fried tortilla strips, coriander and lime wedges. Serve with hot sauce and/or soured cream, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/12.jpg"}