{"id":"127","title":"Refried beans","difficulty":"Easy","portion":"Serves 6","time":"Hands on time 30 minutes, 2 hours 20 minutes cooking time, plus overnight soaking","description":"This traditional Mexican dish is the perfect accompaniment to fajitas and tacos, or with huevos rancheros for breakfast.","ingredients":["4 tbsp vegetable oil","2 medium onions, finely chopped","¼ tsp chilli flakes","350g dried pinto beans, soaked overnight in cold water","1½ tsp salt","200g smoked bacon lardons, chopped","4 garlic cloves, crushed","50g crumbled feta cheese or coarsely grated cheese, such as Cheddar or Manchego","Chopped fresh coriander to serve"],"method":[{"Step 1":"Heat 3 tbsp oil in a large pan or flameproof casserole, add half the onions and fry gently for 10 minutes until golden brown. Add the chilli flakes and fry for 1 minute. Drain and rinse the beans, then add to the pan and cover with 1 litre cold water. Bring to the boil, part-cover with a lid and simmer for 1¾-2 hours until the beans are tender. Stir regularly and top up with a little boiling hot water from the kettle if need be, to keep them just covered. Add the salt and simmer for 10 more minutes. Remove and set aside."},{"Step 2":"Heat the remaining oil in another pan or flameproof casserole over a medium heat, then add the bacon. Cook until it releases its fat, then increase the heat and cook until crisp and lightly golden. Remove with a slotted spoon and set aside."},{"Step 3":"3. Add the remaining onion to the bacon oil in the pan and fry for 10 minutes, stirring now and then, until golden. Stir in the garlic and cook for 2 minutes more. With a slotted spoon, add a quarter of the cooked beans, leaving most of the liquid behind. With a potato masher, mash the beans roughly into a very coarse purée. Add another portion of beans and repeat until you have used all the beans. Add a little of the cooking liquid if necessary until you have a thick, creamy paste (make them slightly wetter than you want; they will thicken up as they sit). Taste, then season with more salt if need be. Cover and set aside."},{"Step 4":"Spoon into a warmed serving bowl, then scatter with the bacon, cheese and coriander. (If serving with the huevos rancheros, you could scatter the crispy bacon lardons over those instead.) Serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/127.jpg"}