{"id":"167","title":"Chicken fajitas with tomato salsa","difficulty":"Easy","portion":"Serves 4","description":"Our straightforward, healthy chicken fajitas make a fabulous Friday night supper for friends or family. Or if you fancy something different, our beef fajitas are also a popular choice.","ingredients":["4 boneless, skinless chicken breasts","2 tbsp olive oil","2 tbsp fajita seasoning","1 red onion, chopped","2 garlic cloves, crushed","1 red pepper, deseeded and sliced","1 orange or yellow pepper, deseeded and sliced","8 soft flour tortillas","1 bunch spring onions","2 ripe beef tomatoes","½-1 tsp Tabasco","100ml tomato passata","1 tbsp malt or red wine vinegar"],"method":[{"Step 1":"Make the tomato salsa. Trim and discard the root ends of the spring onions, then chop the white and green parts of the onions and put into a bowl. Halve, slice and chop the tomatoes, then add to the bowl. Take care adding the Tabasco (it’s fiery) and stir in the passata and vinegar. Add a pinch of salt and some freshly ground black pepper. Set aside."},{"Step 2":"Put the chicken between 2 pieces of cling film and bash it with a frying pan to make it thinner – this will help it cook quicker. Cut the chicken into finger-size pieces. Heat the oil in a large frying pan for about 30 seconds, then push the chicken straight from the board into the pan. Sprinkle with the fajita seasoning, cook for 2 minutes, then turn the chicken over and cook for 2 more minutes to seal the meat. Turn the heat down to low and add the onion and garlic. Cook gently for 5 minutes, turning as needed, then add the peppers."},{"Step 3":"Put the flour tortillas onto a heatproof plate or an upturned lid the size of the frying pan, and rest on top of the frying pan. Cover with foil and cook for 10 more minutes until the tortillas are warm, the peppers are tender and the chicken is cooked through with no traces of pink. Remove from the heat, pile the chicken and salsa into warm tortillas, roll and fold to tuck in."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/167.jpg"}