{"id":"25","title":"Tex-Mex enchilada bake","difficulty":"Easy","portion":"Serves 4 (plus sauce to feed another 4)","time":"Hands-on time 25 min, cooking time 45 min","description":"Here’s a comforting enchiladas recipe to simplify weeknight dinner planning; this bubbling bake is bursting with flavour and will leave you feeling properly fed and satisfied – just what you want from a midweek meal.","ingredients":["Splash light olive oil 450g British free-range pork mince","450g British beef mince (5% fat)","2 onions, sliced ","1½ tbsp cumin seeds, roughly crushed","1-3 tbsp chipotle paste (to taste; we used the Gran Luchito brand, from large supermarkets)","2 x 400g cans chopped tomatoes","3 medium red peppers, sliced ","150g soured cream","4 large tortilla wraps ","1-2 handfuls grated mature cheddar cheese"],"method":[{"Step 1":"Heat the oil in a deep, heavy-based frying pan (with a lid) over a medium-high heat. Brown the mince, in 2 batches, stirring regularly until golden and crisp (around 7 minutes per batch). Remove the mince with a slotted spoon and set aside."},{"Step 2":"Turn the heat to medium and add the onions to the pan, stirring with a wooden spoon to dissolve any brown bits from the base. Cover and cook for 5 minutes, stirring now and again."},{"Step 3":"Add the cumin, cook for a minute, then add the chipotle paste, tomatoes and 175ml water. Stir well, bring to the boil, then simmer, uncovered, for 15 minutes. Return the mince to the pan, put the peppers on top, then cover with the lid. Cook for 10 minutes more until the peppers are tender, then season and stir the peppers into the sauce."},{"Step 4":"When ready to serve, heat the oven to 180°C/160°C fan/gas 4. Divide half the mince sauce equally among the 4 tortillas, roll up, then arrange in a baking dish (use one that just fits the wraps). Mix the soured cream with 1 tbsp cold water, then spoon over the top and scatter with the cheese (see tips). Bake for 20 minutes until golden and the cheese has melted."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/25.jpg"}