{"id":"49","title":"Real black bean chilli con carne with avocado and lime salsa","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 40 min, simmering time 3 hours (if cooking beans), plus soaking","description":"A real beef and black bean chilli con carne that’s slow-cooked until rich, thick and the meat easily falls apart. It’s proper, comforting sharing food that will feed hungry mouths, happily. If you like it hot, don’t shy away from adding extra Tabasco to the avocado salsa!","ingredients":["225g dried black beans, soaked overnight (see tip)","4 tbsp sunflower oil","1.5kg chuck steak, cut into 2.5cm chunks","1 large onion, chopped","5 garlic cloves, crushed","4 tsp chipotle chilli paste","3 jalapeño chillies, deseeded and finely chopped"," 1 tbsp toasted cumin seeds, ground","1 tbsp sweet paprika powder","1½ tsp medium chilli powder (optional)","400g can chopped tomatoes","800ml fresh beef stock","1 tbsp light muscovado sugar","2 tsp dried oregano","6 fresh bay leaves","Steamed white rice to serve","Soured cream to serve","Coarsely chopped fresh coriander or whole leaves to garnish","2 small ripe but firm avocados, peeled, stones discarded and the flesh cut into small dice","1 medium red onion, finely chopped","2 jalapeño chillies, deseeded and finely chopped","20g fresh coriander, coarsely chopped","Juice 1 lime","4 shakes Tabasco chipotle sauce"],"method":[{"Step 1":"Drain the black beans, put them in a pan and cover with cold water. Bring to the boil and boil vigorously for 10 minutes. Lower the heat, cover and cook for 45-50 minutes or until tender, adding 1 tsp salt 5 minutes before the end of cooking. Drain and set aside (see tip)."},{"Step 2":"Meanwhile heat 3 tbsp of the oil in a large flameproof casserole or non-stick pan. Brown the meat in batches over a high heat until well coloured all over. Lift onto a plate as each batch browns and set aside."},{"Step 3":"Add the remaining 1 tbsp oil and, when hot, add the onion and cook gently, stirring, for 10-15 minutes until soft and nicely caramelised. Add the garlic, chipotle paste, jalapeños, ground toasted cumin seeds, paprika and chilli powder, if using. Fry over a medium heat for 1 minute."},{"Step 4":"Return the beef to the pan with the chopped tomatoes, beef stock, sugar, dried oregano and bay leaves. Season lightly, part-cover, then simmer gently for 2½ hours. Add the cooked beans (see tip) to the pan and simmer, uncovered, fora further 20-30 minutes, stirring gently now and then so as not to break up the meat, until the liquid has reduced to a sauce and the beef is meltingly tender (see Get Ahead)."},{"Step 5":"To serve, mix the salsa ingredients in a bowl with a little salt to taste. Taste and adjust the seasoning of the chilli con carne, if necessary. Remove the bay leaves and serve on steamed white rice with soured cream and the salsa, garnished with the chopped fresh coriander."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/49.jpg"}