{"id":"21","title":"Slow-cooked chipotle chicken","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 25 min, oven time 2 hours","description":"Our slow-cooked chipotle chicken takes inspiration from great Mexican flavours to create an uncomplicated one-pot dinner. The star is the flavour of chipotle, which is a smoke-dried jalapeño chilli and a Mexican staple. Obviously we’ve thrown in guacamole for a side, because – well, who doesn’t like guacamole?","ingredients":["4 tbsp extra-virgin olive oil8 skinless, boneless free-range chicken thighs (about 1.4kg), halved2 red onions, cut into wedges2 red peppers, sliced4 garlic cloves, crushed2 tsp ground cumin2 tsp sweet smoked paprika2 tbsp chipotle paste (see Know-how)1 tbsp good-quality cocoa powder2 x 400g tins chopped tomatoes300ml chicken stock400g tin black beans or kidney beans, rinsed and drainedWarm tortillas, soured cream, coriander leaves and limewedges to serve","4 tbsp extra-virgin olive oil","8 skinless, boneless free-range chicken thighs (about 1.4kg), halved","2 red onions, cut into wedges","2 red peppers, sliced","4 garlic cloves, crushed","2 tsp ground cumin","2 tsp sweet smoked paprika","2 tbsp chipotle paste (see Know-how)","1 tbsp good-quality cocoa powder","2 x 400g tins chopped tomatoes","300ml chicken stock","400g tin black beans or kidney beans, rinsed and drained","Warm tortillas, soured cream, coriander leaves and limewedges to serve","3 avocados, peeled and choppedJuice 1-2 limes1 green chilli, seeds removed, chopped2 spring onions, choppedSmall handful chopped coriander","3 avocados, peeled and chopped","Juice 1-2 limes","1 green chilli, seeds removed, chopped","2 spring onions, chopped","Small handful chopped coriander"],"method":[{"Step 1":"Heat the oven to 170°C/150°C fan/gas 3½. Heat 2 tbsp of the oil in a hob safe casserole or large ovenproof sauté pan (you’ll need a lid) over a high heat, then fry the chicken in batches, turning often, for 3-4 minutes until browned all over. Remove and set aside."},{"Step 2":"Heat the remaining oil in the casserole/pan, then fry the onions and peppers for 2-3 minutes. Add the garlic, cumin, paprika, chipotle paste and cocoa, stirring to combine."},{"Step 3":"Return the chicken and any juices to the casserole, stir to coat, then add the chopped tomatoes and stock. Bring to a simmer, season with salt and pepper, then cover and cook in the oven for 1½ hours."},{"Step 4":"Add the beans to the stew and cook, uncovered, for 30 minutes more until the sauce has reduced and thickened."},{"Step 5":"Meanwhile, put all the guacamole ingredients in a food processor. Season with salt and pepper, add a little more lime juice to taste, then pulse until roughly chopped and combined but still with some texture. (Or mash everything together in a mixing bowl with a fork until as smooth as possible.)"},{"Step 6":"Serve the chicken on warm tortillas topped with guacamole, soured cream, coriander and a squeeze of lime."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/21.jpg"}