{"id":"35","title":"Jalapeño, bacon and crispy potato frittata","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 25 min, cooking time 40 min","description":"A great way to use up roast potatoes, our Mexican-inspired frittata – with salty bacon and warming chipotle mayo – will feed four for less than £6.","ingredients":["650g floury potatoes, such as maris piper, cut into 2-3cm chunks (see Make Ahead and tip)","3 tbsp light olive oil","1-3 fresh jalapeño chillies, finely sliced (see tip)","Finely grated zest and juice 1 large lime","8 large free-range eggs","4 spring onions, sliced","4 tbsp flavoured mayonnaise (we used Gran Luchito Chipotle Chilli Mayo)","Small handful fresh coriander, stalks and leaves chopped separately","175g streaky bacon, roughly chopped","1 small pointed cabbage (or spring greens), roughly chopped","90g cheddar or manchego, cut into small chunks"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. Put the potatoes in a pan of cold salted water, bring to the boil and cook for 6 minutes until just tender. Drain and leave to steam dry."},{"Step 2":"Heat the oil in a roasting tin, add the potatoes and season with salt. Roast for 20 minutes or until golden (see Make Ahead and tip)."},{"Step 3":"Meanwhile, put the chillies in a bowl with the lime zest and juice (see tip). Set aside for a few minutes to pickle."},{"Step 4":"In a jug, whisk together the eggs, spring onions, pickled jalapeños, mayonnaise and coriander stalks."},{"Step 5":"Heat a pan or shallow casserole (24-26cm wide across the top) over a medium heat. Add the bacon, fry for 3 minutes, then add the cabbage and cook for around 8 minutes more until softened and golden. Add the roast potatoes and mix well."},{"Step 6":"Heat the grill to medium-high. Pour the egg mixture into the pan and mix it in. Dot over the cheese and continue cooking on the hob for 5 minutes until just set at the edges. Transfer to the grill and cook for about 5 minutes until set but with a slight wobble. Sprinkle over the chopped coriander leaves to serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/35.jpg"}