{"id":"102","title":"Mexican mole rojo","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 1 hour 10 min, simmering time 45 min","description":"Valentine Warner’s traditional Mexican mole recipe – made with chicken, chillis, and nuts – balances sweetness with tanginess.","ingredients":["4 British free-range chicken legs","½ tsp dried oregano","3 bay leaves","6 peppercorns","1 tsp sea salt","5 ancho chillies (see Know how), deseeded, torn open","2 chipotle chillies (see Know how), deseeded, torn open","3 x 10cm corn tortillas, torn","75g lard or sunflower oil (plus a little more if needed)","50g blanched hazelnuts","50g walnuts","50g flaked almonds","40g sesame seeds","1 large onion, finely chopped","5 whole garlic cloves, peeled","2 tbsp finely chopped fresh coriander stalks","40g sultanas","50g dried apricots","2 star anise","5 cloves","1½ tsp cumin seeds","1 tsp ground black pepper","1 tsp ground cinnamon","½ tsp ground allspice","1-1.2 litres fresh chicken stock","2 tbsp tomato purée","Juice 1 large orange","1 generous tbsp muscovado sugar or dark clear honey","1 tbsp good quality cocoa powder (we like Green & Black’s)","2 tsp flaked sea salt","Steamed white rice","Toasted sesame seeds"],"method":[{"Step 1":"To make the sauce, put a large frying pan over a medium heat. When it’s fairly hot, press the inside faces of the torn-open chillies against the pan gently until they lighten a little in colour. (Don’t let them smoke and burn, otherwise they’ll taste bitter.) Put the chillies in a blender, then return the frying pan to the heat."},{"Step 2":"Put the torn corn tortillas in the pan and dry fry until deep golden brown then add to the blender."},{"Step 3":"Melt the lard or heat the oil in the frying pan and fry the hazelnuts and walnuts until deep golden, being careful not to burn them. Using a slotted spoon, transfer the nuts to the blender."},{"Step 4":"Fry the almonds with the sesame seeds until golden, then transfer to the blender using a slotted spoon."},{"Step 5":"Put the onion in the pan with the garlic, coriander, sultanas, dried apricots, star anise, cloves, cumin seeds, black pepper, cinnamon and allspice. Cook gently, stirring. Don’t rush this step; It will take 12-15 minutes until the onions and garlic are deep golden brown. Take care not to let the onions burn. Add the mixture to the blender."},{"Step 6":"Meanwhile, in a saucepan over a low heat, warm through the stock."},{"Step 7":"In the original frying pan, cook the tomato purée so it colours and catches a bit but doesn’t burn. Stir in the orange juice, then scrape into the blender."},{"Step 8":"Add the stock to the blender and whizz everything together until thoroughly smooth. If your blender is old, whizz in stages so you don’t overheat the motor. The blended mixture will be thick enough to stand a spoon in."},{"Step 9":"Transfer the mole to a pan, then add the sugar or honey and the cocoa powder. Cover with a lid, put over a low heat, then cook very gently for 45 minutes. The consistency should be only a fraction looser than thick natural yogurt. Stir in the salt. At this stage, you can cool and chill the sauce until needed, ideally overnight (see Make Ahead)."},{"Step 10":"While the mole cooks (unless you’ve made it in advance), fill a large pan with water and lower in the chicken legs so the water just covers them. Add the oregano, bay leaves, peppercorns and salt. Bring the water to a simmer, then poach the chicken for 30-40 minutes until the meat is tender but not yet falling from the bone."},{"Step 11":"Remove the skin from the chicken (discard) and put the legs on a warmed serving platter. Spoon or pour the hot mole sauce generously over the chicken. Scatter over some toasted sesame seeds and serve with steamed white rice."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/102.jpg"}