{"id":"79","title":"Fried kale with black bean chilli and guacamole","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 40 min","description":"Spice up your weekend with this Mexican-style brunch recipe. It’s quick, easy and full of nutritional ingredients that’ll keep you going for the whole day.","ingredients":["2 x 400g tins black beans, drained and rinsed","200ml hot vegetable stock","1-2 red chillies, deseeded and finely chopped","Good dollop of Greek yogurt, plus extra to serve","2 tbsp olive oil","200g curly kale","1 garlic clove, crushed","Splash of white wine vinegar (optional)","4 medium free-range eggs","75g grated cheddar","Hot chilli sauce (we like Lingham’s) or ketchup to serve","2 large ripe avocados","110g vine tomatoes, deseeded and roughly chopped","½-1 green chilli, deseeded and finely chopped","1-2 spring onions, finely sliced","Juice of 1-2 limes"],"method":[{"Step 1":"Put the black beans in a pan with the hot vegetable stock and half the red chillies, then cook for 20-25 minutes until almost broken down. Stir in the Greek yogurt and season well, then set aside."},{"Step 2":"Meanwhile, for the guacamole, peel, stone and mash the avocados with a fork until creamy but still a bit chunky. Stir in the tomatoes, green chilli and spring onions, then season with salt, pepper and the lime juice."},{"Step 3":"Heat the oil in a sauté pan over a medium heat and stir-fry the curly kale with the garlic, remaining red chilli and a splash of water for 10-12 minutes until tender. Season well."},{"Step 4":"Bring a pan of water to the boil, with a splash of vinegar if your eggs are not spanking fresh (see Know-how). One by one, carefully crack the eggs into the water. Take the pan off the heat and let the eggs cook for 3-4 minutes until the whites are just firm."},{"Step 5":"Divide the kale among 4 plates, scatter over the grated cheddar and top each portion with a poached egg. Serve with the guacamole, black bean chilli, yogurt and, if you like, ketchup or hot sauce."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/79.jpg"}