{"id":"17","title":"Margarita cheesecake with tequila strawberries","difficulty":"Easy","portion":"Serves 10","time":"Hands-on time 20 min, plus 4-6 hours setting/marinating time","description":"For a make-ahead cheesecake with a twist, try our incredible margarita cheesecake, with crushed pretzel base and boozy tequila strawberries on top.","ingredients":["140g pretzel thins (we like Olly’s Pretzels Salted Original)","2 tsp caster sugar","90g unsalted butter, melted","360g cream cheese","150g soured cream","100g icing sugar, sifted","Finely grated zest 1 lime","Finely grated zest ½ orange","150ml double cream","4 gelatine leaves, soaked in cold water for 10 minutes (we used Dr Oetker)","100g caster sugar","Juice 6 limes, strained","Juice 1 orange, strained","2 tbsp tequila","1 tbsp Grand Marnier, Cointreau or Triple Sec","100ml lime soda (we used Fever Tree Mexican lime soda)","300g strawberries, hulled and sliced","100g pure icing sugar, sifted","1-2 tbsp tequila","1 tbsp Grand Marnier, Cointreau or Triple Sec","Grated zest 1 lime","Grated zest ½ orange","Flaky salt to serve (optional)"],"method":[{"Step 1":"Put the pretzel thins and caster sugar in a food processor and whizz to fine crumbs. Pour in the melted butter and whizz again until the mixture comes together (it should hold its shape when scrunched together). Spoon into a 20cm loose-bottomed cake tin, then smooth the surface with the back of a spoon to level, pressing to compact a little. If you don’t have a food processor put the pretzels into a food bag and bash with a rolling pin, then mix in a bowl with the sugar and melted butter. Set aside in the fridge while you make the filling."},{"Step 2":"In a large mixing bowl beat together the cream cheese, soured cream, icing sugar, and zests until smooth. In another bowl, whip the cream to soft peaks, then gently fold it into the cream cheese mixture until combined. Pour the cheesecake filling on top of the biscuit base and level the top with a spatula. Set aside in the fridge for 2 hours until set firm."},{"Step 3":"To make the margarita layer, put the sugar, lime and orange juice in a small heavy based saucepan over low heat, stirring until the sugar dissolves. Squeeze the soaked gelatine leaves to remove excess water, then stir them into the warm juice mixture until fully melted. Add the tequilla, Grand Marnier and lime soda and stir to combine, then set aside to cool. Pour the jelly over the set cheesecake mixture. Cover, and return to the fridge until fully set for at least 2 hours or overnight."},{"Step 4":"For the tequila strawberries, combine all the ingredients in a bowl. Stir to combine, then cover and set aside in the fridge until ready to serve. As the strawberries sit, they will create their own syrup. Cut the cheesecake in to slices and serve with the strawberries and a drizzle of tequila strawberry syrup."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/17.jpg"}