{"id":"95","title":"Smoky beef chilli with black beans","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 40 mins, simmering time 3 hours, plus soaking","description":"Jennifer Joyce’s smoky beef chilli recipe is full of fresh Mexican flavours and packed with black beans and a real chilli heat.","ingredients":["2 pasilla or guajillo chillies (see tips)","800ml tomato passata","900g beef shin, cut into 3 cm cubes","4 tbsp olive oil","2 large onions, roughly chopped","6 garlic cloves, finely chopped","2 tbsp smoked sweet paprika (pimentón)","3 tbsp ground cumin","1 tbsp chipotle purée","60ml cider vinegar","50g soft brown sugar","1 tsp sea salt","2 X 400g tins black beans, drained and rinsed","Finely chopped red onion","Chopped avocado","Fresh coriander leaves","Grated red leicester cheese","Tortilla chips"],"method":[{"Step 1":"Boil the kettle and heat a frying pan over a high heat, add the dried chillies and cook until they puff up, turning once, for about 30 seconds.  Remove and put in a medium bowl, cover with boiling water and leave to soak.  Weight them down with a small plate if they float to the top and leave until soft, about 15 minutes. Put the chillies in a blender and pour 100ml of the tomato passata in to help it blend until very smooth, then set aside."},{"Step 2":"Season the beef with salt and pepper. Heat 1 tablespoon of the olive oil in a large saucepan with a lid or casserole over medium-high heat. Cook the beef, in batches, for 1–2 minutes each side or until browned all over, then remove and set aside. "},{"Step 3":"Reduce the heat to medium-low, add the remaining oil, onion and garlic, season with salt and pepper and cook for 5–6 minutes or until softened. Add the spices and chipotle purée to the onion mixture and cook for a few minutes."},{"Step 4":"Add the chilli paste, remaining passata, vinegar, sugar, beef and the teaspoon of salt. Cover with a lid and cook for 3 hours on a very low heat or until the beef is tender. Add the beans and warm through. Top with the onion, avocado, coriander, cheese and serve with tortilla chips, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/95.jpg"}