{"id":"158","title":"Mexican beef and polenta cobbler","difficulty":"Easy","portion":"Makes 2 meals, each serving 8","time":"Takes 1 hour to make and 20 minutes in the oven","description":"This Mexican-inspired beef recipe is topped with a spicy and cheesy polenta cobbler, perfect for feeding a crowd.","ingredients":["8 tbsp sunflower oil","4 medium onions, finely chopped","8 garlic cloves, crushed","1½ tsp crushed dried chillies","4 tsp freshly ground cumin seeds","1 tsp cayenne pepper","2kg lean minced beef","6 tbsp tomato purée","1 tbsp light muscovado sugar","2 tsp dried oregano","600ml beef stock, hot","400g can chopped tomatoes","4 roasted red peppers from a jar, drained","2 x 400g cans red kidney beans in water, rinsed and drained","400g plain flour","2 tbsp baking powder","2 tbsp soft brown sugar","½ tsp salt","½ tsp crushed dried chillies","175g polenta","125g Cheddar, finely grated","2 medium eggs","350ml milk","4 tbsp sunflower oil","50g butter, melted"],"method":[{"Step 1":"Heat the oil in a large pan, add the onions and garlic and cook for 10 minutes, until lightly browned. Add the chillies, cumin and cayenne and fry for 2-3 minutes. Add the beef and cook over a high heat, breaking up with a wooden spoon as it browns. Add the purée, sugar, oregano, beef stock and tomatoes, bring to the boil, then simmer for 25 minutes, until reduced and thickened."},{"Step 2":"Finely chop the peppers and stir into the meat with the kidney beans. Season, then spoon into 2 x 2.75-3-litre shallow, oval ovenproof dishes."},{"Step 3":"Make the cobbler. Sift the flour, baking powder, sugar and salt into a large mixing bowl and stir in the chillies, polenta and 100g grated cheese. Beat the eggs, milk, oil and melted butter together and stir into the dry ingredients."},{"Step 4":"Drop 8 spoonfuls of the mixture around the edge of each dish, about 2.5cm apart, and sprinkle with the remaining grated cheese."},{"Step 5":"To freeze, cool, then cover 1 dish with cling film and freeze until firm. Freeze for up to 3 months. Thaw for 24 hours in the fridge, then bring up to room temperature."},{"Step 6":"To cook, preheat the oven to 220°C/fan200°C/gas 7. Bake for 20 minutes, until bubbling and the topping is puffed up and golden."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/158.jpg"}