{"id":"111","title":"Nachos with oxtail chilli","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 55 min, oven time 4½ hours","description":"The rich, slow-cooked oxtail in this recipe gives the chilli a beautiful viscous texture, perfect with the crunch of the tortillas.","ingredients":["4 tbsp olive oil","1kg British oxtail","Plain flour, seasoned, to dust","2 onions, finely chopped","2 green chillies, finely chopped (optional; see tip)","4 dried chipotle chillies or dried red chillies","1 tbsp ground cumin","2 tsp ground coriander","2 tsp ground cinnamon","3 tbsp tomato purée","400g tin chopped tomatoes","750ml good quality beef stock","2 star anise","Large bunch of fresh coriander, with roots if you can find it, finely chopped","Tortilla chips","Grated cheddar or monterey jack cheese","Pickled jalapeños","Soured cream"],"method":[{"Step 1":"Heat the oven to 150°C/fan130°C/gas 2. Heat a layer of the olive oil in a frying pan over a medium heat. Dust the oxtail with the seasoned flour, then add to the pan and brown in batches, adding more oil if needed. Transfer the browned meat to a flameproof casserole."},{"Step 2":"Heat a little more of the olive oil in the frying pan, then gently fry the onions for 10 minutes or until softened. Add the green chillies (if using), chipotle/red chillies and ground spices and fry for 1 minute. Add to the casserole with the tomato purée, chopped tomatoes, stock, star anise and coriander stems/roots. Season, bring to a simmer, then cover and transfer to the oven to cook for 3½ hours. Remove the lid, then return to the oven for 1 hour."},{"Step 3":"Scoop the oxtail from the sauce and set aside. Bubble the sauce in the casserole over a medium heat for about 20 minutes or until rich, thick and sticky. Shred the oxtail meat from the bone, then return to the reduced sauce and set aside (see tip)."},{"Step 4":"When ready to serve, heat the grill to medium high. Spread a large platter with tortilla chips and scatter with grated cheese. Spoon over the hot oxtail chilli and scatter with more cheese. Cook under the grill for 5-6 minutes until the cheese has melted. Scatter with the chopped coriander leaves and jalapeños, dollop with soured cream and serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/111.jpg"}