{"id":"24","title":"Ensenada fish tacos","difficulty":"Easy","portion":"Serves 4-5 (makes 15 tacos)","time":"Hands-on time 1 hour, plus pickling","description":"Karla Zazueta’s take on Ensenada fish tacos – a Mexican delicacy bursting with fresh, zingy flavours and wonderfully crunchy textures – makes a vibrant family dinner and will satisfy everyone at the table.","ingredients":["140g plain flour, plus extra for dusting","1½ tsp baking powder","1 large free-range egg","1 tsp fine garlic salt","Pinch dried oregano","1 tsp american or dijon mustard","300g sustainable cod fillet, cut into 2cm strips","1 litre vegetable oil for deep frying","15 small corn tortillas to serve (see tip)","Iceberg lettuce, finely shredded, to serve","Lime wedges for squeezing","1 tbsp fine sea salt","1 medium red onion, cut into thin strips","Juice 1 lime","Pinch of dried oregano","1 scotch bonnet chilli, finely chopped","3 medium ripe tomatoes, finely chopped","1 small onion, finely chopped","3 tbsp chopped fresh coriander ","Juice 1 lime","3 tbsp soured cream","3 tbsp good quality mayonnaise","Digital probe thermometer; 2 baking trays lined with kitchen paper"],"method":[{"Step 1":"For the pickled onion, mix the salt with the onion in a small non-metallic bowl, then set aside for 10 minutes. Rinse the onion, drain, then toss with the lime juice, oregano, chilli and a pinch of salt."},{"Step 2":"For the pico de gallo, mix the tomatoes, onion, coriander, lime juice and a pinch of salt in a non-metallic bowl."},{"Step 3":"For the mayo sauce, mix the soured cream and mayo in a bowl with some black pepper."},{"Step 4":"To make the batter, mix the flour, baking powder, egg, garlic salt, oregano, mustard and a grinding of black pepper in a large mixing bowl. Whisk in 175ml water, little by little, stopping when the batter reaches the consistency of double cream (add a few extra splashes of water if you need to)."},{"Step 5":"Dry the fish on kitchen paper, then lightly dust with flour (to help the batter stick). Once all the pieces are dusted, drop each one into the batter and coat well."},{"Step 6":"Pour the oil into a deep heavy-based pan to a depth of about 10cm, then heat until it reaches 180°C on a thermometer (or a cube of bread browns in 20 seconds)."},{"Step 7":"Deep-fry the fish in batches for 3 minutes on each side until golden brown, then drain on the prepared baking trays. Repeat until all the fish is fried."},{"Step 8":"Warm the tortillas, spread with the mayo sauce, then add 1-2 pieces of fried fish, lettuce, salsa and some pickled onion. Serve with lime wedges and cold beer."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/24.jpg"}