{"id":"130","title":"Spicy Mexican bean burgers","difficulty":"Easy","portion":"Serves 8","time":"Takes 25 minutes to make, 15 minutes to cook, plus chilling","description":"These spicy Mexican bean burgers are a vegetarian recipe with plenty of flavour.","ingredients":["2 tbsp olive oil","1 red onion, finely chopped","6 spring onions, thinly sliced","4 garlic cloves, finely chopped","1 large red chilli, deseeded and finely chopped","1 tbsp Cajun spice","3 x 400g tins mixed beans, drained and rinsed","1 large free-range egg, beaten","100g fresh breadcrumbs","Small handful of fresh coriander leaves, finely chopped","Juice of ½ lime","150g feta, crumbled","8 slices Monterey Jack cheese","Toasted burger buns, guacamole, rocket, chopped tomatoes and sour cream to serve"],"method":[{"Step 1":"Heat 1 tbsp olive oil in a pan, add the onion and spring onion, season and fry over a gentle heat until softened but not coloured. Add the garlic, chilli and Cajun spice, then fry for 2-3 minutes. Tip into a bowl, add the beans and roughly mash."},{"Step 2":"Leave to cool slightly, then add the egg, breadcrumbs, coriander and lime juice. Season, then mix well to combine. Gently stir in the crumbled feta. Wet your hands slightly, then shape into 8 large burgers. Chill 4 of them in the fridge for 30 minutes."},{"Step 3":"Place the other burgers on a lined baking sheet. Open-freeze until solid, then pack into a plastic container, seal and freeze for up to 3 months."},{"Step 4":"To cook the chilled burgers, preheat the grill to medium. Heat the remaining oil in a frying pan over a medium heat, add the burgers and fry for 3-4 minutes on each side until golden brown. Top each with a slice of cheese, then transfer to the grill for 3-4 minutes until the cheese is bubbling and melted. Serve in toasted buns lined with guacamole, rocket leaves, chopped tomatoes and sour cream."},{"Step 5":"To cook the frozen burgers (from frozen), preheat the oven to 200°C/fan180°C/gas 6 with a baking sheet inside and preheat the grill to medium. Place the burgers on the baking paper-lined sheet, drizzle with olive oil on both sides, cover loosely with foil and bake for 25-30 minutes, turning halfway through. Remove the foil, cover each burger with a slice of cheese, then transfer to the grill for 3-4 minutes or until the cheese is melted and bubbling. Serve as in step 4."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/130.jpg"}