{"id":"131","title":"Baja-style deep-fried mackerel tacos","difficulty":"Medium","portion":"Serves 4-6","time":"Takes 15 min to make, 20 min to cook","description":"A mackerel taco recipe combines textures and flavours – crisp battered fish, wrapped in a warm flour tortilla with a spicy tomato sauce, yogurt-mayo dressing and crunchy cabbage.","ingredients":["6 tbsp mayonnaise","4 tbsp full-fat yogurt or soured cream","Vegetable oil, for deep-frying","8 flour tortillas","2 large mackerel, filleted and pin-boned (use tweezers to do this)","¼ small white cabbage, very thinly sliced on a mandoline","1 lime, cut into wedges","Small bunch of fresh coriander sprigs","100g plain flour","½ tsp baking powder","200ml Mexican beer","2 tbsp vegetable oil","2 garlic cloves, crushed","1 medium onion, finely chopped","2-3 red or green chillies, deseeded and finely chopped (it’s meant to be quite spicy)","400g ripe vine tomatoes, skinned and chopped"],"method":[{"Step 1":"To make the beer batter, sift the flour, baking powder and ½ tsp salt into a bowl. Gradually whisk in the beer to make a smooth batter. Cover and set aside for 30 minutes."},{"Step 2":"Meanwhile, for the salsa, heat the oil and garlic in a shallow pan and, as soon as the garlic starts to sizzle, add the onion. Fry gently until soft but not browned. Add the chillies, fry for a couple more minutes, then add the tomatoes. Simmer for 10 minutes until the sauce has reduced and thickened. Season and keep warm."},{"Step 3":"Mix the mayo with the yogurt or soured cream and set aside. Preheat the oven to 120°C/fan100°C/gas ½."},{"Step 4":"Heat the oil in a large saucepan to 190°C (when a small piece of bread turns golden within 40 seconds). Meanwhile, wrap the tortillas in foil and warm through in the oven."},{"Step 5":"Season the fillets, then cut each crossways into 2.5cm wide strips. Using tongs, dunk a few pieces in the batter. One at a time, drop 4 pieces into the hot oil, suspending each one in the oil for a few seconds before you let go, so it doesn’t sink immediately and stick to the bottom. Deep-fry for 3 minutes until crisp and golden. Remove with a slotted spoon and drain briefly on kitchen paper. Add 4 more pieces to the oil, then assemble the first taco."},{"Step 6":"Spread some mayo mixture down the centre of a warmed tortilla and scatter over a little cabbage. Place deep-fried fish down the centre, spoon over some salsa, then squeeze over a wedge of lime. Top with coriander, roll up and serve. Repeat for each of the tacos."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/131.jpg"}