{"id":"61","title":"Slow-cooked duck tacos with pineapple salsa","difficulty":"Medium","portion":"Serves 4-6","time":"Hands-on time 15 min, oven time 2 hours","description":"Melt-in-your-mouth slow-cooked, tequila-spiked duck, fiery pineapple salsa and creamy chipotle mayo all wrapped up in a soft tortilla. Gather the troops – it’s Mexican night!","ingredients":["Vegetable oil for frying","4 Gressingham duck legs, pierced all over with the tip of a sharp knife","1 medium pineapple, peeled, halved and cored","200ml tequila (we used El Jimador), plus a splash for the salsa","100ml chicken stock","2 tsp chipotle paste","Pinch dried chipotle chilli flakes","1 red onion, chopped","2 jalapeño chillies (or 1 red chilli), deseeded and finely chopped","Bunch fresh coriander, chopped","1 lime, halved","4 tbsp mayonnaise","2 tbsp soured cream","2 tsp chipotle paste","Pack 8 corn tortillas","1 large (or 2 small) ripe avocados","½ iceberg lettuce","Lime wedges for squeezing","Shallow flameproof casserole or large ovenproof frying pan"],"method":[{"Step 1":"Heat the oven to 160°C/140°C fan/gas 3. Heat a splash of oil in the casserole/pan over a medium-high heat. Add the duck legs, skin-side down, and brown for 5 minutes."},{"Step 2":"Chop half the pineapple and whizz in a food processor with the tequila, stock, chipotle paste, chilli flakes and seasoning to make a smooth sauce. (Alternatively, use a bowl and a stick blender.)"},{"Step 3":"Pour away any excess fat from the duck and add the whizzed sauce to the casserole or pan. Bring to a fast simmer, then put in the oven and cook, uncovered, for 2 hours."},{"Step 4":"For the pineapple salsa, finely dice the remaining pineapple and put in a bowl with the chopped red onion, chillies and most of the coriander. Add a splash of tequila and the juice of ½ lime, season and set aside."},{"Step 5":"Mix the chipotle mayo ingredients in a bowl and season. To serve, warm the tortillas in the oven. Slice the avocados, shred the lettuce and toss in a serving bowl with the juice of the remaining ½ lime and some salt and black pepper."},{"Step 6":"Using 2 forks, shred the duck meat, then mix back into the sauce (discard the skin and bones). Add a squeeze more lime and seasoning, then serve in the tortillas with the mayo, salad and salsa, remaining coriander and lime wedges for squeezing."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/61.jpg"}