{"id":"68","title":"Spicy ancho chilli, chicken and chorizo hotpot","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 40 min, oven time 55 min","description":"The ancho chillies give this hotpot a spicy and smoky kick and is incredibly easy to make. If you’re a fan of food that is big on flavour, and spice, then this is the dish for you.","ingredients":["2 ancho chillies (from large supermarkets, delis and coolchile.co.uk), soaked for 10 minutes in hot water","Olive oil for frying","1 onion, sliced","2 tsp ground cumin","2 tsp hot smoked paprika","5cm piece fresh ginger, peeled and finely chopped","200g cooking chorizo, sliced","8 (about 750g) free-range skinless and boneless chicken thighs, chopped into chunks","250ml red wine","2 x 400g tins chopped tomatoes","1 tsp sugar","2 flour tortillas","Zest 1 lemon","Bunch fresh flatleaf parsley, leaves picked","Lidded flameproof casserole"],"method":[{"Step 1":"Drain the ancho chillies (discard the liquid) and finely chop. Heat the oven to 160°C/140°C fan/gas 3."},{"Step 2":"Heat a glug of olive oil in the casserole, add the onion and fry over a medium heat for 5 minutes until starting to soften. Add the cumin and paprika and cook for 2 minutes, stirring all the time."},{"Step 3":"Add the chopped ancho chillies, ginger and chorizo and cook for a further 3-4 minutes, then add the chicken and wine, bring to the boil and simmer for 5-10 minutes until the wine has reduced by half."},{"Step 4":"Add the chopped tomatoes and the sugar. Season with salt and pepper, then cover, transfer to the oven and cook for 45-50 minutes. Remove from the oven and leave to stand for a few minutes."},{"Step 5":"Prepare the crispy tortilla topping. Heat a dry frying pan over a medium heat and add the tortillas. Toast for 3-4 minutes until scorched and crisp. Leave them to cool, then finely slice into thin strips. Toss the strips in a large bowl with the lemon zest, then sprinkle over the casserole with the parsley to serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/68.jpg"}