{"id":"27","title":"Crispy tacos with charred veg and refried beans","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 45 min","description":"Crispy tortillas are topped with spicy refried beans, warm veg and gooey feta in this fantastic vegetarian dinner. Try swapping the feta for fried halloumi if you prefer a milder flavour.","ingredients":["Olive oil for frying","2 corn on the cobs","250g chestnut mushrooms, sliced","200g runner beans (or helda beans), cut into 2cm piece","400g tin black beans, drained and rinsed","2-3 tbsp chipotle paste","2 tbsp soured cream","100g vegetarian feta, crumbled","8 small soft tortillas","Olive oil for brushing","1 sweet white onion, finely chopped","4 vine tomatoes, deseeded and finely chopped","Large handful fresh coriander, roughly chopped","Juice 1-2 limes"],"method":[{"Step 1":"Heat a glug of oil in a frying pan and cook the corn cobs over a medium-high heat for 15 minutes or so, turning regularly, until lightly charred. Once cool, slice off the kernels into a bowl and set aside. "},{"Step 2":"Add more oil to the pan and cook the mushrooms until golden but still with a bit of bite. Remove with a slotted spoon and add to the corn."},{"Step 3":"Add the runner or helda beans to the pan and cook for about 5 minutes until charred, adding more oil if needed. Return the corn and mushrooms to the pan, then reduce the heat to keep warm."},{"Step 4":"For the tacos, heat a second frying pan and brush the tortillas with a little oil. Fry on each side until crisp. Transfer to a low oven to keep warm as you cook the rest of the tortillas."},{"Step 5":"Combine all the salsa ingredients in a serving bowl. "},{"Step 6":"Put the black beans in a small pan and mash lightly with the back of a fork. Stir in the chipotle paste and soured cream, bring to a simmer, then season with salt and pepper (see Make Ahead)."},{"Step 7":"To serve, crumble the feta into the veg and toss gently. Spread each crispy tortilla with black beans and the vegetable/feta mix, then top with the salsa."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/27.jpg"}