{"id":"28","title":"Slow-cooked chicken tinga tacos with pickled onions","difficulty":"Medium","portion":"Serves 4","time":"Hands-on time 30 min, oven time 2 hours","description":"Chicken thighs are slow-cooked with ancho chillies and chipotle paste until pull-apart tender and infused with all their spicy flavour. Shred the meat and then use to top soft tortilla wraps along with the homemade pickled onions and lots of soured cream.","ingredients":["2 dried ancho chillies (from Sainsbury’s, Waitrose, Ocado and souschef.co.uk)","2 dried cascabel chillies (from Waitrose, Ocado and souschef.co.uk)","Olive oil for frying","1kg skinless, boneless free-range chicken thighs, sliced","1 large onion, finely chopped","1 red pepper, finely chopped","4 garlic cloves, crushed","½ tsp dried thyme","2 tbsp tomato purée","4 tbsp chipotle paste","500g ripe tomatoes, roughly chopped","3 fresh thyme sprigs","12 small soft tacos or 8 tortilla wraps","Soured cream, fresh coriander and lime wedges to serve","2 red onions, finely sliced","Juice 3 limes","2 tsp sea salt flakes","Casserole with a lid"],"method":[{"Step 1":" Heat the oven to 180°C/160°C fan/ gas 4. Put the dried chillies in a heatproof bowl/jug, pour over 350ml freshly boiled water, then set aside to rehydrate for 15 minutes."},{"Step 2":"Meanwhile, heat a splash of oil in the casserole and brown the chicken in batches. Transfer to a bowl, then set aside. Add another splash of oil to the casserole, turn the heat down and gently fry the onion and pepper for 10 minutes until softened. Stir in the garlic and dried thyme, then cook for 2 minutes more. "},{"Step 3":"Stir in the tomato purée and chipotle paste and cook for 1-2 minutes. Return the chicken with any resting juices to the casserole, stirring well to coat. "},{"Step 4":"Strain the chillies into the casserole to add the soaking water, leaving the chillies in the sieve. Once the chillies are cool enough to handle, remove the stalks/seeds (discard), then add the chillies to the pan."},{"Step 5":"Add the chopped tomatoes, fresh thyme and a generous pinch of sea salt flakes (see tip). Bring to a simmer, cover with the lid, then cook in the oven for 2 hours. Give everything a stir halfway through to stop the sauce sticking. "},{"Step 6":"Meanwhile, make the pink pickled onions: put the onions, lime juice and salt in a small glass or ceramic dish, then toss to coat. Set aside for 2 hours, stirring occasionally."},{"Step 7":"Once the chicken is cooked through and tender, remove and discard the chillies and thyme sprigs. Using 2 forks, shred the chicken in the pan. Turn off the oven and put the tortillas inside to warm for a few minutes."},{"Step 8":"Serve the chicken in the middle of the table with the warm tortillas, soured cream, pink pickled onions, fresh coriander and lime wedges on the side, letting everyone construct their own taco."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/28.jpg"}