{"id":"134","title":"Smoky chicken wraps","difficulty":"Easy","portion":"Serves 6","time":"Takes 15 min to make, 20 min to cook, plus cooling and defrosting","description":"This chicken recipe is ideal for freezing; just make and freeze the sauce then defrost to make fabulous wraps that are perfect for a picnic or lunch.","ingredients":["1 tbsp olive oil","120g raw cooking chorizo, sliced","1 large onion, finely chopped","2 plump garlic cloves, finely chopped","1 tsp smoked sweet paprika","1 tsp cayenne pepper","½ tsp ground cumin","630g tinned chopped tomatoes","1 red pepper and 1 yellow pepper, diced","Juice of ½ lime, plus extra wedges to serve","3 large free-range skinless chicken breasts","1 litre vegetable stock, hot","12 flour tortilla wraps","Soured cream, diced avocado and grated Cheddar, to serve"],"method":[{"Step 1":"Heat the oil in a large sauté pan over a medium heat, add the chorizo and fry until crisp. Remove with a slotted spoon, turn the temperature to low, add the onion and garlic and soften for 5 minutes."},{"Step 2":"Increase the heat, stir in the spices and cook for 2 minutes more. Pour in the tinned chopped tomato, then add the diced pepper and crisp chorizo. Season, bring to a simmer, then bubble for 5 minutes until thickened. Add the lime juice."},{"Step 3":"Meanwhile, put the chicken in a large saucepan. Pour over the stock and bring to the boil, then simmer gently for 12-15 minutes until cooked through. Remove with a slotted spoon and discard the stock. Once it is cool enough, shred the chicken using your hands and stir it through the smoky tomato sauce. Leave to cool completely."},{"Step 4":"Spoon the smoky chicken sauce into sealable plastic containers and freeze for up to 2 months."},{"Step 5":"Defrost thoroughly. Leave cold, or heat until piping hot, then spoon over the flour wraps, with the spiced rice. Top with soured cream, avocado and grated Cheddar, wrap and serve."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/134.jpg"}