{"id":"141","title":"Sticky chipotle lamb with caramelised corn","difficulty":"Easy","portion":"Serves 4","time":"Hands on time 15 mins, plus 45-55 mins cooking time","description":"This is a simple but delicious Mexican recipe, perfect for a party or as a midweek supper.","ingredients":["1 tbsp plain flour","1 tsp smoked sweet paprika","4 lamb leg steaks, fat trimmed and cut into 1cm cubes","3 tbsp olive oil","1 red onion, finely chopped","1 fat garlic clove, finely chopped","100g raw chorizo, cut into rounds","2 tbsp chilli paste (try Discovery Chipotle Paste, from Waitrose)","330ml bottle Mexican beer, such as Corona or Sol","Good dash Worcestershire sauce","150g cherry tomatoes, halved","Handful fresh parsley leaves, roughly chopped","2 corn on the cobs","1 small red chilli, deseeded and finely diced","Grated zest of 1 lime","50g softened butter","Tortilla chips and grated Cheddar, to serve"],"method":[{"Step 1":"Place the flour in a large bowl, stir in the paprika and season. Add the lamb and toss well to coat. Heat 1 tbsp of the olive oil in a large frying pan, add the onion and garlic and soften over a gentle heat. Remove to another bowl and add the chorizo to the pan. Increase the heat to medium-high and fry until just crisp, then remove and add to the bowl of onions."},{"Step 2":"Add 1 tbsp oil and the seasoned lamb to the pan and fry for 5 minutes until browned all over. Return the onion and chorizo to the pan, stir in the chilli paste, to coat, and cook for 2 minutes. Pour over the beer and a dash of Worcestershire sauce, and allow the liquid to come to the boil."},{"Step 3":"Cover with a lid, turn the heat down and simmer for 30-40 minutes until the lamb is tender and the sauce is thickened, sticky and spicy. Add a splash of water if it becomes too dry. Check the seasoning, then stir through the fresh tomatoes and chopped parsley."},{"Step 4":"Meanwhile, preheat a griddle pan over a high heat. Toss the corn on the cob in the remaining 1 tbsp olive oil, and cook in the griddle pan for 15-20 minutes, turning occasionally, until tender and caramelised. Remove and, with a sharp knife, cut into thick rounds. Mix the diced chilli and grated lime zest into the softened butter and melt over the corn pieces."},{"Step 5":"To serve, spoon the lamb onto a bed of tortilla chips and sprinkle with grated cheese. Serve the caramelised corn alongside."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/141.jpg"}