{"id":"96","title":"Drunken caterpillar chilli con carne","difficulty":"Medium","portion":"Serves 4-6","time":"Hands on time 1 hour 15 min, simmering time 4 hours","description":"This ‘caterpillar’ chilli recipe uses pig cheek as well as beef shin and beef mince making this Mexican-inspired dish extra hearty.","ingredients":["1 red onion, peeled","8 garlic cloves, peeled","4 fresh oregano sprigs","Extra-virgin olive oil, to drizzle","1 tsp dark muscovado sugar","400g tin plum tomatoes or fresh tomatoes (see tips)","400g tin black beans, drained and rinsed","2 whole mild chillies such as pasilla, mulato or ancho, or a combination","½ star anise","1 tsp cumin seeds","500g boneless beef shin, trimmed, or heel of beef","250g pig’s cheek","Vegetable or sunflower oil","250g quality beef mince","300ml porter, or other dark beer, such as Guinness","1 tsp chilli piquin powder or other chilli powder","1 tsp powdered chipotle chilli (about half a large chipotle chilli)","1 tsp sweet smoked paprika","1 tsp sal de gusano (chilli salt made with crushed caterpillars) or Maldon smoked salt","1 tsp treacle","250-500ml fresh beef stock","Fresh coriander leaves","Sour cream","Pickled jalapeños","Tortilla chips"],"method":[{"Step 1":"Heat the oven to 200’C/180 fan/gas 6. Top, tail and quarter the onion and separate the layers. Put in a roasting tray with the garlic, half the oregano, a good drizzle of extra-virgin oil, the muscovado sugar and the tomatoes. Toss together until coated, cover with foil and cook for 40 minutes, then remove the foil and cook another 20 minutes. Transfer to a blender and pulse; you want a chunky consistency not a purée, and set aside."},{"Step 2":"Mash half the beans into a paste, leave the others whole and set aside. Put a large frying pan on high heat and toast the whole mild chillies, star anise and cumin seeds for a minute or two until smoking a little. Transfer to a blender or pestle and mortar and grind into powder, then set aside."},{"Step 3":"Cut the beef and pork cheek into rough 4cm chunks. Heat a large pan or casserole on a high heat and add a glug of flavourless oil. Brown the meat in batches until nicely browned, turning occasionally, for about 5 minutes, then set aside as you go. Cook the mince in the same pan until brown, about 2-3 minutes. Add the rest of the meat back in and pour in the beer. Boil until the liquid is reduced by half, about 6-8 minutes."},{"Step 4":"Add in the reserved tomato and onion mix, the remaining dry ingredients, reserved oregano, treacle and 250ml beef stock. Cover and cook on the lowest heat for 4 hours on the hob. Stir the meat occasionally to prevent it from burning and sticking, If it is looking too dry add a little more stock. Check the meat after 4 hours, it should be so tender it gives no resistance when you shred it."},{"Step 5":"Remove the big chunks of meat from the pan and shred using two forks. Return to the pan, stir to combine, add the black beans and black bean paste, add more stock if you want a looser consistency, adjust the chilli heat and seasoning to taste. Serve with coriander, sour cream, pickled jalapeños and tortilla chips, if you like."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/96.jpg"}