{"id":"43","title":"Sweet potato chilli nachos","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min, simmering time 40 min, oven time 10 min ","description":"A great sharing starter for a Mexican-inspired feast. Try this vegetarian sweet potato chilli, made with smoked paprika and black beans, on top of tortilla chips and served with soured cream and cheddar cheese.","ingredients":["Olive oil for frying","1 onion, finely chopped","2 garlic cloves, finely chopped","1 tsp cumin seeds","1 tbsp smoked paprika","Pinch chilli flakes","1 tbsp tomato purée","4 sweet potatoes, peeled and cut into 1cm chunks","400g tin black beans, drained and rinsed","400g tin chopped tomatoes","400ml vegetable stock","Large handful fresh coriander, chopped","1 large bag tortilla chips (about 200g; use a mix of regular and blue maize chips, if you like)","100g mature cheddar, grated","2 tbsp soured cream"],"method":[{"Step 1":"Heat a splash of olive oil in a large frying/sauté pan (with a lid) over a medium heat, add the onion and garlic and fry for 5 minutes without colouring. Season with salt and pepper."},{"Step 2":"Add the cumin, paprika and chilli flakes and cook for another 2-3 minutes, then stir in the tomato purée and cook for 3 minutes."},{"Step 3":"Add the sweet potatoes and mix in well, then add the black beans, chopped tomatoes and vegetable stock and season with salt and pepper. Cover the pan with a lid and cook over a low heat for 40 minutes, stirring every 10 minutes or so."},{"Step 4":"When the 40 minutes is up, add half the chopped coriander. Heat the oven to 220°C/200°C fan/gas 7. Open the tortilla chips and spread half over the base of a deep baking tray. Add half the sweet potato ragout in an even layer, then add half the grated cheddar. Repeat with the remaining tortilla chips, ragout and cheddar."},{"Step 5":"Bake for 10 minutes until the cheese is melted and turning golden. Finish with the soured cream spooned evenly over and the rest of the coriander sprinkled on top. Eat straightaway."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/43.jpg"}