{"id":"85","title":"Lighter chicken enchiladas","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 1 ¼ hours, oven time 40 min","description":"After a healthy makeover these enchiladas contain 229kcals less than the traditional recipe; a guiltless dinner with a spicy punch.","ingredients":["1 large onion, cut into 2cm wedges","2 large red peppers, cut into thin strips (about 1.5 cm)","2 British free-range skinless boneless chicken breasts, cut into 2cm strips lengthways","Olive oil for brushing","8 small soft flour tortillas","435g tin refried beans","60g reduced-fat cheddar-style cheese, grated","Chopped fresh coriander and crisp green salad to serve","1 tbsp olive oil","1 large onion, finely chopped","3 garlic cloves, finely chopped","1kg tomato passata","2 tbsp Mexican spice mix (we used Old El Paso Seasoning Mix For Smoky BBQ Fajitas)","2 small fresh jalapeño (or regular green) chillies, deseeded and very finely chopped","2 tbsp olive oil","2 tbsp plain flour","150ml fresh chicken stock, hot","150g fat-free Greek yogurt (we like Total)"],"method":[{"Step 1":"For the tomato sauce, heat the oil in a medium saucepan, then fry the chopped onion for 10 minutes, stirring occasionally, until translucent, adding the garlic for the final 2 minutes. Add the passata and spice mix, then gently simmer for 15 minutes. Add the chillies, then season well and take off the heat."},{"Step 2":"Heat a griddle pan over a high heat until smoking. Lightly brush the onion wedges, peppers and chicken with oil, then griddle in batches for 3-4 minutes on each side until the veg are tender, the chicken is cooked through and everything has grill marks. Set aside on a plate."},{"Step 3":"Put the tortillas, one at a time, onto the hot griddle and warm for 10-20 seconds on each side, or until they start to char slightly, then put on a plate covered with a tea towel."},{"Step 4":"Heat the oven to 200°C/180°C fan/gas 6. For the béchamel sauce, heat the oil in a medium pan, then vigorously beat in the flour with a balloon whisk to form a smooth paste. Remove the pan from the heat and gradually whisk in the hot chicken stock, bit by bit. When it’s all incorporated, repeat with the Greek yogurt, whisking until smooth and thick enough to coat the back of a spoon."},{"Step 5":"To assemble, spread 1 tbsp tomato sauce over the middle of a tortilla. Spoon a line of refried beans down the centre. Top the beans with an eighth of the chicken and veg. Enclose the filling with an overlap, then put in a lightly oiled baking dish (about 20cm x 30cm), seam-side down. Repeat with the rest of the tortillas (see Make Ahead)."},{"Step 6":"Pour the remaining tomato sauce over the tortillas, then pour the béchamel over (not quite to the edges). Bake for 35 minutes until bubbling. Heat the grill to high, scatter the cheese over the enchiladas, then cook for 5 minutes until golden. Sprinkle with coriander, then serve with salad."}],"image":"https://apipics.s3.amazonaws.com/mexican_api/85.jpg"}