{"id":"135","title":"Roasted vegetable and chickpea quinoa salad","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min, simmering time 15 min, oven time 30 min","description":"Bring sun-kissed Greek flavours to your table with this vibrant vegan salad of roasted veg, chickpeas and quinoa. Depending on the season, swap any roasted vegetables into the salad such as aubergines, courgettes, squash, pumpkin, carrots or tomatoes.","ingredients":["2 red or yellow peppers, deseeded and cut into chunks","1 red onion, cut into small wedges","2 large beetroot, peeled and cut into small wedges","4 garlic cloves, unpeeled","4 tbsp olive oil","200g quinoa ","480ml vegetable stock (check it’s vegan and gluten free)","400g tin chickpeas, drained and rinsed ","1 ripe avocado, stoned, peeled and sliced","Juice 1 lemon","2 tsp sumac","Pinch caster sugar","A few fresh coriander or flatleaf parsley sprigs, chopped"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/ gas 6. Put the peppers, onion and beetroot in a roasting tin, tuck the garlic cloves in between, then drizzle with the olive oil to coat everything. Roast for 25-30 minutes or until tender. Squeeze the garlic cloves out of their skins and mix the flesh into the vegetables (discard the skins)."},{"Step 2":"Meanwhile, rinse the quinoa under cold running water and drain in a sieve. Bring the stock to the boil in a saucepan, add the quinoa and reduce the heat to a simmer. Cover and cook for 15 minutes until the quinoa is tender and has absorbed most of the stock. When cooked, the sprout or ‘tail’ will pop out of each quinoa seed. Remove from the heat and leave for 5 minutes before straining off any excess stock. Fluff up the quinoa with a fork."},{"Step 3":"Mix together the quinoa, roasted vegetables (reserving the oil left in the roasting tin), chickpeas and avocado in a serving bowl."},{"Step 4":"Whisk the dressing ingredients with the reserved oil from the roasting tin and gently toss with the salad. Serve warm."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/135.jpg"}