{"id":"218","title":"Brazilian black bean soup with raw corn salsa","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 35 min, simmering time 45 min","description":"”Black beans, a core ingredient in Brazilian cooking, have a wonderful colour and such a rich taste that you don’t need to add lots of other ingredients.” – Jane Muir, founder of Mildreds","ingredients":["Sunflower oil for frying","2 onions, finely chopped","2 red chillies, finely chopped","5 large garlic cloves, crushed","1½ tbsp smoked paprika","½ tbsp ground cumin","2 x 400g tins black beans","1 litre vegetable stock","5 bay leaves","3 roasted red peppers from a jar, drained and roughly chopped","1 small sweet potato, peeled and diced into 2cm pieces","Lime wedges to serve","2 corn cobs, kernels sliced off with a sharp knife (or, if not in season,150g frozen sweetcorn, defrosted)","½ red chilli, finely diced","6 spring onions, finely sliced","½ small red onion, finely diced","Bunch fresh coriander, finely chopped"],"method":[{"Step 1":"Heat a splash of oil in a large saucepan, add the onions, chillies and garlic and cook over a medium heat, stirring frequently, until the onions are translucent."},{"Step 2":"Add the spices and cook over a low heat, stirring, for 1-2 minutes, then add the beans in their liquid, stock and bay leaves to the pan. Bring up to a low simmer."},{"Step 3":"Add the peppers and sweet potato and cook gently, uncovered, for 45 minutes, stirring occasionally, until the sweet potato is cooked but not disintegrating."},{"Step 4":"Meanwhile, make the salsa. Mix the corn kernels in a bowl with the remaining ingredients and stir to combine."},{"Step 5":"Before serving, transfer one third of the soup to a food processor and whizz until smooth. Return to the pan and stir into the rest of the soup, then reheat, adding a little water to loosen if necessary."},{"Step 6":"Serve in bowls with a spoonful of corn salsa and lime wedges to squeeze over."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/218.jpg"}