{"id":"238","title":"Pickled radishes with pea and broad bean houmous and knackebrod","difficulty":"Easy","portion":"Serves 4-6 as a nibble","time":"Hands-on 35 min, oven 12-15 min, plus pickling, rising and cooling","description":"Next time you’re expecting guests, pickle some radishes and serve them with a spring vegetable houmous and crispbreads for a light, yet satisfying plant-based nibble.","ingredients":["2 tbsp red wine vinegar","1 tbsp caster sugar","1/2 tsp salt","300g radishes, finely sliced","100g rye flour, plus extra for dusting and sprinkling","100g dark rye flour","1/2 tsp salt","4g fast-action dried yeast","150-175ml lukewarm water","150g frozen peas, defrosted","150g frozen broad beans, defrosted and skinned","2 tbsp lemon juice","1½ tbsp tahini","1/2 tbsp extra-virgin olive oil, plus extra for drizzling","2 garlic cloves, crushed","1/4 tsp cumin seeds, toasted in a dry pan, then ground in a pestle and mortar","Large handful fresh coriander, roughly chopped"],"method":[{"Step 1":"To pickle the radishes, put the vinegar, sugar and salt in a small saucepan and set over a medium heat. Warm until the sugar and salt have dissolved, then pour into a medium mixing bowl and set aside to cool. When cool, add the radishes to the pickling liquid and toss to combine. Cover and put in the fridge for at least 1 hour."},{"Step 2":"Meanwhile, make the knäckebröd. Mix together the flours, salt and yeast in a large mixing bowl. Pour in 150ml of the lukewarm water, then mix with a wooden spoon until the mixture forms a dough. If it’s a little dry, add a splash more water. Turn out the dough onto a lightly floured surface and knead for 2 minutes. Put into a lightly oiled bowl and leave in a warm place to rise for 1 hour until slightly bigger."},{"Step 3":"Put all the houmous ingredients in a mini food processor and whizz to a coarse paste. Cover with cling film, then chill until ready to serve. Heat the oven to 220°C/200°C fan/gas 7 and put 2 baking sheets inside."},{"Step 4":"Divide the dough into 6 equal pieces. Roll out each piece on a lightly floured surface to 2mm thick. Remove the hot baking sheets from the oven and line with non-stick baking paper, then put 3 pieces of dough on each. Prick the dough all over with a fork, sprinkle with a little extra rye flour, then bake for 12-15 minutes until golden and crisp. Cool, then serve with the pickled radishes and houmous, drizzled with olive oil."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/238.jpg"}