{"id":"139","title":"Crème caramels with caramel oranges","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 25 min, plus chilling and 3 hours setting","description":"These vegan crème caramels with caramelised orange slices make a spectacular (and easy) dinner party dessert – just sprinkle with pomegranate seeds to serve.","ingredients":["75g caster sugar","200g vegan cream cheese (we used Veganlife)","250ml Oatly vegan cream","100ml unsweetened almond milk","3 tbsp maple syrup","3 tbsp cornflour","2 tsp vanilla bean paste","250g caster sugar","2 cardamom pods, bruised","3 oranges","Pomegranate seeds to serve","4 x 180ml ramekins; food processor or blender"],"method":[{"Step 1":"Put the 75g sugar in a small dry frying pan over a medium-high heat for 3-4 minutes and swirl the pan (don’t stir) until the sugar turns into an amber-coloured caramel. Divide the caramel evenly among the ramekins, then set aside."},{"Step 2":"Whizz the vegan cream cheese, oat cream, almond milk, maple syrup, cornflour and vanilla paste in a food processor until smooth."},{"Step 3":"Transfer the mixture to a pan over a medium heat. Cook for 5 minutes, whisking continuously, until thickened and resembling thick double cream or yogurt."},{"Step 4":"Remove from the heat and divide the mixture among the ramekins. Chill for 3 hours or until set firm."},{"Step 5":"Meanwhile, cut the peel away from the oranges, then slice the flesh into discs. Put the 250g sugar, cardamom pods and 125ml water in a large pan over a medium heat and swirl (don’t stir) to dissolve the sugar. Gently bring to the boil without stirring until the syrup turns dark amber in colour. Add the orange slices and any juice to the caramel, tossing to coat, then warm over the heat for a few minutes. Transfer to a serving bowl, add the pomegranate seeds, then chill until ready to serve."},{"Step 6":"Dip the bases of the ramekins in a bowl of just-boiled water. Turn out onto plates, top with the caramel oranges and sauce, then serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/139.jpg"}