{"id":"305","title":"Pizza dough for kids","difficulty":"Medium","portion":"Serves 2","time":"Takes 35–40 minutes to make, plus proving and resting","description":"Get the children mixing, sifting and kneading with our easy pizza dough for kids recipe from top Italian chef Francesco Mazzei.","ingredients":["1 tsp sugar","15g fresh yeast or 2 level tsp (7g sachet) dried yeast","225g plain flour, plus extra for dusting","1½ tsp salt","Extra-virgin olive oil, for greasing"],"method":[{"Step 1":"Measure 150ml lukewarm water into a bowl. Add the sugar and crumble in the fresh yeast with your fingers. Swirl the water to dissolve the sugar and yeast. If using dried yeast, sprinkle it over the water and whisk it in with a fork. Allow the mixture to stand for 10-15 minutes in a warm place until the yeast activates – a froth should develop on the surface."},{"Step 2":"Sift the flour and salt into a large mixing bowl. Make a well in the centre and pour in the yeast mixture. Lightly oil or flour your hands and gradually incorporate the flour and liquid until they bind together."},{"Step 3":"Sprinkle your work surface generously with flour. Tip the dough onto the floured surface and scrape out any dough sticking to the bowl. Knead for 5-10 minutes until the dough is smooth, silky, soft and supple. Place in a lightly oiled bowl, cover with cling film and leave to rise in a warm place for 1 hour or until doubled in size."},{"Step 4":"Once the dough has risen, ‘knock it back’ (this releases large air bubbles which would make the pizza uneven). To do this: rub a little oil or flour on your fingers and slide them underneath the dough. Gently lift up the dough and punch it down again."},{"Step 5":"Divide the dough into 2 equal pieces by pinching it in the middle with your thumb and forefinger. Roll each into a ball on the palm of your hand until it is sealed underneath and place on a lightly floured work surface. Cover each ball with an upturned mixing bowl or damp cloth and leave to rest for 10-20 minutes."},{"Step 6":"When the dough balls have rested and are soft to the touch, they are ready to be stretched. Start with plenty of flour on the work surface and give the dough ball a sharp slap. Next, flatten the dough gently using your fingers. Spread the dough with a rolling pin, preferably a thin one. Use one hand only, pressing lightly on the middle of the rolling pin (heavy rolling will make it tough)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/305.jpg"}