{"id":"134","title":"Parsnip and porcini wellington","difficulty":"Medium","portion":"Serves 8","time":"Hands-on time 1 hour 30 min, oven time 30-40 min","description":"Give it some welly with Maria Elia’s fabulous vegan parsnip and porcini wellington. It’s a fail-safe option if you’re looking for a meat-free centrepiece which will entertain meat-eaters, veggies and vegans alike.","ingredients":["2 tsp olive oil ","1 small onion, finely sliced","1 garlic clove, finely chopped","2 fresh thyme sprigs","2 fresh sage leaves, finely chopped","½ x 400g tin butter beans, drained","1 tsp sherry or balsamic vinegar","1 tbsp truffle oil or paste","3 large (even-size) parsnips, about 750g, quartered lengthways","2 tbsp olive oil ","2 tbsp dijon mustard ","5 tbsp olive oil","400g mixed mushrooms, finely chopped","Pinch chilli flakes","20g dried porcini mushrooms, soaked in 250ml freshly boiled water for 20 minutes","75g cooked chestnuts, chopped","2 tbsp truffle oil or 1 tbsp truffle paste, to taste","175g cavolo nero, trimmed and halved lengthways","Plain flour to dust","500g readymade vegan puff pastry block (I use Jus Rol)","45g dried cranberries (optional) ","1 tbsp maple syrup ","1 tbsp olive oil ","Food processor or blender"],"method":[{"Step 1":"For the butter bean purée, heat the oil in a large frying pan, add the onion and a pinch of salt, then cook, stirring frequently, over a medium heat until caramelised and soft (about 20 minutes). Add the garlic and herbs after 10 minutes."},{"Step 2":"Meanwhile, heat the oven to 200°C/180°C fan/gas 6. Toss the parsnips in a roasting tin with oil, sea salt and black pepper and roast for 20-25 minutes until golden and almost cooked, turning halfway through. Coat with the mustard and leave to cool. (Or pan-fry over a low- medium heat until caramelised on both sides and almost cooked. Coat with the mustard and allow to cool."},{"Step 3":"Once the onions have caramelised, transfer to a small food processor or blender with the butter beans, add the vinegar and truffle oil/paste, then pulse to form a rough purée."},{"Step 4":"For the mushroom and chestnut filling, heat 2 tbsp oil in a large non-stick frying pan. Add half the fresh mushrooms and the chilli flakes, then season with salt and black pepper. Cook until all the mushroom liquid has evaporated and the mushrooms are browned and have reduced in volume by half. Set aside to cool, then repeat with 2 tbsp oil and the remaining fresh mushrooms."},{"Step 5":"Squeeze out the soaked porcini mushrooms over the bowl to catch the liquid (reserve the liquid to make a vegan gravy – see p49). Heat the remaining tbsp oil in the pan and fry the rehydrated mushrooms until dry. Remove from the heat, then add to the cooked mushrooms along with the chestnuts and truffle oil/paste. Mix well, season and set aside to cool (see tips)."},{"Step 6":"Blanch the cavolo nero in boiling salted water until tender (4-5 minutes), then refresh in cold water. Drain and pat the leaves dry."},{"Step 7":"When ready to assemble the wellington, roll the pastry out on a sheet of baking paper dusted with flour to a 27cm x 37cm rectangle."},{"Step 8":"Spread the butter bean mixture lengthways down the centre of the pastry, leaving a 3cm margin at the edges. Add a layer of half the cavolo nero leaves and half the mushroom mixture, then sprinkle with the dried cranberries (if using). Next add the parsnips, then top with the rest of the mushroom and chestnut mixture. Finish with the rest of the cavolo nero leaves."},{"Step 9":"Mix the maple syrup and olive oil in a small bowl to make a glaze, then brush some along the edges of the pastry. Fold the pastry over the filling, as you would a swiss roll, using the paper to help roll and keep the filling tightly packed. Make sure the join is on the underside. Glaze the top of the pastry, then chill for 30-45 minutes (see Make Ahead). Heat the oven to 220°C/200°C fan/gas 7."},{"Step 10":"Lightly score the top using the tip of a sharp knife, then brush all over with the remaining glaze. Bake for 30-40 minutes until puffed and golden. Remove from the oven, let the wellington stand for 5 minutes, then slice with a serrated knife. The wellington is wonderful with parsnip & porcini gravy."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/134.jpg"}