{"id":"133","title":"Vegan ‘scrambled eggs’ with mushrooms and greens","difficulty":"Easy","portion":"SERVES 4-6","time":"HANDS-ON TIME 15 MIN, SIMMERING TIME 20 MIN","description":"Instead of tofu, our vegan ‘scrambled eggs’ recipe uses a mix of lentils, cashew butter, oat milk and lemon juice. You’ve got to try it!","ingredients":["200g red split lentils, well rinsed","200ml oat milk (we used Oatly Barista)","100g cashew butter","1 tbsp lemon juice","80ml extra-virgin olive oil","60g rice flour","½ tsp bicarbonate of soda","4 garlic cloves","1 tbsp coriander seeds, lightly toasted in a dry pan","4 tbsp olive oil","200g large leaf spinach, roughly chopped","12 portobellini mushrooms","4-6 slices sourdough bread","Tomato chutney to serve (we like Tracklements)","Blender or food processor"],"method":[{"Step 1":"To make the golden ‘egg’ mixture, cook the lentils for 20 minutes or according to the pack instructions. Drain, then run under cold water in a sieve. Put the cooked lentils, oat milk, cashew butter, lemon juice, extra-virgin olive oil, rice flour, bicarb of soda, garlic and coriander seeds into a blender or food processor and whizz until smooth, then season with salt and pepper."},{"Step 2":"Heat 1 tbsp of the regular olive oil in a wide pan over a medium heat, then stir-fry the spinach for a minute to soften slightly. Remove from the pan and set aside, then turn up the heat to medium-high, add another 1 tbsp of oil and addthe portobellini mushrooms. Cook for 1-2 minutes on each side."},{"Step 3":"Heat the remaining olive oil in a large heavy-based frying pan over a medium-high heat. Pour the ‘egg’ mixture in, let it cook and crisp up slightly, then turn it over to cook on the other side (it will break up). Add the spinach and cook for another 3-4 minutes, folding together with the ‘scrambled eggs’."},{"Step 4":"Toast the bread, then serve with the vegan ‘scrambled egg’ mixture and the tomato chutney."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/133.jpg"}