{"id":"233","title":"Lemony raw beetroot and quinoa salad with dill and olives","difficulty":"Easy","portion":"Serves 4 as a main course or 6 as a side dish","time":"Hands-on time 25 min","description":"”Raw beetroot is one of my favourite foods. It’s crisp yet tender, earthy and sweet. This salad is vegan, but if you’re serving it to people who don’t mind eating dairy, feta makes a fantastic addition.” – Sarah Britton","ingredients":["190g quinoa","¾ tsp fine sea salt","1 beetroot","Zest 1 lemon and 1 tbsp juice","50g raw, unsalted shelled pistachios (from health food shops and online)","1 shallot, sliced","55g fresh dill, finely chopped","130g mixed green olives with stones","1 small garlic clove, very finely chopped","2 tbsp cold-pressed extra-virgin olive oil","Finely grated zest 1 lemon and 2 tbsp juice","Pinch fine sea salt","¼-½ tsp maple syrup"],"method":[{"Step 1":"Rinse the quinoa well in a fine sieve, then drain. Transfer to a saucepan, then add 415ml water and the sea salt. Bring to the boil over a medium-high heat, then reduce the heat to low and cook, covered, for about 20 minutes or until all the water has been absorbed and the grains are tender. Fluff up the grains with a fork."},{"Step 2":"While the quinoa is cooking, carefully peel the beetroot and thinly slice with a mandoline or a sharp knife. Toss the beetroot slices with the lemon juice in a medium bowl, then set aside."},{"Step 3":"In a small bowl, whisk together all the dressing ingredients."},{"Step 4":"Pour half the dressing over the cooked quinoa while it’s still warm. Sprinkle with the lemon zest, then toss to coat."},{"Step 5":"Heat a small dry frying pan over a medium heat. When hot, toast the pistachios for about 5 minutes, stirring frequently, or until fragrant. Immediately remove the pan from the heat and leave the nuts to cool, then roughly chop.Transfer the cooked quinoa to a large bowl or serving platter."},{"Step 6":"Stir in the sliced shallot and chopped dill. Tuck the lemony beetroot slices into the quinoa (if you toss them in, the quinoa will turn pink), then scatter over the olives and chopped toasted pistachios. Drizzle the remaining dressing over the quinoa salad and season to taste with salt, then serve as a main course or side dish."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/233.jpg"}