{"id":"249","title":"Sattu parathas","difficulty":"Medium","portion":"Makes 6","time":"Hands-on time 30 min, plus 1 hour resting","description":"Use Romy Gill’s step-by-step recipe for traditional sattu parathas stuffed with chilli, onion, coriander and spices. Then serve with your favourite curry for the ultimate Indian feast.","ingredients":["100g wholemeal flour","100g plain flour, plus extra to dust","1 tsp fine salt","1 tbsp extra-virgin rapeseed oil, plus extra for drizzling and frying","60g gram flour (see food team’s tip)","1 tsp grated fresh ginger","1-2 green chillies, seeds removed, very finely chopped","½ small red onion, very finely chopped","2 tsp finely chopped fresh coriander","1 tsp cumin seeds","½ tsp garam masala","Juice ½ lemon","2½ tbsp extra-virgin rapeseed or olive oil","Chutney and raita"],"method":[{"Step 1":"To make the dough, tip the flours and salt into a medium mixing bowl and make a well in the centre. Pour in 100ml cold water and the oil, then mix with a wooden spoon or your hands until it comes together into a dough. If it feels a little dry, add a tiny splash of water. Knead for 5-8 minutes until smooth and elastic. Return to the mixing bowl, cover with a tea towel and leave to rest for an hour."},{"Step 2":"Meanwhile, make the filling. Put all the filling ingredients in a medium mixing bowl and stir to combine. Cover and set aside while you continue with the dough."},{"Step 3":"Divide the dough into 6 equal balls. On a lightly floured surface roll each ball out to a 3mm-thick disc. Take one of the discs, top with 1 tbsp of filling, bring the edges of the dough into the centre, then pinch to seal and form a pouch. Gently flatten the pouch in your hands, then sprinkle with more flour and re-roll, seam-side down, to a 3mm-thick disc. Repeat with all the discs of dough."},{"Step 4":"Heat a heavy-based frying pan over a medium heat and dry-fry the parathas, in batches, on one side for 30 seconds. Flip and cook for a minute more on the other side, until small blisters form on the surface. Brush or drizzle a little oil over the surface, flip onto the other side and fry for another minute. Brush/drizzle more oil on the upturned side, then flip again and cook for a final minute. Serve with chutney and raita."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/249.jpg"}