{"id":"126","title":"Vegan spaghetti bolognese","difficulty":"Easy","portion":"Serves 3-4","time":"Hands-on time 25 min","description":"This speedy vegan version of spaghetti bolognese is made by blitzing and browning quality plant-based sausages. The use of soy and balsamic brings bold flavour in minutes, so this bolognese sauce is finished by the time the pasta has cooked. It’s the kind of weeknight problem-solving we love, and a great way to satisfy the family.","ingredients":["1 celery stick, roughly chopped","1 small carrot, roughly chopped","4 plant-based sausages, defrosted if necessary (we like Birds Eye Green Cuisine Succulent Meat-free Sausages)","Handful fresh thyme and/or sage","1 tbsp tomato purée","1⁄2 garlic clove, crushed","1 tsp fennel seeds","2 tbsp olive oil","2 tbsp balsamic vinegar","1 tsp soy sauce","1 tsp nutritional yeast (see Know How)","400g tin chopped tomatoes","1 tbsp ketchup","1 bay leaf","1 cinnamon stick","1⁄2 orange","2 tbsp fine sea salt","400g spaghetti","Plant-based parmesan-style cheese to serve","Extra-virgin olive oil to serve 10cm and 8cm round biscuit cutters","Food processor"],"method":[{"Step 1":"Add the celery and carrot to the food processor with the sausages and pulse until finely chopped. Add the thyme and/or sage leaves, tomato purée, garlic and fennel seeds and pulse a few more times."},{"Step 2":"Heat the olive oil in a large frying pan, then tip in the mince mixture and stir-fry for a few minutes. Add the balsamic vinegar, soy sauce, nutritional yeast, chopped tomatoes, ketchup, bay leaf and cinnamon stick. Squeeze in the juice from the orange, stir and leave to simmer while you cook the pasta."},{"Step 3":"Cook the spaghetti in salted water until al dente (still with some bite), according to the packet instructions."},{"Step 4":"Remove the cinnamon and bay leaf from the sauce and discard. Use tongs to slosh the cooked pasta into the sauce in the pan, bringing some of the pasta water with it. Mix using the tongs, adding more pasta water if it looks dry. Serve with plant- based parmesan-style cheese and a drizzle of olive oil."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/126.jpg"}