{"id":"217","title":"Cashew and smoked tofu potsticker gyoza","difficulty":"Medium","portion":"Makes 16-20 (serves 4)","time":"Hands-on time 1 hour, plus 5-12 hours draining","description":"”Consistently one of our most popular starters. They aren’t complicated to assemble but the filling must be relatively dry. You can swap the smoked tofu for regular firm tofu, add more spice or change the cashews for peanuts.” – Jane Muir, founder of Mildreds.","ingredients":["16-20 ready-made gyoza wrappers (from Asian grocers or theasiancookshop.co.uk)","Toasted sesame oil and vegetable oil for frying","75-100ml boiling water","75g roasted, salted cashew nuts","150g smoked tofu","50g chinese cabbage or pak choi, roughly chopped","2 spring onions, chopped","½ small carrot, peeled and grated","20g beansprouts","½ small red chilli","1-2 garlic cloves, crushed","1 tsp peeled and grated ginger","1 tbsp tamari or dark soy sauce","1 tbsp sweet chilli sauce","1 tbsp toasted sesame oil","4 tbsp sweet chilli sauce","3 tbsp tamari or dark soy sauce","2 tbsp rice vinegar","Finely sliced spring onions","Coriander leaves","Toasted sesame seeds","28cm non-stick frying pan with a lid"],"method":[{"Step 1":"For the filling, pulse the cashews in a food processor to a crunchy crumb consistency. Transfer to a bowl. Without washing the food processor bowl, add the tofu and pulse to a mince-like texture, then add to the bowl."},{"Step 2":"Pulse the remaining filling ingredients in the food processor until finely chopped. Transfer the filling mixture to a sieve set over a bowl. Cover, then leave to drain in the fridge for 5-12 hours."},{"Step 3":"To assemble the gyoza, wet the edges of a wrapper with a pastry brush dipped in water, place a teaspoon of the filling in the centre of the wrapper, then pinch the edges of the wrapper together to enclose the filling. Sit the dumpling on its base and plump to flatten the bottom. Put on a baking tray lined with baking paper. Continue until all the filling is used. Cover the gyoza and keep in the fridge until ready to cook."},{"Step 4":"Heat the oven to its lowest setting.Heat the frying pan over a medium heat with a glug each of sesame and vegetable oil, then add the dumplings (however many will fit in a single layer) bottoms-down and close together but not touching. Cook over a medium heat until the bases are an even golden colour. Add the boiling water (gauge the amount depending on your pan size) and bring to a simmer before covering the pan with the lid. Steam for about 2-3 minutes until the wrappers are becoming fairly translucent. Uncover and cook for a further 2-3 minutes until the water has evaporated and the bases are crunchy. Remove and keep warm in the low oven while you repeat with the remaining gyoza."},{"Step 5":"To make the dip, combine all the ingredients thoroughly in a serving bowl. Serve the gyoza with the dip, scattered with finely sliced spring onions, coriander leaves and toasted sesame seeds."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/217.jpg"}