{"id":"26","title":"The Dusty Knuckle’s sourdough starter","difficulty":"Easy","portion":"Makes 1 healthy sourdough starter","time":"Hands-on time about 20 min, plus 7 days fermenting","description":"Make a healthy and lively sourdough starter from scratch with our step-by-step starter recipe from The Dusty Knuckle Bakery. This stiff starter is perfect for making the bakery’s linseed baguettes.","ingredients":["Wholewheat flour","Water","Digital scales","Jam jar with a loose-fitting (not airtight) lid"],"method":[{"Step 1":"DAY 1 Mix 40g wholewheat flour and 40g water in a clean jam jar until there are no dry bits. Put on the lid. Remember the rules around temperature here, and use the water temperature to counter your room temperature (see Know How)."},{"Step 2":"DAY 2 Repeat DAY 1, adding 40g wholewheat flour and 40g water."},{"Step 3":" DAY 3 Repeat DAY 1, adding 40g wholewheat flour and 40g water. By the end of DAY 3 you will have 240g starter in your jar."},{"Step 4":"DAY 4 You should start seeing some bubbles appear and there should be a nice yogurty, slightly acidic smell. Now to make the starter stiff. Discard all but 1 tbsp starter (see Know How) and feed the remaining starter with 200g strong white bread flour and 150g water. This may be harder to mix in the jar – you can always scoop it out and mix it by hand in a bowl."},{"Step 5":"DAY 5 Discard 200g (leaving you with 150g) and feed the remaining starter with 180g strong white bread flour and 120g water."},{"Step 6":"Leave alone for DAY 6"},{"Step 7":"DAY 7 Your starter is now a week old! It should grow in size slowly over the day, and when you come to feed it, it should have grown noticeably in the jar. It should be smelling acidic and delicious. You are now ready to make bread."},{"Step 8":"You have two options for maintaining your starter. If you’re not planning to bake regularly, put your starter in the fridge and give it a feed (DAY 5 instructions) once a week. You’ll need to take it out of the fridge 3 days before you want to make bread, feeding it daily to bring it back to life."},{"Step 9":"Alternatively, keep the starter out of the fridge, but feed it daily (DAY 5 instructions). You’ll need to bake regularly, every day or whenever you want! If you miss a feed, don’t panic – give it a few days of feeding to get it back to normal."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/26.jpg"}