{"id":"225","title":"Sweet potato and chickpea curry","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 20 min, Simmering time 20–25 min","description":"This comforting vegetarian (and vegan) curry is packed full of goodness – from Vitamin A-rich sweet potatoes and fibre-filled chickpeas to iron-packed spinach – all cooked in creamy coconut milk and served with yoghurt. Perfect for a weeknight meal.","ingredients":["1 tbsp light olive oil","1 large red onion, finely sliced","1 large leek, sliced","1tbsp mild curry paste – or more if you like your food a bit spicier (we like Patak’s korma or tikka paste)","Thumb-size piece fresh ginger, grated","2 large sweet potatoes, peeled and cut into large cubes – or use a mix of sweet potato and pumpkin or butternut squash","400ml tin coconut milk","400g tin chickpeas, drained and rinsed","400g tin chopped tomatoes","1 tbsp tomato purée","25g dried red lentils","115g pack baby leaf spinach","Bunch fresh coriander, finely chopped","1 lime, halved","Dairy-free yogurt, finely chopped cucumber and rice to serve"],"method":[{"Step 1":"Heat the oil in a large deep fryingor sauté pan (one that has a lid) over a medium heat. Add the onion and fry, stirring occasionally, for 5 minutes until starting to soften. Add the leek and fry for a further 5-7 minutes or until both the onion and the leek have softened and the onion is translucent."},{"Step 2":"Add the curry paste and stir over the heat for a minute, then stir in the grated ginger and cook for a further minute."},{"Step 3":"Add the sweet potato chunks (and pumpkin/butternut squash, if using), coconut milk, rinsed chickpeas, tomatoes, tomato purée and lentils. Stir well, bring to the boil, then turn down the heat, put the lid on the pan and simmer for 20-25 minutes until the sweet potato is tender."},{"Step 4":"Take off the lid, stir in the spinach leaves and cook for 3 minutes until the spinach has wilted. Stir in half the coriander and squeeze in half the lime."},{"Step 5":"Cut the remaining lime half into wedges and serve the curry immediately with cooked rice, alongside small bowls of yogurt and chopped cucumber with the lime wedges for squeezing over. Sprinkle the remaining coriander over the top and serve straightaway."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/225.jpg"}