{"id":"84","title":"Quince jelly","difficulty":"Easy","portion":"Makes about 500ml","time":"Hands-on time 20 min, plus overnight straining and cooling","description":"Make the most of quince’s short autumn season by stirring up a batch of delicious quince jelly. Try with roast game or simply spread on toast.","ingredients":["1.5kg quinces (7-8), peeled and roughly chopped into 3-4cm pieces (leave in the cores/pips and reserve the peel)","800g-1.2kg caster sugar","10g fresh ginger (about a 5cm piece), peeled and thinly sliced","½ vanilla pod, seeds scraped","8 tbsp lemon juice","Large jelly bag or sieve lined with 3-4 layers of muslin","Large wide saucepan","Sterilised glass jars and lids"],"method":[{"Step 1":"Put the quinces, their peel and 2 litres water in a large pan. Bring to the boil, then cover and reduce to a simmer. Cook for 2 hours or until the fruit is very soft. Spoon the quinces and liquid into a jelly bag/muslin set over a large pan. Set aside to strain for at least 12 hours or overnight. Don’t be tempted to squeeze it or the jelly will be cloudy."},{"Step 2":"Once strained, measure the juice and pour into a large, wide saucepan – you should have about 1½ litres (see Don’t Waste It). Add 800g sugar per litre of juice to the pan along with the ginger, vanilla pod and seeds, and lemon juice. Set the pan over a medium heat, stirring until the sugar dissolves. Put a small plate in the freezer."},{"Step 3":"Increase the heat to high and bring the liquid to a rapid boil. Cook for 30-40 minutes until the jelly is reduced and thickened. To test if it’s ready (at setting point), spoon a little liquid onto the cold plate. The jelly should set right away and wrinkle when you push it. If it doesn’t, cook for 10 minutes more, then test again."},{"Step 4":"Remove the ginger and vanilla (see Don’t Waste It), then pour the jelly into hot, sterilised jars. Wipe the rims with a sterilised damp cloth, then close tightly with sterilised lids. Put the jars upside down on a tea towel for 1 hour to seal, then turn upright and leave to cool."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/84.jpg"}