{"id":"20","title":"Vegan tart with miso, frangipane and onions","difficulty":"Easy","portion":"Serves 1","time":"Hands-on time 40 min, plus chilling. Oven time 37-43 min.","description":"This rich vegan tart makes a great Christmas main for a plant-based guest. Savoury frangipane is topped with kale and sweet, sticky miso onions.","ingredients":["1 tsp olive oil","½ or 1 small red onion, finely sliced","½ tsp brown rice miso paste","1 tsp rice or white wine vinegar","Pinch sugar","Small handful kale","1 tsp Free and Easy egg replacer (from Asda, Waitrose and Ocado)","1 small garlic clove, crushed","25g ground almonds","50g plain flour, plus extra to dust","1 tbsp olive oil","10cm fluted tart tin","Baking beans"],"method":[{"Step 1":"Make the pastry first: put the flour in a bowl with a pinch of salt. Add the oil and rub it into the flour with your fingertips until it resembles breadcrumbs. Add 1 tbsp cold water, then use a butter knife to mix until it comes together. Lightly knead the dough into a ball, then roll out on a lightly floured worktop and use to line a 10cm fluted tart tin. Chill for 20 minutes."},{"Step 2":"Heat 1 tsp oil in a small pan over a medium heat. Add the sliced onion and a pinch of salt and cook gently for about 20 minutes, stirring occasionally. Stir in the miso paste, vinegar and sugar, then cook for another 5 minutes. Put the kale in a colander in the sink and pour over boiling water from the kettle to wilt it, then leave to drain and cool."},{"Step 3":"Heat the oven to 180°C fan/ gas 6. Line the pastry case with crumpled baking paper and fill with baking beans or uncooked rice. Bake on a tray for 12 minutes, then remove the paper and beans and bake for another 5-6 minutes until the pastry is crisp and lightly browned."},{"Step 4":"Meanwhile, put the egg replacer in a bowl with 1 tbsp water and whisk until light and fluffy. Use a metal spoon to fold in the garlic and ground almonds to make a fragipane, then season with a pinch of salt and some ground black pepper. Tip the frangipane into the tart case, then spoon over the miso onions and kale, pressing them in lightly. Bake for 20-25 minutes until the frangipane is puffed up and golden."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/20.jpg"}