{"id":"27","title":"The Dusty Knuckle’s linseed baguettes","difficulty":"A challenge","portion":"Makes 4 baguettes, each serving 2","time":"Hands-on time 1 hour, plus a week to make the starter, 8-10 hours resting, overnight chilling and 1 hour proving. Oven time 18 min","description":"Learn how to make The Dusty Knuckle’s crunchy-on-the-outside, chewy-on-the-inside linseed baguettes with a step-by-step recipe from the acclaimed London bakery.","ingredients":["100g wholemeal flour","375g strong white bread flour, plus extra to dust","370g warm water (see Know How)","135g stiff starter","15g fine sea salt","100g cooked porridge, overnight oats, cooked bulgur wheat or cooked rice (see tips)","100g soaked golden or brown linseeds (see Make Ahead)","Vegetable oil for greasing","Rice flour to dust","Digital thermometer","Dough scraper","Baking stone"],"method":[{"Step 1":"Mix the flours and 300g of the warm water in a bowl until there are no wet or dry bits. Scrape down the bowl, cover, then set aside for 2-4 hours to allow your flour to hydrate fully."},{"Step 2":"Weigh out your starter and add it with the remaining 70g warm water to the flour bowl. Squish, squeeze and squelch your dough. It will go weird and slimy, but don’t worry – this is normal. When it’s all combined, scrape down the bowl, cover it and set aside for 30 minutes. Add your salt to the bowl and mix this through, squeezing the dough again until the salt is totally incorporated. Add the porridge and soaked linseeds and work these into the dough mix – you want to give this a good 8 minutes. Use a scraper or your hands to get under the dough and lift it up, then lightly oil the inside of the bowl. Cover the bowl with a lid or a clean tea towel and leave it somewhere warm for 1 hour. Take a mental picture of how much the dough fills the bowl – by the end, you want it to have almost doubled."},{"Step 3":"For the next 4 hours you are going to give the dough a ‘fold’ every hour. This just means grabbing the edge of the dough with a wet hand, stretching it up as high as it will go and folding it over on itself, working around the bowl as many times as the dough will let you – until it feels tight and as if it might tear. Over 4 hours, this means you’ll have given the dough 3 folds. With each fold, you should be starting to see more life in the dough. This process is what we call the bulk fermentation and it’s where the magic is happening."},{"Step 4":"After the last fold, let the dough rest for a final 30(ish) minutes. You should have a shiny, coherent, strong dough that wobbles when you carefully prod it. If it feels wet and sticky, give it another fold and leave it for a further 30 minutes. If it feels strong, just not that lively, leave out the extra fold but still give it more resting time. This is the fermentation period, and you can’t really rush it – just let it do its thing. You’ll get a feel for this sweet spot the more you bake. Put the dough in the fridge overnight. This will help develop the flavour, let it rest and get lovely and strong. (It can stay in the fridge for up to 24 hours.)"},{"Step 5":"The next day, gently tip the dough out onto a flour-dusted worktop and, without disturbing it much, cut it into 4 quarters – use a dough scraper to do this if you have one. With each quarter of dough, fold the points to the centre to make a very rough, long rectangle. You need to be gentle, but if you’re slow and too careful the dough will stick to your fingers and it’ll quickly get stressful. Flip the dough so the seams are facing down and the top is smooth, then let it rest for 30 minutes to come up to room temperature."},{"Step 6":"Now flip the dough back over again so the seams are facing up – you want the rectangle to be oriented so the longest side is horizontal in front of you. Grab the top edge and fold it into the middle of the dough, then grab the bottom edge and fold it over to meet the new top edge. Gently seal along this length with your thumbs. Roll the dough over so the seam is on the bottom. Next, cup both hands over the dough, your fingers resting on the work surface at the top and the heel of your hand on the surface at the bottom. Roll the dough, working your hands away from each other, so you’re lengthening the baguette Push your hands down harder as you reach the ends so you get that lovely pointed shape. The trick is not to go over it too many times – once is ideal."},{"Step 7":"Heavily dust a tea towel with rice flour and lay it in a shallow baking tray or something of a similar shape so it just hangs over one side and there’s plenty left on the other. Lay your first baguette seam-side down along the edge of the tray with a little overhang, so the side supports it. Pull a fold of the tea towel up around it so it’s cradled on both sides. Put another baguette alongside and repeat. Do this for all 4 baguettes, nestling them against each other, then let them rest for 1 hour."},{"Step 8":"Heat your oven to 220°C fan/gas 9 or as hot as it will go, and boil a kettle. Put a baking tin in the bottom of your oven and a baking sheet (or a baking stone, if you have one) on the middle shelf to heat up. Cut 4 slightly larger than baguette-size pieces of baking paper and flip out the baguettes onto them with the seams facing up. These will act as a score – the loaf will open through the seam. The outcome is quite a rustic look, far from your traditional French stick."},{"Step 9":"Working as quickly as you can, open the oven, take out your hot baking sheet or stone and use the baking paper strips as little hammocks to transfer each baguette onto the baking sheet/ stone. Pour some boiling water into the baking tin at the bottom and put the baguettes in the middle of the oven. Bake for 18 minutes or until lovely and dark."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/27.jpg"}