{"id":"167","title":"Vegan coconut and mango pavlova","difficulty":"Medium","portion":"Serves 8-10","time":"Hands-on time 40 min, oven time 1½ hours, plus 2-3 hours cooling and chilling","description":"We’ve turned this egg and dairy-based dessert into a knockout vegan showstopper with our coconut and mango pavlova. It’s topped with coconut cream and a tropical layer of mango and lime making it a wonderful pud to pull out at a summer party.","ingredients":["400g can chickpeas","220g caster sugar","1 tbsp cornflour","3 ripe passion fruit","Zest and juice 1 lime","400ml mango sorbet to serve","2 ripe mangoes, peeled, de-stoned and sliced to serve","250ml carton coconut cream, chilled for at least 3 hours (we used Sainsbury’s own brand)","1-2 tbsp maple syrup, optional","Baking tray lined with non-stick baking paper; stand mixer/electric mixer"],"method":[{"Step 1":"Set a sieve over a jug and drain the chickpeas, reserving the liquid (aquafaba). Chill the aquafaba. Chill the chickpeas in an airtight container to use in other recipes."},{"Step 2":"Heat the oven to 130°C/110°C fan/gas ¾. Transfer the aquafaba to a stand mixer fitted with a whisk attachment (or to a large mixing bowl to be whisked with an electric mixer). Whisk for 8 minutes or until the meringue holds soft peaks when the whisk is lifted. Add the sugar, 1 tbsp at a time, whisking constantly for 15 minutes or until the sugar is completely dissolved. Whisk in the cornflour."},{"Step 3":"Spoon the meringue onto the lined baking sheet in pillows, forming a rough rectangle. Using the back of the spoon, make a slight dip in the middle, then transfer the meringue to the oven and bake for 1½ hours. Turn the oven off(don’t open the door) and leave to cool for another 2-3 hours (see Make Ahead)."},{"Step 4":"Halve the passion fruit and scoop out the seeds into a bowl. Add the lime juice, then stir to separate the seeds from the juice."},{"Step 5":"Whisk the chilled coconut cream in a clean mixing bowl until it forms stiff peaks. Turn the mixer to low speed and whisk in the maple syrup, if you like, to sweeten."},{"Step 6":"When ready to serve, top the pavlova with the coconut cream, then scoop the mango sorbet straight onto the cream. Top with the mango slices, then drizzle with the passion fruit pulp and sprinkle over the lime zest to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/167.jpg"}