{"id":"230","title":"Beetroot pithiviers","difficulty":"Easy","portion":"Makes 4","time":"Hands-on time 1 hour 15 min, oven time 35-40 min","description":"A showstopper vegetarian main course recipe, our beetroot pithiviers would be perfect for a winter dinner party or Christmas Day lunch.","ingredients":["400g beetroot, peeled and sliced into 0.5cm rounds","2 garlic cloves, 1 roughly bashed, 1 crushed","900ml vegetable stock","4 tbsp olive oil, plus extra for frying and brushing","3 large onions, finely sliced","2 tsp light brown sugar","4 fresh thyme sprigs, leaves roughly chopped","3 tbsp caramelised onion chutney","2 tbsp plain flour","100ml dry white wine","1½ tsp caster sugar","Zest ½ orange and squeeze of juice","50g walnuts, toasted in a dry pan until golden, then roughly chopped","260g baby leaf spinach","Grating of nutmeg","2 x 500g blocks Jus-Rol puff pastry"],"method":[{"Step 1":"Put the beetroot in a large pan with a lid along with the bashed garlic and vegetable stock. Bring to a simmer and cook for 15 minutes or until the beetroot is just soft when tested with a round-bladed knife."},{"Step 2":"Meanwhile, heat 2 tbsp of the oil in a large frying pan and fry the onions over a medium heat for about 10 minutes until golden, then add the brown sugar and thyme. Cover with the lid and cook for a further 5 minutes until lightly caramelised, stirring occasionally. Stir in the chutney, then set aside."},{"Step 3":"Set a sieve over a measuring jug and pour the beetroot and its cooking stock into the sieve, catching the juices in the jug below. Transfer the beetroot to a bowl and set aside. Heat the remaining 2 tbsp oil in the same saucepan over a medium-high heat, then stir in the flour and cook for a minute or two until its starts to smell biscuity."},{"Step 4":"Slowly pour in the wine and bring up to a simmer. When it starts to bubble, slowly pour in 400ml of the beetroot stock and stir until well combined. Keep stirring (whisking if you get lumps) until the mixture thickens to form a smooth sauce. Season, then add the sugar, orange zest and a squeeze of juice. Pour the sauce over the beetroot slices in the bowl and mix in the walnuts – be careful not to break up the beetroot. Loosely cover with cling film touching the surface; leave to cool."},{"Step 5":"Heat a splash of oil in the cleaned saucepan and add the crushed garlic. Stir for 1-2 minutes, then add the spinach and stir until wilted. Season well with salt and pepper and a good grating of nutmeg, then put the spinach in a colander and press out the excess liquid."},{"Step 6":"Roll each pastry block into a 40cm square. Heat the oven to 200°C/180°C fan/gas 6. Using a plate as a guide, cut out 4 x 15cm circles from one of the pastry squares and put on a large baking tray lined with non-stick baking paper. Spoon a quarter of the beetroot mix into the centre of each one, leaving a 2cm border. Top with a quarter of the onion mixture and finally a quarter of the spinach mixture, so it forms a dome shape. Brush the pastry edges with a little water."},{"Step 7":"Using a plate as a guide, cut 4 x 20cm circles of pastry from the second square, then drape them over each mound to make individual pithiviers, smoothing the pastry down over the filling. Press the edges together and crimp, using your fingers or the tines of a fork, to seal. Trim the edges to neaten, then brush the tops with a little olive oil."},{"Step 8":"Bake for 35-40 minutes; leave to rest for 5 minutes before serving."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/230.jpg"}