{"id":"246","title":"Soba noodles with aubergine and mango","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 30 min","description":"This Ottolenghi-inspired recipe is the perfect marriage of sweet and savoury. It’s a quick and easy midweek dinner ready in 30 minutes.","ingredients":["250g pack dried soba noodles (we like Clearspring from Waitrose)","2 glugs of olive oil","1 medium aubergine (about 250g), cut into 2cm cubes","1 large ripe mango (about 400g), peeled and cut into small chunks","225g firm silken tofu, cut into tiny cubes","½ medium red onion, finely sliced","Handful of radishes, quartered","Handful of fresh basil leaves, torn","Handful of fresh coriander, chopped","120ml brown rice vinegar","40g brown sugar","½ tsp sea salt, plus extra to sprinkle","2 garlic cloves, crushed","¼ tsp chilli flakes","1 tsp toasted sesame oil","Finely grated zest and juice of 1 lime"],"method":[{"Step 1":"Set a large pan of lightly salted water over a medium-high heat and bring to the boil. Meanwhile, make the dressing by mixing the vinegar, sugar and the salt in a small pan over a medium heat. Cook, stirring, until the sugar has dissolved. Remove from the heat and add the garlic, chilli flakes and sesame oil. Allow to cool, then add the lime zest and juice."},{"Step 2":"Cook the soba noodles in the boiling water for 5-7 minutes or according to the pack instructions until just done. Drain and rinse under cold running water. Leave to drain in the colander, then toss with a splash of olive oil to prevent the noodles sticking."},{"Step 3":"Meanwhile, heat another good glug of olive oil in a large frying pan and fry the aubergine, turning regularly, until golden all over. Remove to a large plate lined with kitchen paper and sprinkle with salt."},{"Step 4":"In a large bowl, toss the noodles, dressing, mango, tofu, aubergine, onion, radishes and most of the herbs. Serve scattered with the remaining herbs."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/246.jpg"}