{"id":"234","title":"Cashew corn chowder with chipotle oil","difficulty":"Medium","portion":"Serves 4","time":"Hands-on time 30 min, plus soaking time","description":"”If you’ve never used cashews to replace regular cream or milk in a soup before, I highly recommend you try it. I’ve also added a drizzle of chipotle oil and a handful of coriander leaves to take the flavour to the next level.” – Sarah Britton","ingredients":["1 tbsp coconut oil","1 tbsp ground turmeric","2 tsp ground cumin","2 pinches cayenne pepper","3 onions, chopped","2 tsp salt, plus extra as needed","6 garlic cloves, very finely chopped","1 litre vegetable stock","4 corn cobs","93g raw cashews, soaked for at least 4 hours or up to overnight","1 tbsp lime juice","2 tbsp cold-pressed extra-virgin olive oil","¼ tsp ground chipotle chillies","Handful fresh coriander leaves and tender stems, roughly chopped, to garnish"],"method":[{"Step 1":"Melt the coconut oil in a large pan over a medium heat. Add the turmeric, cumin and cayenne, then cook for 1 minute or until fragrant. Add the onions and salt and cook for 5 minutes or until slightly softened. Add the garlic. If the bottom of the pan seems dry, add a little stock."},{"Step 2":"Meanwhile, carefully cut the kernels off the corn cobs by standing each cob on its end in a shallow bowl and slicing downwards with a sharp knife (away from your hand). "},{"Step 3":"Add the corn kernels to the onion mixture in the pan and stir to coat with the spices. Cook for 5 minutes, then add the rest of the stock. Bring to the boil, then reduce the heat to low and simmer for another 5 minutes or until the corn is bright yellow and tastes sweet."},{"Step 4":"Once the corn is cooked, remove the saucepan from the heat and transfer the mixture to a blender. Add the soaked and rinsed cashews along with the lime juice, put on the lid, then blend on high until smooth; add water to thin the soup, if you want to, then season to taste with salt. Alternatively, pour the mixture into a large bowl and blend with a stick blender. If not serving straightaway, return the soup to the pan and keep warm."},{"Step 5":"In a small bowl, whisk the olive oil with the ground chipotle until thoroughly blended. Serve the soup in bowls, topped with a drizzle of the chipotle oil and a sprinkle of chopped coriander. "}],"image":"https://apipics.s3.amazonaws.com/vegan_api/234.jpg"}