{"id":"215","title":"Vegan caramelised onion tart","difficulty":"Medium","portion":"Serves 8","time":"Hands-on time 30 min, simmering time 30 min, oven time 25 min","description":"A vegan and gluten-free tart recipe made with a cashew cream, sweet caramelised onions, spinach and a rich almond pastry case.","ingredients":["120g unroasted unsalted cashew nuts","2 garlic cloves","1 tbsp freshly squeezed lemon juice","60ml extra-virgin olive oil, plus extra for greasing","4 large onions, thinly sliced","1 tbsp rice malt syrup (see Know-how)","50g spinach","50g kale, sliced","1 tbsp cider vinegar","150g ground almonds","½ tsp sea salt","1 tsp bicarbonate of soda","½ tsp dried rosemary","60ml extra-virgin olive oil"],"method":[{"Step 1":"Lightly grease a 20cm loose-bottomed tart tin. To make the cashew cream, put the nuts, garlic and lemon juice in a food processor with a pinch of salt and 60ml water, then process until thick and creamy (or put in a bowl and whizz with a stick blender). Add more water if required."},{"Step 2":"For the filling, heat the olive oil in a large frying pan over a low heat. Add the onions and the rice malt syrup, season with salt and pepper, then cook for about 30 minutes or until the onions have caramelised. Add the spinach and kale, then cook for a further 10 minutes or until tender. Remove from the heat and drain off any excess liquid, then add the cider vinegar."},{"Step 3":"Heat the oven to 180°C/fan160°C/gas 4. To prepare the tart case, combine the ground almonds, sea salt, bicarb and rosemary in a large bowl and stir to combine."},{"Step 4":"In a separate bowl, whisk the olive oil with 1 tbsp water. Add to the dry ingredients and mix well to combine (it will be like a crumbly cookie dough). Spoon the mixture into the prepared tart tin, spread evenly over the base and up the sides and press it in with your fingers or a metal spoon. Remove any excess. Bake for 10 minutes."},{"Step 5":"Remove the tart case from the oven and allow to cool slightly, then add the cashew cream and top with the onion mixture. Return the filled tart to the oven and bake for a further 15 minutes or until the crust is golden and the filling is heated through."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/215.jpg"}