{"id":"18","title":"Vegan butternut squash risotto with millet","difficulty":"Easy","portion":"Serves 2","time":"Hands-on time 25 min. Simmering time 20 min","description":"Butternut squash, sage and hazelnuts are an iconic flavour combination synonymous with the colder months and work really well in this simple, plant based dinner. Using millet – a gluten-free grass seed – instead of rice to create the risotto adds to the earthy, nutty flavours.","ingredients":["½ (500g) butternut squash","Extra-virgin olive oil to drizzle and fry","2 garlic cloves, sliced","750ml of vegetable stock","100g of millet, see Tips","1 sage sprig, leaves picked","2 tbsp hazelnuts, roughly chopped","1 tsp white miso paste (make sure it’s gluten-free if you need it to be)","Pinch nutritional yeast flakes","2 tbsp oat fraiche (optional)"],"method":[{"Step 1":"Heat the oven to 200°C fan/gas 7. Remove the peel from around half the squash, leaving the other half unpeeled, then chop into 2cm pieces, keeping the peeled and unpeeled pieces of squash separate. Put the unpeeled squash on a baking tray, toss with a little oil, season with salt and pepper and roast for 25 minutes."},{"Step 2":"Meanwhile, put a medium lidded saucepan over a medium heat with a dash of oil then add the peeled butternut squash and sliced garlic. Cook for 5 minutes until starting to soften, then pour in 250ml of the vegetable stock. Cover and simmer until soft (about 12–15 minutes)."},{"Step 3":"Bring the remaining 500ml vegetable stock to the boil in a separate saucepan, then add the millet. Turn the heat down and gently simmer for 15 minutes. Heat a drizzle of oil in a small frying pan and add the sage leaves and chopped hazelnuts. Cook for a few minutes until golden and crisp, then drain on kitchen paper."},{"Step 4":"Once the squash and garlic are soft, drain (reserving the stock) and transfer to a blender. Add the miso and nutritional yeast, then whizz into a smooth sauce, adding back in a splash of the stock as needed. Stir the butternut purée through the millet, taste for seasoning, then divide between bowls and top with the roasted squash, hazelnuts, sage leaves and a spoonful of oat fraiche (if using)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/18.jpg"}