{"id":"63","title":"Jodhpuri mirchi vada (spiced chilli fritters)","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 1 hour ","description":"Vivek Singh shares his recipe for jodphuri mirchi vada, fried chillies with spiced potato stuffing. This delicious snack is eaten at Holi.","ingredients":["400g mild banana chillies (or jalapeños)","Oil for deep frying","Tamarind chutney to serve (optional)","250g floury potatoes (such as maris piper), unpeeled","½ tsp fennel seeds, crushed","½ tsp coriander seeds, crushed","1 green chilli, finely chopped","2 tbsp chopped fresh coriander leaves","1 tsp dried mango powder (see tip) or juice ½ lemon","½ tsp ground cumin","½ tsp chilli powder","Pinch ground asafoetida (see tip)","120g chickpea (besan) flour","¼ tsp chilli powder","Pinch ground asafoetida (see tip)","1 tsp carom seeds (see tip)","½ tsp nigella seeds","Pinch bicarbonate of soda (optional)","1 tsp salt","Digital probe thermometer","Kitchen paper"],"method":[{"Step 1":"For the stuffing, steam or boil the potatoes until tender. While still warm, peel, mash, then set aside."},{"Step 2":"Meanwhile, using the tip of a sharp knife, slit each chilli down one side, taking care to leave the stalk intact. Work from the stalk end and leave about 1cm uncut at the bottom to help the chilli hold its shape when stuffed. Remove the seeds with a teaspoon. Repeat for all the chillies."},{"Step 3":"Heat a glug of oil in a frying pan. Add the crushed fennel seeds and coriander seeds and sizzle for 30 seconds. Add the mashed potatoes, followed by the remaining stuffing ingredients. Season, mix well, then let the mixture cool to room temperature. Use the mixture to stuff the chillies (see Make Ahead)."},{"Step 4":"Fill a deep, heavy-based pan one-third full of oil and set it over a medium heat. For the batter, put the chickpea flour in a mixing bowl with the chilli powder, asafoetida, carom seeds, nigella seeds and bicarb (if using). Add the salt and 125-150ml water to make a thick batter."},{"Step 5":"Once the oil reaches 160°C-170°C on the digital probe (or a cube of bread turns brown in 40-50 seconds), dip the stuffed chillies in the batter to coat, then carefully add to the hot oil, working in batches."},{"Step 6":"Fry each batch for 5-6 minutes until golden and crisp, then use a slotted spoon to transfer the chillies to a plate lined with kitchen paper to drain. Serve hot with tamarind chutney, if you like."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/63.jpg"}