{"id":"33","title":"Smoky jollof rice","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 15 min. Simmering time 1 hour 20 min","description":"Jollof rice gets a smoky flavour boost in this delicious jollof recipe from Lerato Umah-Shaylor. One helping is never enough.","ingredients":["300g long-grain or basmati rice, thoroughly rinsed","250-400ml vegetable or chicken stock","2 tsp fine sea salt","2 plantains, sliced and fried, to serve (optional)","6 medium vine-ripened tomatoes or a 400g tin plum tomatoes","2-3 romano or red peppers, deseeded and roughly chopped","1 large onion, roughly chopped","5cm piece of ginger, peeled and roughly chopped","5 garlic cloves, roughly chopped","1-2 red or yellow scotch bonnet peppers, stalks removed and roughly chopped (wear gloves), or pierced and left whole","90ml coconut, rapeseed or vegetable oil","1 small red onion, finely sliced","2 tbsp tomato puree","2 tsp curry powder","2 tsp smoked paprika","1 bay leaf","1 tsp dried thyme","4-6 thyme sprigs, some thyme leaves picked and kept for garnish","Food processor"],"method":[{"Step 1":"Put all the puree ingredients in a food processor, except the scotch bonnets, if using whole, and whizz into a thick and aromatic puree."},{"Step 2":"Put the oil in a wide large saucepan, for which you have a tightly fitting lid, and set over a medium heat. Add the red onion and a pinch of fine sea salt. Cook for 15 minutes, stirring often, until softened and golden. If it starts to get dry, add a little splash of water to prevent the onion from burning."},{"Step 3":"Stir in the tomato puree and cook for 2-3 minutes, until the puree starts to separate. Add the spices and herbs and cook for 2 minutes, stirring continuously."},{"Step 4":"Gently pour in the blended puree, stirring well, then cover and cook for up 20 25 minutes, until the puree is reduced to a drier sauce. Keep a close eye on it and stir occasionally."},{"Step 5":"Add the rice and stock (about 250ml for basmati rice and up to 400ml for long-grain rice), ensuring there is enough water to just submerge the rice. Season with the fine sea salt and stir just once. Add the scotch bonnets, if using whole. Bring to a boil, then reduce the heat, cover and simmer over a low-medium heat for up to 30 minutes. The sauce must be visibly simmering to ensure the rice cooks properly."},{"Step 6":"Once the rice is cooked, remove the pan from the heat and leave covered to steam for a few minutes. Fluff with a fork, scatter over the reserved thyme leaves and enjoy your wonderful creation with a fresh salad and/or fried plantains, because jollof and plantains are a match made in heaven."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/33.jpg"}