{"id":"97","title":"Barbecued vegetables with tahini dressing","difficulty":"Easy","portion":"Serves 3-4","time":"Hands-on time 15 min, plus tending to the grill","description":"Barbecue aubergine, peppers, courgettes, padron peppers and runner beans for an easy vegan feast. Serve the barbecued veg with a herby shallot and tahini dressing.","ingredients":["2 medium courgettes (or 6 baby courgettes)","4 salad onions","4 medium shallots, unpeeled","8 large runner or helda beans","1 large aubergine","3 sweet peppers (red, orange or yellow)","100g padrón peppers","50g pine nuts","Vegetable oil for brushing","2 tbsp snipped chives","Handful coriander or flatleaf parsley (or a bit of both), roughly chopped","2 mint sprigs, leaves picked","Handful basil leaves","Small handful baby spinach leaves","1 tbsp tahini","1 tsp pomegranate molasses, plus extra to serve","½-1 large green chilli, chopped (optional)","4 tbsp extra-virgin olive oil","Juice ½-1 lemon","Barbecue (with a lid)","Food processor or blender (small is fine)","Heavy-based ovenproof frying pan"],"method":[{"Step 1":"Heat/light the barbecue for indirect grilling (the hot coals should be banked to one side). Once ready, brush the vegetables lightly with oil and add to the grill (not over the coals). Put the lid on and cook for 45 minutes, checking the coals and turning the veg every 15-20 minutes. Have a feel of the veg and remove the peppers, courgettes, onions, shallots and beans if they feel soft and tender – keep everything warm and covered. Slice the courgettes at this point and return them briefly to the grill, flesh side down, to give them char lines."},{"Step 2":"Stoke the barbecue (add more fuel if needed to get a flame going), then move the aubergine over the heat to char and blacken the skin. The aubergine needs to be very soft inside and should be turned regularly. It will take another 10-15 minutes or so."},{"Step 3":"Once the shallots are tender, make the dressing. Peel away and discard the skin from the shallots and add the bulbs to a food processor/blender along with the herbs, spinach, tahini, pomegranate molasses, chilli (if using) and oil. Whizz until smooth, then season to taste with the lemon juice and salt and black pepper. Set aside."},{"Step 4":"When the aubergine is nearly done, put your pan on the barbecue over the heat. Toss the padrón peppers in oil and sprinkle with salt, then add them to the pan to cook – they should take 6-8 minutes if the barbecue is hot. Add the pine nuts to the pan to toast gently near the end of cooking (watch them like a hawk as they burn easily)."},{"Step 5":"Arrange the veg on a platter and ‘carve’ them for easy serving: split open the aubergine to reveal the soft flesh inside and slice the peppers, releasing their juices. Arrange the courgettes, onions and beans around them on the plate. Spoon the dressing inside the aubergine and over the other veg, then scatter with the padrón peppers and pine nuts and drizzle with more pomegranate molasses."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/97.jpg"}