{"id":"302","title":"Jewelled bulgur wheat","difficulty":"Easy","portion":"Serves 6","time":"Takes 20 min to make, 30 min to cook, plus salting and resting","description":"Dried barberries are the ‘jewels’ in this bulgar wheat recipe. Find them in Persian grocers and Middle Eastern shops.","ingredients":["250g bulgur wheat","Sunflower oil or light olive oil for frying","2 small onions, halved and sliced paper thin","50g green sultanas (or yellow or standard sultanas)","50g dried barberries (optional – see tip)","3 tbsp olive oil","1 medium cucumber (about 400g), peeled, deseeded and diced, tossed with 2 tsp flaked sea salt, then left to drain for 30 minutes","1 medium red onion, finely diced","4 large vine tomatoes (100g each), deseeded and roughly chopped","80g unsalted shelled pistachio nuts","50g shelled walnuts, broken","40g dried sour cherries, roughly chopped (we used Forest Feast)","35g fresh mint, roughly chopped","70g fresh parsley, finely chopped","35g fresh dill, roughly chopped","2 large handfuls of good wrinkly, salty black olives, pitted","Grated zest of 1½ unwaxed lemons","Ground cinnamon to dust"],"method":[{"Step 1":"Wash the bulgur wheat in a sieve under running cold water until the run-off is no longer milky. Put in a pan with 500ml water over a medium heat. Bring to a gentle simmer and cook for 15-20 minutes or until the water has been absorbed."},{"Step 2":"Meanwhile, pour 2cm sunflower oil or light olive oil into a pan, heat it gently until shimmering, then fry the onions over a medium heat, stirring often, until golden brown. Remove the onions with a slotted spoon and drain on kitchen paper. They should be crisp but not burnt."},{"Step 3":"When the wheat is ready, remove it from the heat and scatter over the sultanas and dried barberries. Put a double-folded, clean tea towel over the pan, cover with the lid and leave for 15 minutes or so. The towel will absorb the steam and help prevent the wheat turning mushy."},{"Step 4":"While the wheat is still warm, fluff it up with a fork, then stir through the 3 tbsp olive oil. Season with salt, then tip into a large serving bowl and leave to come to room temperature. Add all the remaining ingredients except the onions and cinnamon, then mix. Season to taste."},{"Step 5":"Scatter a dusting of cinnamon over the wheat, sprinkle with the onions, then serve with the lamb."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/302.jpg"}