{"id":"200","title":"Koose black-eyed bean fritters with scotch bonnet salsa","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 1 hour","description":"”These delicious vegan bean fritters are also known as akara and are commonly eaten as a snack or breakfast food. Black-eyed beans are blended with spices, formed into patties and deep-fried until golden. I’ve added texture with sliced okra and red serrano chillies, but you can swap for green bell peppers and omit the chillies if you don’t like heat. They make a fantastic canapé or party snack, too.” – Zoe Adjonyoh","ingredients":["250g dried black-eyed beans","1 tbsp cornflour, plus extra to dust (see Zoe’s tip)","2 tsp cayenne pepper","1 tsp sea salt","1 tbsp rapeseed oil","½ red onion, very finely chopped","2 fresh red chillies, very finely sliced","4 fingers fresh okra, very finely chopped","500ml vegetable oil to deep fry","500g mixed heritage tomatoes, thinly sliced or quartered if small","1 medium red onion, finely chopped","1 scotch bonnet chilli, deseeded and finely diced","Handful fresh coriander, chopped","1/2 tsp cayenne pepper","Juice 1 lemon, plus extra slices to garnish","Digital probe thermometer"],"method":[{"Step 1":"If using dried beans, bring a pan of lightly salted water to the boil and cook the beans for 3 minutes, then remove from the heat and leave for 60-90 minutes. Drain and cool."},{"Step 2":"Once cool, gently mash the beans to break them up (don’t over-mash). Add the cornflour, cayenne, sea salt and rapeseed oil, then mix gently. Mix in the red onion, then the chillies. Mix in the okra last to help retain its crunchy texture. Once everything is mixed together, shape into quenelles or small plum-size balls and chill for at least 30 minutes."},{"Step 3":"Meanwhile, mix together all the ingredients for the salsa and season to taste with salt and black pepper."},{"Step 4":"Heat the vegetable oil in a large, heavy-based saucepan (don’t fill more than halfway) to 160°C on a digital probe thermometer. (If you don’t have one, a small cube of bread will brown in 30-40 seconds when the temperature is reached.) "},{"Step 5":"Deep-fry the fritters, in batches, for about 4-5 minutes until golden brown, then drain on kitchen paper. Serve with the scotch bonnet salsa and garnish with a dollop of avocado mayo, if you like (see food team’s tip)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/200.jpg"}