{"id":"189","title":"Hasselback potatoes with ‘cheese’ sauce","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 20 min, oven time 30-35 min","description":"What’s better than crispy hasselback potatoes? Spuds smothered in a silky cheese sauce, that’s what. And this whole dish is vegan too. You can’t go wrong.","ingredients":["500g baby new potatoes","3 tbsp rapeseed oil","1 tbsp dried rosemary","2 tsp sea salt","1 tsp cracked black pepper","Finely grated zest 1 lemon","1 garlic clove, crushed","Handful fresh chives, chopped, to serve","Handful dried cranberries to serve","80g raw cashew nuts, soaked in freshly boiled water for 15 minutes","120ml filtered cold water","120ml cold non-dairy milk","2 tbsp tapioca starch (see Know-how)","3 tbsp nutritional yeast (see Know-how)","1 tsp tahini","1 tsp white miso","Pinch each sea salt and white pepper"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. Grab a wooden spoon and sit a potato in the bowl of the spoon. Starting at one end, cut across the potato widthways at 3mm intervals. The spoon will stop you cutting right through the potato. Carry on until you’ve sliced all the potatoes, putting them into a roasting tray as you go."},{"Step 2":"Mix the oil, rosemary, salt, pepper, lemon zest and crushed garlic in a small mixing bowl, then use a pastry brush to brush the mixture all over the potatoes, making sure you get down into the cuts. Once all the potatoes are coated, bake for 30-35 minutes or until golden (see tip)."},{"Step 3":"While the potatoes are in the oven, whizz together the ‘cheese’ sauce ingredients in a blender or food processor until smooth, then pour into a small saucepan."},{"Step 4":"Heat the sauce over a low heat, stirring constantly, until it’s thick and creamy (see Make Ahead)."},{"Step 5":"When the potatoes are cooked, sprinkle over the chives and dried cranberries and serve straightaway with the sauce on the side or drizzled over the top."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/189.jpg"}