{"id":"129","title":"Asparagus and quinoa salad with peas and broad beans","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 15 min. Simmering time 10 min, plus cooling","description":"Spring produce such as asparagus, peas, broad beans and lovage are the star players in this vegan salad recipe. If you can’t find lovage, parsley would work well too.","ingredients":["12-16 asparagus spears","500g broad beans, podded","150g quinoa, rinsed","300g peas, podded if fresh, or frozen","6-8 spring onions, trimmed and sliced into 1cm pieces","Small handful chives, finely chopped (plus chive flowers to garnish if you can find them)","Small handful each flatleaf parsley and mint leaves, finely chopped, plus a few whole leaves to garnish","Handful lovage, leaves picked and finely chopped, plus a few left whole to garnish","A few fennel tops (optional)","Squeeze of lemon","2 tsp dijon mustard","2 tbsp extra-virgin olive oil","1 tbsp sunflower oil","2 tbsp cider vinegar","2 tsp unrefined caster sugar"],"method":[{"Step 1":"Whisk together all the ingredients for the dressing (or put in a jar with a screw-top lid and shake). Set aside."},{"Step 2":"Cut the asparagus into 3cm pieces. If the broad beans are big, it’s worth dropping them in boiling water for 1-2 minutes, then peeling off their leathery skins. If they’re young and sweet, you won’t need to do this."},{"Step 3":"Put the quinoa in a pan and cover with plenty of cold water – about 3 times as much water as quinoa. Bring to the boil, then simmer for about 10 minutes until tender. Drain, then return to the pan."},{"Step 4":"Add the asparagus, broad beans, peas and spring onions to the hot quinoa and pour over the dressing. Stir everything together carefully, then allow to cool to room temperature, stirring once or twice as it cools (see Make Ahead). Fold the herbs into the salad and add a squeeze of lemon juice and plenty of salt and black pepper to taste."},{"Step 5":"Tumble the salad out onto a platter or divide among individual plates. Scatter over a few tender herb leaves, chive flowers and fennel fronds to garnish, then serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/129.jpg"}