{"id":"99","title":"Easy homemade bagels","difficulty":"Medium","portion":"Makes 6 bagels","time":"Hands-on time 20 min, plus resting/proving/overnight proving, oven time 20 min","description":"Bake Off champion David Atherton shows you how to get that crucial chewy texture (and the correct sized hole) when you make the New York deli favourites. Scroll on down to watch a video showing you how to make the bagels.","ingredients":["1 tbsp malt extract","50g prunes","225g warm water","350g strong white bread flour","50g strong wholemeal bread flour","4g fast action yeast","6g fine salt","20g poppy seeds","1 tsp vegetable oil","2 tbsp malt extract","1/2 tsp bicarbonate of soda","Caraway seeds, for scattering on top","Sesame seeds, for scattering on top","Blender or food processor","Large baking tray lined with compostable baking paper","Compostable cling film"],"method":[{"Step 1":"Blend together the malt extract, prunes and warm water until fully combined and smooth."},{"Step 2":"Put the flours, yeast, salt and poppy seeds into a large mixing bowl, add the wet mixture and mix to form a dough. Knead for 5 minutes in the bowl, adding a little more flour if the dough is very sticky, then leave, covered with a tea towel, for 30 minutes."},{"Step 3":"Divide the dough into 6 pieces (each about 110g). Shape each piece into a tight ball. Shape your bagel by sticking your finger through the middle and stretch it outwards (you want it to be twice as wide as you would like the final hole, as it will rise when baked)."},{"Step 4":"Put the bagels on the prepared baking tray, leaving enough room around them to rise. Pour the vegetable oil into a reusable proving bag. Now cover the bagels with this and place in the fridge for about 10 hours or overnight."},{"Step 5":"The next morning heat the oven to 180°C fan/gas 6."},{"Step 6":"Fill a large saucepan with 2 litres of water, add the malt extract and bring to the boil. Reduce to a simmer then add the bicarbonate of soda (make sure the heat is low as the bicarb will make the water foam and overflow if it is still boiling)."},{"Step 7":"Gently drop in each bagel and poach for 45 seconds on each side. Place [Put] the poached bagels back onto the baking tray and sprinkle with the caraway and sesame seeds. Bake for 18 minutes until golden."},{"Step 8":"Place the bagels on a wire rack to cool. Store in an airtight container for up to 2 days, or slice in half and freeze."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/99.jpg"}