{"id":"188","title":"Grilled mango and coconut ‘pannacotta’","difficulty":"Easy","portion":"Makes 6","time":"Hands-on time 25 min, plus at least 4 hours chilling","description":"If you think it’s not possible to enjoy joyful, indulgent desserts on a vegan diet, think again. This pannacotta by Gaz Oakley is silky smooth and served with grilled mango, a mango dressing and sprinkled with crunchy coconut flakes.","ingredients":["400ml tin full-fat coconut milk","35ml vegan rum (optional)","1 vanilla pod, seeds scraped out (or 2 tsp vanilla bean paste)","250ml non-dairy milk","5-6 tbsp coconut honey (see Know-how) or maple syrup to taste","65g cornflour","200g ripe mango, peeled and cubed","½ tsp chilli flakes","1 tbsp coconut oil, plus extra for greasing","½ ripe mango, peeled and cut into 2.5cm-thick slices","2 tbsp coconut sugar","Fresh mint leaves, chopped","Coconut flakes, lightly toasted","6 x 150ml dariole moulds or ramekins, lightly greased with coconut oil and bases lined with non-stick baking paper"],"method":[{"Step 1":" Gently heat the coconut milk and rum in a saucepan. Add the vanilla pod and seeds or paste. Leave to infuse while you whisk the non-dairy milk, cornflour and coconut honey/maple syrup until smooth. Scrape the cornflour mixture into the pan and simmer for 4-5 minutes, stirring constantly, until it has thickened."},{"Step 2":"Remove from the heat, remove the vanilla pod and spoon the mix into the moulds. Tap them on the surface to level out. Cover with cling film and refrigerate for at least 4 hours, or overnight (see Make Ahead)."},{"Step 3":"Whizz the dressing ingredients in a blender until smooth, adding a little water if the dressing is too thick. Before serving, heat a griddle pan over a high heat. Melt the coconut oil, then add the mango slices and griddle for 2-3 minutes until lightly charred. Sprinkle over coconut sugar and cook for another minute or so until caramelised."},{"Step 4":"To turn out the pannacotta, dip the base of each mould into hot water to loosen, then invert onto a serving plate. Serve with the dressing, mango, mint and coconut flakes."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/188.jpg"}