{"id":"272","title":"Palestinian maftoul salad","difficulty":"Easy","portion":"Serves 4-6 as a starter or side","time":"Hands-on time 25 min, simmering time 20 min","description":"Allegra McEvedy’s vibrant, Palestinian salad recipe is a great vegetarian starter on it’s own or as a side for grilled chicken or fish","ingredients":["80ml Fairtrade Palestinian olive oil","3 onions, sliced","4 garlic cloves, chopped","2 green chillies, deseeded and finely chopped","250g maftoul, rinsed and drained","600ml vegetable stock","60g raisins","3 roasted red peppers (from a jar), rinsed, patted dry and finely sliced","1 cucumber, seeds removed, chopped into small cubes 3 spring onions, finely sliced","2 handfuls fresh flatleaf parsley, roughly chopped","Handful fresh mint, roughly chopped","Juice 2 lemons","2 tbsp Fairtrade Palestinian za’atar or sumac (find both of these in larger supermarkets","or speciality shops)100g Fairtrade almonds, skin on, roughly chopped"],"method":[{"Step 1":"Put a large, wide saucepan over a medium heat with half the olive oil. Once the oil is hot (but not smoking) add the onions and cook, stirring, for a few minutes, then add the garlic and chillies and cook for 5-7 minutes more until the onions are soft and beginning to caramelise."},{"Step 2":"Add the maftoul, increase the heat and stir well – the maftoul should be coated in the oil and fried for a couple of minutes. Add the vegetable stock, bring to the boil, add the raisins and a couple of pinches of salt, then turn down the heat to a simmer and cook for about 20 minutes until the maftoul is cooked and the liquid is absorbed."},{"Step 3":"Once cooked, spread out the maftoul mixture on a tray to cool – don’t add any of the vegetables/greenery until it’s room temperature. In a big bowl, mix the cooled maftoul with the peppers, cucumber, spring onions and herbs, then stir in the rest of the olive oil, the lemon juice and some salt and pepper to taste. Serve at room temperature, scattered with za’atar and chopped almonds."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/272.jpg"}