{"id":"23","title":"Ultimate vegan gravy","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 30 min. Oven time 40 min, plus simmering time 1 hour.","description":"Chef Harriet Mansell has created the ultimate vegan gravy recipe, with all the depth and umami of its meaty counterpart. The gravy makes the most of roast and fried alliums, smoked oil and umami-rich miso and mushrooms, but what really elevates it is the roasted yeast, adding an intensity even  meaty gravies struggles to achieve.","ingredients":["16 shallots","2 leeks, cleaned","2 garlic bulbs, cloves separated and peeled","Rapeseed oil to fry and drizzle","250g fresh yeast (see Know How)","2 tbsp smoked rapeseed oil (see tips)","250g white mushrooms, sliced","1 tsp white miso paste (make sure it’s gluten-free if needed)","Pinch mixed spice","Splash ruby port","Splash cider brandy (optional)","1 tbsp balsamic vinegar","4 celery sticks, roughly chopped","Handful dried mushrooms, roughly chopped","½ bunch thyme","½ bunch chives","Handful chervil or parsley","Pinch freshly grated nutmeg","1 tbsp cornflour, mixed with 1 tbsp water (optional"],"method":[{"Step 1":"Heat the oven to 180°C fan/gas 4. Divide the shallots, leeks and garlic into two even piles. Roughly chop one pile and finely slice the other. Add the roughly chopped veg onto a baking tray, drizzle with oil and season with salt. Put in the oven to roast for 40 minutes until a deep golden brown."},{"Step 2":"Meanwhile, line a separate large baking tray with baking paper, then crumble the fresh yeast into it, drizzling over half the smoked rapeseed oil. Put in the oven and cook for 30-40 minutes, stirring occasionally. The yeast will initially melt but will then begin to brown and form a crust (it looks a little like crispy chicken skin)."},{"Step 3":"While the veg and yeast roast, add a generous drizzle of oil to a large saucepan over a medium heat. Once hot, add the finely sliced vegetables and cook for 15-20 minutes, stirring occasionally, until golden and caramelised. Add half the mushrooms and continue cooking until they release their liquid and begin to colour too."},{"Step 4":"Once the mushrooms and sliced veg are cooked, put the roasted vegetables in the saucepan with the fried veg. Pour in just enough water to cover, then add the miso, mixed spice, port, cider brandy (if using), balsamic vinegar and the remaining smoked rapeseed oil. Bring to a simmer with the lid on, then add the roasted yeast, which will thicken the liquid and make it look creamy. Simmer (covered) for 30 minutes to get as much flavour out of the solids into the liquid as you can."},{"Step 5":"Add the remaining mushrooms, half the celery, the dried mushrooms and half the thyme sprigs. Cover and continue to simmer for another 20-30 minutes."},{"Step 6":"Add the remaining celery and thyme along with the chives, chervil (or parsley) and the nutmeg, then remove from the heat. Give the gravy a stir, then season to taste with salt and pepper. Strain through a fine sieve, squishing the solids with a spoon to get as much liquid/flavour out of them as possible, either into a gravy jug (if serving right away) or a lidded container to cool and then keep in the fridge or freezer. If you like your gravy thicker, you can whisk in the slaked cornflour whilst the (strained) gravy is still very hot."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/23.jpg"}