{"id":"14","title":"Cauliflower with olives, preserved lemons and giant couscous","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min. Oven time 45 min","description":"This fragrant vegan one-pot with cauliflower and giant couscous nods to a Moroccan classic. Perfect served as is for a light lunch or supper.","ingredients":["6 tbsp olive oil","1 medium cauliflower, separated into small florets, rinsed in cold water and drained","1 onion, finely sliced","1 tbsp finely grated garlic","1 small (50g) preserved lemon, pips discarded and finely chopped","800ml vegetable stock, hot","100g pitted green olives","400g tin chickpeas, drained","350g giant couscous","3-4 tbsp chopped coriander","Large pinch saffron","1 tsp ground ginger","½ tsp ground cumin","½ tsp mild paprika","¼-½ tsp cayenne pepper (depending on how spicy you like things)","½ tsp ground turmeric"],"method":[{"Step 1":"Heat the oven to 180°C fan/gas 6. To make the spice paste, mix the spices in a small bowl with 2 tbsp water and set aside."},{"Step 2":"Heat 4 tbsp of the oil in a wide, shallow lidded pan over a low heat. Add the rinsed cauliflower florets along with a sprinkle of salt and cook, with the lid on, for 10-12 minutes, occasionally turning the florets over until caramelised. Transfer to a bowl, leaving as much of the oil in the pan as possible."},{"Step 3":"Increase the heat to medium and add the remaining oil. Add the onion and a pinch of salt and cook for 7-10 minutes until very soft but not starting to colour. Add the grated garlic and cook for 2 minutes more, then add the spice paste and chopped preserved lemon and cook for another minute. Add the stock, olives and chickpeas along with 1½ tsp salt. Now add the couscous, mixing well to ensure it is distributed evenly."},{"Step 4":"Lay the browned cauliflower florets on top. Bring to a simmer, then cover with the lid and put in the oven for 20 minutes until the cauliflower is totally tender, the couscous puffed up and most of the stock is absorbed. Give everything a good mix around, then sprinkle over the fresh coriander and serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/14.jpg"}