{"id":"109","title":"Golden sauerkraut","difficulty":"Easy","portion":"Makes 2 x 500ml jars","time":"Hands-on time 30 min, plus overnight soaking and 10-14 days fermentation","description":"If you’re keen to try your hand at the ancient art of fermenting, creating a jar or two of sauerkraut is a great place to start. James Strawbridge’s sunshine-bright, tangy kraut is full of flavour and has the additional upside of being good for your gut.","ingredients":["1 whole cabbage, such as savoy, white, hispi, Chinese, kale or other brassicas (about 900g), very finely sliced – use a mandoline if you have one","1 tbsp grated garlic (optional)","1 tbsp grated fresh turmeric or 2 tsp ground turmeric","Fine sea salt","2 x 500ml preserving/fermentation jars (see Know-how)","Pestle or rolling pin","Mandoline","Fermentation weights, sterilised (see Know-how)"],"method":[{"Step 1":"Set a large mixing bowl or oven dish on a set of scales. Put the sliced cabbage into the bowl with the garlic (if using) and turmeric and weigh. Calculate 2 per cent of the total weight to find the amount of salt you need (total weight in grams ÷ 100 x 2 = the amount of salt in grams). Cover the veg evenly with the salt, then massage the cabbage with your hands to break down the cellulose.<img decoding=\"async\" class=\"alignnone size-full wp-image-43660\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2021/02/making-of-kraut.jpg\" alt=\"\" width=\"600\" height=\"600\" />"},{"Step 2":"Lightly cover and leave at room temperature overnight. In the morning, use a pestle or rolling pin to ram the salted cabbage into the sterilised jars, ensuring you squeeze out air pockets and completely submerge the cabbage in its own brine. If necessary, press the cabbage beneath the surface of the liquid with fermentation weights (see James’s tips and Know-how)."},{"Step 3":"If using fermentation jars, open the valve. If using preserving jars, leave the lids loose enough to allow gases that build up while the kraut ferments to escape."},{"Step 4":"Leave to ferment at room temperature (18-22°C or warmer for a fast ferment, cooler for a slower, more full-bodied ferment) for 10-14 days. Once fermented, seal, label and store until you want to serve (see Make Ahead)<img decoding=\"async\" class=\"alignnone size-full wp-image-43660\" src=\"https://www.deliciousmagazine.co.uk/wp-content/uploads/2021/02/jars-600.jpg\" alt=\"\" width=\"600\" height=\"600\" />"}],"image":"https://apipics.s3.amazonaws.com/vegan_api/109.jpg"}