{"id":"55","title":"Prassinopita (celebration of greens pie)","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 40 min, plus salting and proving. Oven time 25-30 min.","description":"Georgina Hayden’s prassinopita is her vegan take on Greek spanakopita. This celebration of greens pie is crammed with courgette and spinach and topped with sesame.","ingredients":["400g strong white bread flour, plus extra to dust","2 tsp fine sea salt","1 tbsp caster sugar","½ x 7g sachet fast-action dried yeast","4 tbsp olive oil, plus extra to grease","1 medium courgette (around 200g)","1 leek","4 spring onions","200g baby leaf spinach","¼ tsp fennel seeds","Bunch dill","Bunch flatleaf parsley","1 tsp freshly ground white pepper","1 lemon","2 tbsp sesame seeds","3 tbsp honey (or agave syrup, if you need the recipe to be vegan)"],"method":[{"Step 1":"Put the flour in a large mixing bowl (or the bowl of a stand mixer) and mix in 1 tsp of the sea salt. In a jug, mix the sugar and yeast with 225ml warm water. Leave for a few minutes. Use your fingers to rub the olive oil into the flour (or use a dough hook), then make a well in the middle. Mix in the yeast water, adding a few more tablespoons of water if the dough needs it to come together – you don’t want it to be dry. Turn out the dough onto a lightly floured surface, then knead for 8–10 minutes until smooth and elastic. Alternatively, use a stand mixer with a dough hook Transfer the kneaded dough to a clean, lightly oiled bowl and leave to prove for 1 hour."},{"Step 2":"While the dough is proving, prepare the filling. Trim and slice the courgette lengthways, then finely slice each half. Trim and slice the leek the same, then put in a colander and rinse thoroughly to remove any grit. Finely slice the spring onions. Put them all in a large colander with the baby leaf spinach and scrunch in the remaining 1 tsp salt, really turning the vegetables. Leave the colander in the sink for 30 minutes, scrunching it all together again halfway through."},{"Step 3":"Heat your oven to 200°C fan/gas 7. Grind the fennel seeds using a pestle and mortar. Finely chop the dill and flatleaf parsley. Scrunch the filling in the colander one last time and really squeeze out the excess liquid – it should look as if the greens have been wilted down. Transfer to a large mixing bowl. Add the chopped dill and parsley, the white pepper and the juice from the lemon, the mix into the greens by hand."},{"Step 4":"Turn the dough out onto a lightly floured worktop and pat into a ball. Roll or push it out into a circle about 35cm diameter, then heap the salted greens in the middle of the dough. Bring up the sides over the filling and join them together in the middle so you have a big pie."},{"Step 5":"Drizzle a little oil into a 24cm ovenproof frying pan. Carefully flip the pie into it (so it’s seam-side down), patting and easing it in. Drizzle the top of the pie with a little more olive oil, then pat on the sesame seeds and ground fennel seeds. Put the pan over a medium heat and cook for 2-3 minutes until the pie starts to sizzle, then transfer the pan to the oven. Bake for 25-30 minutes until golden all over. Remove the pie from the oven and drizzle with the honey/agave. Leave for 5 minutes before serving warm – or serve at room temperature."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/55.jpg"}