{"id":"42","title":"Vegan kimchi","difficulty":"Easy","portion":"Makes 1.5 litres (including the cabbage and juices) ","time":"Hands-on time 15 min, plus 6-8 hours soaking and at least 3 days fermenting ","description":"Make vegan kimchi with Ching He Huang’s step-by-step recipe. Swap traditional fish sauce for red miso to make this funky, fermented cabbage dish vegan friendly.","ingredients":["2 chinese cabbages","65g sea salt flakes","1 daikon/mooli, peeled and sliced into julienne strips (matchsticks) – see Know How","3 spring onions, trimmed and cut into 5cm slices","2.5cm piece fresh ginger, peeled","8 garlic cloves, peeled","2 shallots, peeled","6 tbsp gochugaru (Korean red pepper flakes), or more if you like it spicier – see Know How","2 tbsp red miso paste (from Waitrose and online suppliers – see Ching’s tip)","2 tsp caster sugar","1 tbsp glutinous rice powder (optional; also known as glutinous rice flour – see Know How)","Sesame seeds, toasted in a dry pan, to serve (optional)"],"method":[{"Step 1":"Reserve 1-2 outer leaves of the cabbages. Wrap them in damp kitchen paper and put in the fridge until needed. Shred the remaining cabbage and put in a large, deep pot or bowl. Add the salt and toss well. Add enough cool water to cover the cabbage and stir until the salt has dissolved. Put a plate on top to keep the cabbage submerged, then leave at room temperature for 6-8 hours or overnight (stir halfway through if possible)."},{"Step 2":"Drain the cabbage, reserving the brine. Rinse the cabbage, squeeze out any excess water, then return it to the bowl, adding the daikon/mooli and spring onions. Put the ginger, garlic, shallots, gochugaru, red miso paste and sugar in a food processor. Add the rice powder, if using. Pulse until the mixture forms a paste, then spoon the paste over the vegetables. Using tongs or gloves, mix and massage the vegetables and paste together until well coated. Pack the mixture into a sterilised 2 litre jar, leaving 3-5cm space at the top (see Ching’s tips for success). Add enough of the reserved brine to just cover the vegetables, pressing them down a bit. Place the whole cabbage leaf or leaves over the top, pressing down – this should help keep the kimchi submerged under the brine (or see Ching’s tips for success)."},{"Step 3":"Cover loosely (to allow air to escape) and put the jar in a baking dish or large bowl to collect any juices that escape (see Ching’s tips for success). Leave the jar in the kitchen, out of direct sunlight, for 3 days. During this time, you can press down on the kimchi daily with the back of a wooden spoon to keep it all submerged."},{"Step 4":"After 3 days the kimchi will be ready, but it won’t achieve its full flavour and complexity for about another 2 weeks, so I suggest you seal the jar and transfer it to the fridge, where the kimchi will continue to slowly ferment (see Ching’s tips for success)."},{"Step 5":"To serve, scoop out using a slotted spoon, transfer to a side dish and dress with toasted sesame seeds. It’s delicious on top of noodle soups or stews – or added to a stir-fry. Enjoy!"}],"image":"https://apipics.s3.amazonaws.com/vegan_api/42.jpg"}