{"id":"141","title":"Vegan mushroom wellington","difficulty":"A challenge","portion":"Serves 8","time":"Hands-on time 1 hour, oven time 50 min, plus chilling ","description":"Hosting a vegan Christmas this year? Make the main event this showstopping mushroom wellington by the boys behind BOSH!, Henry Firth and Ian Theasy. It’s crammed with chestnuts and pecans for extra crunch and richness, then wrapped in vegan puff pastry and glazed with maple syrup. Amazing!","ingredients":["500g chestnut mushrooms","8 fresh thyme sprigs","4 fresh rosemary sprigs","2 fresh sage sprigs","8 garlic cloves, peeled","Olive oil for drizzling","4 sun-dried tomatoes, thinly sliced, plus 3 tbsp oil from the jar","4 banana shallots, thinly sliced","1 carrot, peeled and finely grated","1 celery stick, diced","200g cooked chestnuts","200g pecans","200ml red wine (vegan if necessary)","2 ½ tbsp cranberry sauce","1 bay leaf","½ tsp freshly grated nutmeg","½ tsp ground cinnamon","100g dried breadcrumbs","2 x 320g sheets ready-rolled vegan puff pastry","2 tbsp unsweetened plant-based milk, plus extra for brushing","1 tbsp maple syrup","Food processor; compostable baking paper"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. Sort through the mushrooms and pick out 10 of the best-looking ones, making sure you’re left with about 300g mushrooms. Set the 10 reserved mushrooms on a piece of foil with half the fresh herbs (thyme, rosemary, sage) and 3 whole garlic cloves. Drizzle with olive oil, add salt and freshly ground black pepper, then tightly seal in the foil and roast for 30 minutes."},{"Step 2":"Spoon the sun-dried tomato oil into a large, deep frying pan over a medium heat, add the shallots and fry for 5 minutes until soft. Add the sun-dried tomatoes and grate over the remaining garlic cloves, then stir for 1 minute. Finely chop the remaining herbs, then add to the pan with the carrot and celery and cook, stirring, for 4-5 minutes."},{"Step 3":"Meanwhile, tip the remaining mushrooms into the food processor and whizz to chop finely/mince, then scrape into a bowl. Clean the bowl of the processor, add half the chestnuts and all the pecans, then whizz to coarse crumbs. Roughly chop the remaining chestnuts and set aside."},{"Step 4":"Add the chopped/minced mushrooms to the pan, increase the heat to high and cook for 10 minutes until the mushrooms have cooked down. Pour over the red wine, then add the cranberry sauce and bay leaf. Simmer for 6-7 minutes until most of the liquid has evaporated. Reduce the heat, add the nutmeg and cinnamon, then stir for 1 minute."},{"Step 5":"Remove the roasted mushrooms from the foil (set aside) and pour any cooking liquid left in the foil into a large bowl. Add the roughly chopped chestnuts, breadcrumbs and whizzed nuts to the bowl, then mix everything together with a spoon."},{"Step 6":"Add the mushroom mixture (remove the bay leaf first) to the bowl and mix everything together to form a thick, textured filling. Leave to cool to room temperature (see Make Ahead)."},{"Step 7":"Unroll one sheet of pastry onto a baking sheet lined with baking paper. Spread half the cooled mushroom mixture lengthways down the middle of the pastry, then use your hands to mould it into a flat rectangular shape, leaving at least 5cm pastry clear on each side. Put the roasted mushrooms along the top of the mixture in 2 neat rows (discard the roasted garlic and herbs). Layer the rest of the mushroom mixture over the top, encasing the whole mushrooms completely. Smooth and shape into a neat rectangular mound."},{"Step 8":"Brush a little of the plant-based milk around the exposed pastry edge using a pastry brush or your finger. Set the second pastry sheet over the filling and smooth it down well, ensuring there are no air bubbles. Seal the edges by pressing the pastry sheets together all the way around the filling with your fingers. Trim any excess pastry from the edges, leaving a 1.5cm crust around the base of the parcel. Use a fork to crimp all around the edges of the pastry to firmly seal the pastry."},{"Step 9":"Using the tip of a sharp knife, score a criss-cross pattern across the top of the pastry and pierce a few air vents in the top. If you’re feeling creative, cut a few decorative shapes from the excess pastry, brush the bottom with plant-based milk and stick them on top. Put the baking sheet in the fridge for 20 minutes to chill the criss-cross and firm it up."},{"Step 10":"Take the criss-cross out of the fridge, put it in the hot oven and bake for 25 minutes."},{"Step 11":" Meanwhile, make a glaze by pouring the maple syrup and 2 tbsp plant-based milk into a small dish and mixing together. After 25 minutes, take the Christmas criss-cross out of the oven and brush it all over with the glaze. Return to the oven and bake until golden brown and crisp – about 25 minutes more. Cut into slices and serve immediately with all the usual Christmas dinner trimmings."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/141.jpg"}