{"id":"210","title":"Jollof beans (black-eyed beans in tomato sauce)","difficulty":"Easy","portion":"Serves 4","time":"Hands on time 15 min, simmering time 1 hour 40 min, plus overnight soaking and resting","description":"Try journalist Kemi Bamgbose’ fiery jollof beans, made with scotch bonnet chilli for extra heat. It’s surprisingly thrifty to make too.","ingredients":["250g dried black-eyed beans","400g tin tomatoes","1 large onion, chopped","1 red pepper, roughly chopped","1 garlic clove, crushed","1 tsp ground ginger","½ scotch bonnet chilli, deseeded","Sunflower or olive oil for frying","½-1 tsp Dunn’s River All Purpose Seasoning ","1-2 tsp Maggi Liquid Seasoning ","Handful freshly chopped parsley ","Handful chopped fresh coriander","Squeeze lime juice (optional)","Cooked rice, bread, couscous or fried plantain to serve"],"method":[{"Step 1":"Pick through the black-eyed beans and discard any stones or cracked beans. Put in a bowl with plenty of cold water and soak overnight."},{"Step 2":"The next day, rinse the beans and drain, then put in a pan, cover with cold water and cook, covered, over a medium heat for 60-75 minutes until tender. Top up the water in the pan if necessary. Don’t add salt as it will harden the beans."},{"Step 3":"Once the beans are soft and cooked, drain and put in a bowl. Season with a little salt and, using a potato masher, mash the beans slightly, so they’ll absorb more of the flavour from the sauce. "},{"Step 4":"Meanwhile, make the tomato sauce. In a food processor/blender, whizz the tomatoes, half the chopped onion, the red pepper, garlic, ginger and scotch bonnet to a paste."},{"Step 5":"Heat a large saucepan with a glug of oil. When the oil is hot, add the remaining chopped onion to the pan and soften over a low-medium heat for 5 minutes. Pour in the blended tomato mixture, cover and cook on a low heat for 10-15 minutes."},{"Step 6":"Stir in the crushed beans, then season to taste with ½-1 tsp of the all purpose seasoning and 1-2 tsp Maggi liquid seasoning. If the sauce is a little thick in consistency, add a splash of water to thin. Stir well, then cover the pot and simmer the beans for another 15-20 minutes, stirring occasionally to make sure the beans are covered in sauce and the mixture doesn’t look dry (adda splash of water if it does)."},{"Step 7":"Once the beans are cooked, let them rest in the pan for an hour or more, so the flavours can settle. Warm the beans through and stir in the chopped parsley and coriander. Add a squeeze of lime juice, if you like, and serve with rice, bread, couscous or plantain as you wish."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/210.jpg"}