{"id":"43","title":"Pomegranate-glazed aubergines and courgette tabbouleh","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 20 min","description":"Pair pomegranate-glazed aubergines and an easy courgette tabbouleh for a low-effort, big-flavour dinner. Roast or barbecue the aubergines.","ingredients":["2 large aubergines, halved lengthways","2 tbsp pomegranate molasses","1 tbsp maple syrup","1 tsp cumin seeds, crushed","Olive oil for drizzling","180g quinoa, ideally a mixture of white, red and black","3 tbsp extra-virgin olive oil","Juice ½ lemon","1 small garlic clove, chopped","200g cherry tomatoes, sliced","1 courgette, coarsely grated","30g parsley, roughly chopped","4 mint sprigs, leaves picked and roughly chopped","3 tbsp tahini","Squeeze lemon juice","3 tbsp ice-cold water"],"method":[{"Step 1":"Prepare the barbecue for direct heat (for cooking right over the coals; or see alternative cooking instructions above). Score the aubergine flesh in a criss cross without cutting the skin. In a small bowl, mix the pomegranate molasses, maple syrup and cumin seeds with a drizzle of oil. Drizzle the aubergines with oil and barbecue skin-side down for 10 minutes until tender. Flip, then brush the flesh side with most of the glaze. Adjust the coals, then cook indirectly for 8-10 minutes with the lid down, flipping halfway through, until sticky and charred. Set aside on a plate and brush with the remaining glaze."},{"Step 2":"Meanwhile, for the tabbouleh, follow the pack instructions to cook the quinoa, then rinse and drain well. Put the olive oil, lemon juice (setting aside a squeeze for the dressing) and garlic in a large bowl and whisk to combine, then add the tomatoes, courgette, mint and quinoa. Season and mix."},{"Step 3":"Stir the remaining squeeze of lemon into the tahini, then gradually whisk in the water to make a smooth sauce. Divide the quinoa among plates, top each with an aubergine half and drizzle with dressing to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/43.jpg"}