{"id":"116","title":"Whisky marmalade","difficulty":"Medium","portion":"Makes 4 x 500ml jars","time":"Hands-on time 20 min, simmering time 1-2 hours, plus cooling","description":"James Strawbridge’s classic marmalade will fill your kitchen with the scent of oranges and your cupboard with jars of bittersweet loveliness. Enjoy this on toasted sourdough or brioche, in cakes or, thanks to its distinctive bitterness, use as a glaze for savoury dishes such as ham, salmon, chicken – or these sticky, marmalade-glazed pork ribs.","ingredients":["1.5kg seville oranges","Juice 2 lemons","1.5kg granulated sugar","50ml whisky (optional)","Heavy-based stainless steel preserving pan/large saucepan","Fine sieve or muslin bag","4 x 500ml preserving jars and lids, sterilised (see Know-how)","4 baking paper discs for the jars","Electronic scales with back-to-zero function"],"method":[{"Step 1":"Start by scalding the whole oranges in a pan of boiling water for 15-30 seconds to remove any wax (if using unwaxed oranges, skip this step), then transfer to the preserving pan with the lemon juice."},{"Step 2":"Cover the oranges with 2 litres fresh cold water and bring to the boil, reduce the heat, then simmer for 1-2 hours until soft."},{"Step 3":"When cool enough to handle, remove the oranges with a slotted spoon, then cut in half. Pour the cooking liquid into a large jug/bowl (big enough to hold 1.5 litres). Scoop the orange pulp (pips, pith and flesh) into a fine sieve or muslin bag."},{"Step 4":"Chop the peel into shreds, then put in the empty preserving pan along with the sugar. Put the pan on the scales set to zero, hold the sieve/muslin bag over the pan and squeeze all the juice you can from the pulp through the sieve/muslin. Add the reserved cooking liquid, then top up with water to make 1.5 kilos/litres. (If you don’t have scales, squeeze the pulp juice into a measuring jug, then add the cooking liquid and water to top up to 1.5 litres, refilling if your jug doesn’t hold 1.5 litres.)"},{"Step 5":"Set the pan over a medium heat. Stir until the sugar has completely dissolved, then bring to a rolling boil and boil for 10 minutes. Skim off any scum, then test for the setting point (see tip)."},{"Step 6":"When the marmalade has reached setting point, remove from the heat, stir in the whisky, then allow to cool slightly. Stir for a final time so the peel is evenly distributed and doesn’t float to the top. Pour into sterilised jars (see Know-how), top with baking paper discs, then seal, label and keep in a cool, dark place for 6-12 months (see Make Ahead)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/116.jpg"}