{"id":"120","title":"Roast potatoes with polenta, balsamic and thyme","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 30 min, oven time 1 hour 10-20 min","description":"You can make these crispy roast potatoes ahead so that, when the meat has cooked, you can pop the potatoes in the oven while the meat rests.","ingredients":["2kg maris piper potatoes, peeled and cut into large, even chunks","1 tsp salt","7 tbsp light olive oil","3 tbsp polenta","Sea salt flakes","2 tbsp balsamic vinegar","8 unpeeled garlic cloves, lightly bashed with a rolling pin","8-10 fresh thyme sprigs, leaves stripped, plus extra to serve"],"method":[{"Step 1":"Heat the oven to 200°C/180°C/gas 6. Put the potatoes in a large saucepan, cover with cold water and add the salt. Bring to the boil, then simmer for 6-8 minutes until you can pierce the outer layer with a dinner knife. Meanwhile pour 5 tbsp of the oil into a very large, shallow roasting tray and heat in the oven."},{"Step 2":"Drain the potatoes and leave to steam dry in the colander for a few minutes. Shake gently to roughen the edges, then tip back into the pan and mix with the polenta and a generous pinch of sea salt flakes."},{"Step 3":"Remove the tray of oil from the oven and, using tongs, carefully transfer the potatoes to the oil, turning them as you go. Return the tray to the oven and roast for 40 minutes, turning occasionally."},{"Step 4":"In a small bowl combine the remaining oil with the balsamic vinegar, garlic cloves, thyme leaves, another generous pinch of sea salt flakes and freshly ground black pepper. Cover and set aside."},{"Step 5":"After 40 minutes, gently squash the potatoes with the back of a fork. You don’t want them to break up too much – you’re just increasing the surface area so they get extra-crisp. Roast for a further 15-20 minutes."},{"Step 6":"Pour the balsamic mix over the potatoes, toss gently to coat, then roast for 15-20 minutes. Serve sprinkled with extra thyme leaves."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/120.jpg"}