{"id":"65","title":"Aloo paratha (potato flatbreads)","difficulty":"Easy","portion":"Makes 4-6","time":"Hands-on time 30 min","description":"Chef Rohit Ghai shares his recipe for aloo paratha, potato-stuffed flatbreads. Delicious for breakfast, or as part of an Indian feast.","ingredients":["2 medium potatoes (about 300g), boiled and grated – see Know-how","2 tbsp finely chopped coriander leaves","1 green chilli, finely chopped","¼ tsp toasted ground cumin","¼ tsp garam masala","¼ tsp dried mango powder (amchur)","¼ tsp red chilli powder","2 tbsp rapeseed oil for cooking","250g wholemeal flour","1 tsp rapeseed oil","¼ tsp salt","100-150ml water"],"method":[{"Step 1":"First, make the dough. Mix the wholemeal flour, oil and salt in a bowl, then mix in the water a little at a time, kneading as you go, until it forms a smooth, soft dough. You may not need to add all the water. Cover with a clean tea towel and leave to rest for 15-20 minutes, then divide the dough into 4-6 equal balls."},{"Step 2":"To make the filling, put the grated potatoes in a bowl with the coriander, green chilli, toasted cumin, garam masala, dried mango powder, red chilli powder and some salt. Mix until everything is well combined."},{"Step 3":"To make the parathas, use a rolling pin to roll a dough ball into a circle about 8 10cm. Place 2-3 tbsp of the filling in the centre – don’t overfill it or it will be difficult to roll. Bring all the edges together and pinch to seal, then flatten the ball using your hands. Now roll the dough ball into a circle 18-20cm in diameter. The trick is to apply equal pressure while rolling – if you do this, your paratha will become round automatically."},{"Step 4":"Transfer the rolled paratha to a hot dry frying pan (or tawa). Cook for 1-2 minutes on each side, then oil the side that’s facing up and flip it again. Once again, oil the side that’s facing up so both sides have been oiled. Press with a spatula and cook the paratha until both sides have golden brown spots."},{"Step 5":"Repeat with the rest of the dough balls and serve the aloo paratha hot."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/65.jpg"}