{"id":"149","title":"Pumpkin and coconut pilau","difficulty":"Medium","portion":"Serves 6","time":"Hands-on time 30 min, oven time 40 min, simmering time 15-20 min","description":"Layers of fluffy, saffron-spiked rice, roasted pumpkin, coconut, cranberries and fresh herbs give this stunning dish plenty to talk about. Serve as an alternative Christmas side, with plates of pani puri and keema pav.","ingredients":["300g basmati rice","2 red onions, peeled and cut into wedges","1kg pumpkin or squash (with edible skin), halved, deseeded and cut into 3cm wedges","Vegetable oil for drizzling","1 tbsp garam masala","1 tsp cumin seeds","Good pinch saffron","3 green chillies","2 tbsp coconut oil","3 garlic cloves, finely sliced","7cm piece fresh ginger, peeled and cut into matchsticks","1 cinnamon stick","4 cloves","Large handful coconut flakes or toasted coconut","Large handful dried cranberries","A few fresh coriander and mint sprigs, leaves picked","1 lemon for squeezing"],"method":[{"Step 1":" Heat the oven to 220°C/200°C fan/gas 7. Put the rice in a large bowl, cover with plenty of cold water and set aside for 30 minutes."},{"Step 2":"Meanwhile, put the onions and squash in a roasting tray, drizzle with oil, sprinkle with garam masala and cumin seed, then season. Toss together, then roast for 40 minutes or until the pumpkin/squash is lightly caramelised and tender."},{"Step 3":"Meanwhile measure out 600ml freshly boiled water in a jug, add the saffron and set aside. Pierce the chillies with a sharp knife (leave them whole). Put a large saucepan (with a lid) on a low-medium heat, then add the coconut oil, sliced garlic and ginger. When they just start to colour, add the chillies, cinnamon stick and cloves."},{"Step 4":"Drain the soaked rice and add to the saucepan, stirring to coat all the grains in the flavoured oil. Pour in the infused saffron water, season generously and bring back to the boil. As soon as the rice starts to bubble, turn the heat to low, cover and cook for 15-20 minutes. At the end of the cooking time, remove the lid, cover the pan with a clean tea towel and set aside for 5 minutes."},{"Step 5":"Spoon half the rice onto a large platter, fluffing it up with a fork, then layer on the pumpkin/squash and onions. Finish with more rice and scatter over the coconut, cranberries and herbs. Season, squeeze over lemon juice and serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/149.jpg"}