{"id":"68","title":"Spicy vegan omelette","difficulty":"Easy","portion":"Serves 1","time":"Hands-on time 15 min","description":"This spicy vegan ‘omelette’ recipe takes just 15 mins and one pan to make. Made with gram flour and potatoes,  it makes a filling lunch.","ingredients":["1 tbsp sunflower oil","1-2 potatoes (about 170g), peeled, very thinly sliced on a box grater or mandoline","¼ leek, thinly sliced","50g gram flour (also known as chickpea flour or besan), sifted","¼ tsp bicarbonate of soda","¼ tsp ground turmeric","1/2 tsp cumin seeds","¼ tsp garam masala, plus a sprinkle to serve","Pinch chilli powder (optional), plus extra to serve","100ml plant-based milk, such as almond","Squeeze lemon juice","60g frozen peas, defrosted","Handful coriander leaves, roughly chopped or baby salad leaves","Sliced chilli, mango chutney and unsweetened coconut yogurt to serve (optional)"],"method":[{"Step 1":"Heat half the oil in a medium non-stick frying pan over a high heat. Stir-fry the sliced potatoes for 1 minute, then reduce the heat to low-medium, cover and cook for 5 minutes, stirring 1-2 times. Add the leek and continue to cook, covered, for 3 minutes or until the potatoes are tender and the leek has softened."},{"Step 2":"Meanwhile mix the gram flour, bicarb, spices and some salt and pepper in a medium bowl. Gradually mix in the plant-based milk, followed by the lemon juice. Add the potato and leek mixture, then toss to coat."},{"Step 3":"Heat the remaining oil in the pan over a medium heat. Tip in the ‘omelette’ mixture and roughly spread to the edges of the pan. Cook for 1 minute, then cover and cook for 2-3 minutes more. Loosen the edges and underneath with a palette knife, then slide onto a chopping board. Invert the pan and put it over the omelette, then flip the board and pan over to drop the omelette back into the pan. Cook for another 1-2 minutes. Alternatively, cook the top under a hot grill for 2-3 minutes until golden (only if the handle won’t burn). Sprinkle with more garam masala and/or chilli powder, and serve with coriander/salad, fresh chilli and mango chutney or dairy-free yogurt, if you like."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/68.jpg"}