{"id":"21","title":"Confit parsnip and carrot crumble","difficulty":"Easy","portion":"Serves 1","time":"Hands-on time 15 min. Oven time 1 hour 10 min","description":"Got a vegan guest for Christmas? This vegetable crumble for one makes a hearty and impressive Christmas main. Slow-cooked root veg and beans sit in a creamy, plant-based sauce, finished with a flavoursome crumble topping.","ingredients":["1 carrot, cut into 3cm chunks","1 parsnip, cut into 3cm chunks","1 star anise","1 small bay leaf","1 garlic clove, peeled but left whole","1 strip orange peel","200-300ml olive oil","1 slice seeded bread (preferably a crust)","2 tbsp rolled oats","1 tbsp nutritional yeast flakes","100g cooked haricot or cannellini beans","2 tbsp oat fraiche (we used Oatly)","Individual pie or oven dish"],"method":[{"Step 1":"Heat the oven to 160°C fan/ gas 4. First, confit the veg: put the carrot, parsnip, star anise, bay, garlic and orange peel in a small oven dish, then pour over enough oil to submerge everything. Cover tightly with foil and put in the oven for 35-40 minutes until the veg is completely tender when pierced with a knife."},{"Step 2":"Meanwhile, whizz the bread to a coarse crumb in a food processor (you could also tear or chop it into small chunks). Tip into a bowl, then stir in the oats and half the nutritional yeast. Season with a pinch of salt and pepper and set aside."},{"Step 3":"Scoop the confit veg out of the oil and into a bowl (reserve the oil; see Don’t Waste It). Crush the confit garlic into a paste with a fork, then stir it into the veg along with the beans, oat fraiche and remaining nutritional yeast. Season, then tip into an individual oven or pie dish. Add 3 tbsp of the infused oil to the bread mixture and stir to combine. Use this to top the vegetable filling. Cover and chill or freeze until ready to cook (see Make Ahead)."},{"Step 4":"When ready to cook, heat the oven to 180°C fan/gas 6. Bake the crumble on a tray for 30 minutes (or 40 minutes if cooking from frozen) until golden and crisp. Leave to stand for 5-10 minutes before serving."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/21.jpg"}