{"id":"179","title":"Bounty parfait cheesecake","difficulty":"Easy","portion":"Serves 8-10","time":"Hands-on time 30 min, plus setting and overnight freezing","description":"Try our vegan bounty cheesecake for your next dinner party dessert. A coconut biscuit base is topped with coconut cream and smothered in dark chocolate.","ingredients":["25g toasted coconut flakes (from large supermarkets and health food shops)","2 tbsp cocoa powder","125g vegan biscuits (we used Doves Farm Organic Wholemeal Digestive Biscuits)","4 tbsp coconut oil, melted","400ml tin coconut milk","160ml tin coconut cream","1 tbsp vanilla bean paste","1 tsp maple syrup","75g desiccated coconut","150g dark chocolate, roughly chopped (if you’re vegan, check the label to make sure the chocolate is vegan)","1 tsp vanilla bean extract","1 tbsp maple syrup","2-3 tbsp boiling water","Small handful toasted coconut flakes to decorate","900g loaf tin, double-lined with cling film – leave plenty of excess overhanging the edges"],"method":[{"Step 1":"Whizz the coconut flakes, cocoa powder and biscuits in a food processor to form crumbs. With the motor running, pour in the coconut oil until the crumbs are coated. (Or put the biscuits in a freezer bag and bash to crumbs using a rolling pin. Tip into a bowl, then mix in the oil.)"},{"Step 2":"Tip into the lined loaf tin and push down with the back of a spoon to make an even base, then chill in the freezer."},{"Step 3":"Using an electric mixer, whisk the coconut milk, coconut cream, vanilla and maple syrup in a large mixing bowl until smooth and thick – about 5 minutes. Gently mix in the desiccated coconut, then pour the filling over the chilled biscuit base. Cover with the overhanging cling film and return to the freezer to set overnight (see make ahead)."},{"Step 4":"For the topping, put the chopped chocolate, vanilla and maple syrup in a heatproof bowl over a pan of barely simmering water (don’t let the bowl touch the water). Once the chocolate has almost melted, whisk gently using a balloon whisk (it will look as if it’s seizing but don’t worry), then pour in 2-3 tbsp boiling water from the kettle and keep whisking. Add a splash more boiling water if it needs loosening."},{"Step 5":"Remove the coconut parfait from the freezer. Turn out, then put biscuit-side down on a wire rack set over a lipped baking sheet (to catch excess melted chocolate). Pour over the chocolate, covering the top and letting it drip down the sides. Sprinkle over the coconut, then return to the freezer for 15 minutes to set (see make ahead)."},{"Step 6":"Take the parfait out of the freezer 15 minutes before serving. Dip a sharp knife in hot water, dry it, then slice."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/179.jpg"}