{"id":"194","title":"Spiced pumpkin soup","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 20 min, oven time 1 hour","description":"Create a showstopper starter by serving this velvety spiced pumpkin soup in a hollowed-out pumpkin. It also makes an excellent lunch, served in bowls, with buttered bread.","ingredients":["1kg pumpkin or squash, cut into 4cm wedges and seeds removed, (see tip)","1 garlic bulb, halved horizontally, plus a couple of cloves to garnish","1 banana shallot, roughly chopped","1 red chilli, roughly chopped","1 tsp ground coriander","1 tsp ground cumin","Small bunch fresh coriander, stalks and leaves (to garnish; optional) separated","Olive oil to drizzle","500ml fresh vegetable stock (or made with a gluten-free stock cube)","160ml tin coconut cream","1 tbsp light olive oil","1 red chilli, finely sliced","1 banana shallot, finely sliced","Hollowed-out pumpkin to serve the soup in (optional)"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. In a roasting tin, toss the pumpkin, garlic, shallot, chilli, spices and coriander stalks in a drizzle of oil. Season, cover tightly with foil and roast for 30 minutes. Remove the foil and roast for another 30 minutes until the pumpkin is tender and starting to caramelise."},{"Step 2":"Scrape the pumpkin flesh from the skin. Discard the skin and put the flesh in a blender. Squeeze the garlic out of its skin into the processor with the rest of the veg from the tin. Add the stock and whizz until smooth. Add the coconut cream, then whizz again."},{"Step 3":"Pour into a large pan and simmer over a medium heat for 10 minutes."},{"Step 4":"For the garnish, heat the oil in a small frying pan over a medium-high heat. Add the garlic cloves for garnishing, along with the chilli and shallot. Cook for 6-8 minutes until caramelised and starting to crisp."},{"Step 5":"Season the soup to taste, then pour into the pumpkin (or deep warmed bowls) and garnish with the shallot, chilli, garlic cloves and coriander leaves, if using. Drizzle with a little oil and serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/194.jpg"}