{"id":"324","title":"Mulled cranberry and apple jelly","difficulty":"Easy","portion":"Makes 12 X 175ML jars","time":"Takes 30 minutes to make and about 20 minutes to cook","description":"This lightly spiced jelly recipe is perfect with roast meats such as lamb, beef and turkey, and it’s equally delicious on toast.","ingredients":["1.5kg Bramley apples","700g fresh or frozen cranberries","600ml gutsy red wine","1½ tbsp cloves","4 small cinnamon sticks","4 star anise, plus 12 perfect star anise, to decorate","Pared zest and juice of 2 oranges","Granulated sugar"],"method":[{"Step 1":"Chop the apples. Do not peel or core them, but cut away any bruised parts. Put into a large, deep pan with the cranberries, 1.75 litres water, the wine, cloves, cinnamon sticks, 4 star anise, orange zest and juice. Bring to the boil, then reduce to a simmer for 25 minutes, stirring now and then. Do not crush the cranberries as this will make the jelly cloudy."},{"Step 2":"Scald a jelly bag or a large square of muslin in a large pan of boiling water to sterilise. Drain or squeeze out the excess water. Carefully pour the mixture into the jelly bag or a muslin suspended over a very large bowl, and leave to drip through until it stops. Don’t be tempted to squeeze the bag or muslin as this again will make the jelly cloudy."},{"Step 3":"Return the pulp to the pan, add another 1.2 litres of water and simmer for a further 20 minutes. Drain through the jelly bag or muslin, as before, into a separate bowl. The juices will not be clear at this point in time, but don’t worry. It will clarify once you add the sugar."},{"Step 4":"Combine the 2 juices and measure the volume. Weigh out the sugar, allowing 450g sugar to every 600ml juice, and set aside. Wash and rinse 12 x 175ml jars with lids and sterilise them in the oven at 150°C/fan130°C/gas 2 for at least 15 minutes. Place a saucer in the freezer to chill."},{"Step 5":"Pour the juice into the cleaned pan, bring to the boil and boil for 10 minutes to concentrate the flavour, skimming off any scum as it collects on the surface. Add the sugar and stir until it has dissolved, then bring back to the boil and boil rapidly for about 10 minutes, continuing to carefully skim off the scum from the surface as it appears. This is important for a really clear jelly."},{"Step 6":"After 10 minutes, test the jelly by pouring a little onto the chilled saucer. Return to the freezer for a few minutes, then remove and push your finger across the surface. If it wrinkles, then it’s ready. Take the pan off the heat, leave to settle and skim off any scum from the surface."},{"Step 7":"Jellies tend to set very quickly so it’s important to make sure the jam jars are still hot from the oven when you’re ready to use them. Ladle the jelly into a sterilised jug and pour into the jars. Submerge a whole star anise in each jar and keep in place up against the side of the jar with a clean, fine metal skewer balanced against the rim of the jar for about 1 hour, until set, then carefully remove the skewers. The jelly will be cool enough now to cover with waxed discs and lids. Keep in the fridge once opened and use within 3 months."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/324.jpg"}