{"id":"237","title":"Five-spice smoked tofu nuggets","difficulty":"Easy","portion":"Makes 8 nuggets with satay dressing","time":"Hands-on time 20 min","description":"Elly Pear’s tofu ‘chicken’ nuggets are a quick, easy and full of flavour. Pop on the end of skewers and serve with the satay dressing for party food that both vegans and meat-lovers will enjoy.","ingredients":["225g box smoked tofu (we used Tofoo Co tofu from Ocado)","2 tbsp cornflour","¼ tsp chinese five-spice powder","Large pinch smoked paprika","300ml vegetable oil","1 tsp light soft brown sugar","2 tsp freshly squeezed lime juice","4 tbsp peanut butter (smooth or chunky are both fine)","3 tbsp rice wine vinegar","1 tbsp soy sauce","1¼ tbsp vegetable, sunflower or rapeseed oil","1¼ tbsp sriracha to taste","2 tbsp toasted sesame oil"],"method":[{"Step 1":"For the satay dressing, dissolve the sugar in the lime juice in a small bowl, then put into a blender with all the remaining ingredients and blend until smooth. Taste and add a little more sugar/lime juice/soy/sriracha as you see fit."},{"Step 2":"Lay the block of tofu on a few sheets of kitchen paper. Fold another sheet of kitchen paper in half and use to gently press out the liquid. Cut into 8 equal-size cubes. Put the cornflour in a shallow bowl, add the five-spice powder and paprika, then mix well. Toss the tofu cubes in the spiced cornflour until they’re evenly dusted on all sides."},{"Step 3":"Pour the vegetable oil into a wok and put over a high heat. Once hot, shake off any excess cornflour from the tofu, then carefully lower each nugget into the hot oil using a slotted spoon or tongs. Deep-fry, turning regularly (and carefully), for 4-5 minutes until all sides are golden brown and crisp. Remove the tofu cubes from the pan using a slotted spoon or tongs, then drain on kitchen paper. Sprinkle the cubes with flaked sea salt while they’re still hot – this helps to keep them crisp. Thread the fried tofu cubes onto skewers and serve with the satay dressing for dipping. Serve with a salad of your choice."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/237.jpg"}