{"id":"29","title":"Pumpkin curry","difficulty":"Easy","portion":"Serves 4 as a main or 6 as a side","time":"Hands-on time 15 min, simmering time 20 min","description":"Gourds, squashes and pumpkins of all shapes and sizes are used in dishes across the Indian subcontinent. This colourful pumpkin curry, full of mustard seeds, curry leaves, tamarind and jaggery (cane sugar), takes inspiration from the flavours of southern India.","ingredients":["3 tbsp mustard oil or vegetable oil","1 tbsp black mustard seeds","1 tsp cumin seeds","10 curry leaves, ideally fresh (see Tips)","1 onion, finely chopped","2 green chillies, finely chopped","2 tbsp ginger-garlic paste","½ tsp ground turmeric","1 tsp kashmiri chilli powder","1 tsp ground coriander","800g pumpkin, peeled, deseeded and cut into 5cm chunks","1 tbsp tamarind paste","½ tbsp jaggery, grated, or light brown sugar","Bunch coriander, finely chopped"],"method":[{"Step 1":"Pour the oil into a large lidded saucepan and put over a medium heat. Once shimmering hot, add the mustard seeds, cumin seeds and curry leaves and cook for 30 seconds or until the seeds begin to crackle."},{"Step 2":"Add the onion and green chillies with a pinch of salt, cook for 8 minutes, stirring regularly, then add the ginger-garlic paste and cook for another 2 minutes. Add the turmeric, chilli powder and coriander, stir to combine, then add the pumpkin. Stir to coat the pumpkin in the onions and spices, then add 300ml water and the tamarind paste and cover. Bring to a simmer and cook for 8-10 minutes, stirring regularly, or until the pumpkin is tender. Depending on the type, size and variety of pumpkin you’re using, it may take a little longer – you want the pumpkin to be soft but still holding its shape. If the mixture begins to stick, add a splash more water, although bear in mind this is quite a dry dish without much sauce."},{"Step 3":"Add the jaggery (or brown sugar), stir to combine, then stir through half the coriander. Serve with the rest of the coriander sprinkled on top with rice, chapatis or other Indian dishes as part of a larger spread."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/29.jpg"}