{"id":"62","title":"Garlic and chilli purple sprouting broccoli","difficulty":"Easy","portion":"Serves 4 as a side","time":"Hands-on time 10 min","description":"Stir-fried purple sprouting broccoli with crispy garlic and shallots is a quick vegan side dish that packs a big flavour punch. Serve with lamb, chicken or tofu.","ingredients":["150ml vegetable oil for frying","2 banana shallots, finely sliced","4 large garlic cloves, finely sliced","2 tsp sesame oil","5cm piece ginger, finely sliced into matchsticks","1 small chilli, finely chopped (optional)","300g purple sprouting broccoli, larger stems halved","2 tbsp fermented black bean paste (see Know How)","1 tbsp light soy sauce","1 tbsp chinese rice wine (optional)","Finely grated zest and juice ½ small orange"],"method":[{"Step 1":"Put the vegetable oil and shallots in a wok over a medium heat. Bring to a simmer, moving the shallots around for 2-3 minutes until golden. Use a slotted spoon to remove the shallots and set aside on kitchen paper to drain and cool (they’ll crisp up as they cool). Add the garlic slices to the oil and fry for 2-3 minutes until light golden (don’t let them get too much colour as they’ll continue to brown a little out of the oil). Remove the garlic and drain. Set aside with the shallots."},{"Step 2":"Carefully pour off most of the vegetable oil, leaving about 1 tsp behind (save the flavoured oil for future frying). Increase the heat to high, then add the sesame oil, ginger and chilli (if using) to the wok. Stir-fry for 1 minute, then add the broccoli and cook, stirring and tossing, for 3-4 minutes until slightly softened and charring in places."},{"Step 3":"Whisk together the black bean paste, soy, rice wine (if using), orange zest and juice. Add the sauce to the wok and continue to cook the broccoli for a further 2-3 minutes until just tender and the sauce is slightly reduced. Serve straightaway, scattered with the crispy shallots and garlic."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/62.jpg"}