{"id":"30","title":"Coconut dhal and chapatis","difficulty":"Easy","portion":"Serves 6, with 3 chapatis per person","time":"Hands-on time 45 min. Cooking time 45 min","description":"Nearly all the ingredients for this fragrant vegan coconut dhal come from the store cupboard. Serve with homemade chapatis for a filling, budget dinner.","ingredients":["250g red lentils","2 tbsp vegetable oil","2 medium onions, finely chopped","4 garlic cloves, crushed","½ tsp dried chilli flakes, or more to taste","2 tsp mustard seeds (optional)","2 tsp ground cumin","2 tsp ground coriander","1 tsp ground turmeric","1 tsp ground ginger","400g tin chopped tomatoes","400g tin coconut milk","1 tbsp tamarind paste","250g frozen spinach (optional)","Juice ½ lemon or lime","500g chapati or wholemeal flour, plus extra to dust","1 tsp salt","250-300ml water","Vegetable oil or ghee for frying"],"method":[{"Step 1":"Rinse the lentils thoroughly in cold water and leave to drain in a sieve until ready to use. Heat the oil in a large saucepan and add the onions. Stir intermittently over a low-medium heat for 10-15 minutes, or until the onions are soft and golden."},{"Step 2":"Add the garlic and spices and cook, stirring, for a few minutes, until you hear the mustard seeds pop and the spices have cooked out – take care not to burn them. Add the red lentils and stir them round to coat them in the oil, before adding the tomatoes and coconut milk. Swish round the empty tins with about 100ml water and add the water to the pan."},{"Step 3":"Season generously with salt, then stir in the tamarind paste and frozen spinach (if using) and leave to simmer gently for about 25-30 minutes, stirring intermittently, or until the lentils are soft. You may need to add more water."},{"Step 4":"Meanwhile, make the chapatis. Mix the flour and salt in a large bowl. Add the water, a little at a time, mixing it in with your fingers as you go, until the mixture comes together to form a dough. Knead the dough for a few minutes in the bowl and leave to rest for a few minutes more."},{"Step 5":"On a work surface lightly dusted with flour, roll the dough into a sausage shape and divide it into 18 pieces. Flatten each piece of dough with the heel of your hand, before rolling it very thinly into discs, roughly 15cm in diameter. Add more flour to prevent the dough sticking as needed."},{"Step 6":"Heat a sparing slick of oil or ghee in a frying pan over a medium-high heat. Fry a chapatti for about 30 seconds on each side, or until it puffs up and dark spots appear on the surface. Repeat with the remaining chapatis. Serve alongside the dal, squeezing over the lemon or lime juice."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/30.jpg"}