{"id":"140","title":"Squash ravioli with mushrooms and sage pesto","difficulty":"Medium","portion":"Serves 4-6","time":"Hands-on time 1 hour, oven time 45 min-1 hour","description":"Homemade ravioli is such a special dish and will really impress anyone you serve it to. This autumnal recipe is filled with butternut squash and served with roasted mushrooms and sage pesto for a knockout dinner party main (that’s vegan!).","ingredients":["400g butternut squash/pumpkin, peeled and roughly chopped","1 onion, roughly chopped","4 garlic cloves, bashed","1 tbsp olive oil","1 tbsp light brown soft sugar (check it’s vegan)","50g vegan hard cheese, grated (we used Violife Prosociano from Sainsbury’s and Ocado)","250g 00 flour, plus extra for dusting (see Know-how)","100-125ml lukewarm water","Semolina for dusting","750g mixed wild mushrooms","Light olive oil for drizzling","2 tbsp chopped fresh rosemary or thyme leaves","300g cavolo nero, thick stems discarded, roughly chopped","1 small garlic clove, chopped","25g California Walnut halves, toasted in a dry pan","25g fresh sage leaves","4 each fresh rosemary and thyme sprigs, leaves picked","25g vegan hard cheese (see filling ingredients, left), grated","Juice ½ lemon","125ml extra-virgin olive oil, plus extra to serve","Food processor; pasta machine"],"method":[{"Step 1":"Heat the oven to 220°C/200°C fan/gas 7. Toss the squash/pumpkin, onion and garlic with the olive oil in a large roasting tin, then season with salt and black pepper. Roast for 45 minutes to 1 hour until the veg are tender and golden. "},{"Step 2":"Meanwhile, make the pasta dough. Put the flour in a large mixing bowl or in a heap on a clean work surface. Make a well in the centre, then pour in 100ml of the water. Mix with your fingertips, gradually bringing flour into the centre to create a smooth dough (add more water if needed). Wrap well, then chill for 30 minutes."},{"Step 3":"Once the squash is cooked, transfer it and the onion to a food processor along with the sugar and vegan hard cheese. Whizz until smooth, taste and adjust the seasoning, then set aside."},{"Step 4":"Divide the pasta into 4 even pieces and roll each piece through the pasta machine, working from the largest to the thinnest setting to give 4 even pieces. (If you don’t have a pasta machine you’ll need to roll out the dough as thinly as possible using a rolling pin.)"},{"Step 5":"Lightly flour 3 of the pasta sheets and cover with a damp cloth. Lay the fourth piece on a work surface lightly dusted with semolina, then spoon 12-15 small mounds of filling onto the pasta, evenly spaced (about 7cm apart). Use your finger or a pastry brush to brush a little water around each filling mound, then lay another sheet of pasta on top. Press firmly around each mound to seal, squeezing out as much air as possible. Cut into 7cm squares, discarding trimmings. Transfer to a baking tray. Repeat with the rest of the pasta and filling (you should have 25-30 ravioli). Chill until needed (see Make Ahead). "},{"Step 6":"To make the sauce, put the mushrooms in a large roasting tray, toss with olive oil, salt, pepper and rosemary/thyme and roast for 30-40 minutes until golden. "},{"Step 7":"Meanwhile, make the pesto. Pulse the garlic and a pinch of sea salt in a food processor, then add the walnuts and pulse again until roughly chopped. Be careful not to over-process. Add the sage, rosemary and thyme and pulse until well mixed but still coarse. Spoon the pesto into a bowl, stir in the vegan cheese and lemon juice, then pour in the olive oil and mix to form a paste. Taste and season. (If you don’t have a food processor, pound the ingredients in a pestle and mortar, then mix in the cheese, lemon juice and olive oil.)"},{"Step 8":"Bring a large pan of salted water to the boil. Heat a drizzle of oil in a very large, non-stick frying pan and add the cavolo nero with a splash of water. Stir-fry for a few minutes until the leaves start to wilt and turn crisp, then mix in the roasted mushrooms and the pesto."},{"Step 9":"Add the ravioli to the boiling water and simmer for 2-4 minutes until cooked al dente (with some bite). Remove with a slotted spoon and transfer to the frying pan with the cavolo nero, mushrooms and pesto. Add a little of the pasta cooking water and cook for a few minutes, turning the ravioli carefully, until the sauce has coated the pasta. Season, divide among warmed bowls, then finish with a little extra-virgin olive oil. "}],"image":"https://apipics.s3.amazonaws.com/vegan_api/140.jpg"}