{"id":"114","title":"Black bean tofu and baby pak choi","difficulty":"Easy","portion":"Serves 2 as a main or 4 as a side","time":"Hands-on time 30 min","description":"Ching-He Huang’s healthy vegan recipe with black bean tofu and baby pak choi is a winner for vegan Chinese New Year celebrations.","ingredients":["1 tbsp cornflour","1 tbsp rapeseed oil","5 garlic cloves, finely chopped","1 tbsp grated fresh ginger","1 red chilli, deseeded and chopped","1 bird’s eye chilli, deseeded and chopped","1 tbsp fermented salted black beans, rinsed and lightly crushed (see Know-how)","1 tbsp yellow bean or miso paste (see Know-how)","250g ready-fried tofu (see tip), quartered","1 tbsp shaohsing rice wine or dry sherry (see Know-how)","2 green peppers, deseeded and cut into 1.5cm chunks","200ml vegetable stock (vegan if it needs to be)","1 tbsp tamari or reduced-salt light soy sauce","Cooked jasmine rice to serve","200g baby pak choi, halved","1 tbsp shaohsing rice wine","1 tbsp tamari or reduced-salt light soy sauce","1 tsp toasted sesame oil","2.5cm piece fresh ginger, sliced into matchsticks","Steamer"],"method":[{"Step 1":"For the pak choi, put a heatproof plate inside a steamer with the pak choi on it. Season with salt, rice wine, tamari/light soy sauce and sesame oil, then lay the ginger slices over the top. Put the lid on the steamer, bring to the boil, then gently steam over a low heat for 3-4 minutes."},{"Step 2":"Meanwhile, in a small jug or cup, mix the cornflour with 2 tbsp water to create a paste. Put a wok or deep frying pan over a high heat and add the rapeseed oil. When it starts to smoke, add the garlic, ginger and chillies and stir-fry for a few seconds, then add the black beans and yellow bean or miso paste and stir quickly."},{"Step 3":"Add the tofu and stir-fry for 1 minute, keeping the ingredients moving in the wok, then add the rice wine or sherry and the peppers and stir-fry for a further minute."},{"Step 4":"Add the stock and bring to the boil. Season with the tamari or soy sauce, then add the cornflour paste and stir to thicken. Serve the tofu alongside the pak choi and jasmine rice."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/114.jpg"}