{"id":"337","title":"Vegan pumpkin pie","difficulty":"Medium","portion":"Serves 6-8","time":"30 minutes to make, about 1½ hours in the oven, plus chilling","description":"Dive into this creamy vegan pumpkin pie recipe, perfect for warming up your chilly autumn evenings.","ingredients":["450g pumpkin, peeled, seeded and cubed","100g light muscovado sugar","1 tbsp vegetable oil","150g creamed (block) coconut (we used Bart Creamed Coconut Sachets, 4 individual 50g sachets, from Waitrose and bartspices.com)","1 vanilla pod, split lengthways","300g plain flour, plus extra for dusting","150g vegan margarine (such as dairy-free Pure Sunflower, available from major supermarkets), chilled","35g icing sugar, sifted","A little soya milk, to bind","55g vegan margarine, chilled","125g plain flour","90g demerara sugar"],"method":[{"Step 1":"Preheat the oven to 180°C/fan160°C/gas 4."},{"Step 2":"For the filling, place the pumpkin, sugar and oil in a large roasting tin and toss together. Roast for 35 minutes, turning halfway, until soft and golden."},{"Step 3":"Meanwhile, for the pastry, put the flour, margarine, sugar and a pinch of salt in a large bowl and, using your fingertips, rub everything together until it resembles breadcrumbs. Add a little soya milk to form the mixture into a soft dough. Wrap the pastry in cling film and place in the fridge for 30 minutes."},{"Step 4":"Meanwhile, make the topping. Place all the ingredients in a bowl and, using a knife, mix the margarine into the plain flour and sugar until it resembles coarse breadcrumbs. Set aside until needed."},{"Step 5":"Roll the pastry out on a lightly floured surface, then press into a 23cm round, fluted tart tin. Prick the base with a fork, fill with baking paper and beans and bake blind for 15 minutes. Remove the paper and beans and bake for a further 10 minutes or until pale golden."},{"Step 6":"Raise the oven temperature to 190°C/fan 170°C/ gas 5. Place the syrupy roasted pumpkin in a food processor together with the creamed coconut. Scrape the seeds from the vanilla pod, add to the processor and whizz until smooth. Spoon into the tart case and spread evenly."},{"Step 7":"Sprinkle the topping over the pumpkin and bake for 25 minutes, until crisp and golden. Cool slightly before removing from the tin. Slice and serve hot or warm with coconut milk to drizzle over."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/337.jpg"}