{"id":"232","title":"Curried parsnip soup","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 30 min, simmering time 30 min","description":"If it’s a spicy parsnip soup you’re after, our curried parsnip soup is sure to deliver. This gently spiced soup recipe is made with cumin, coriander, turmeric and ginger. This really is a heart-warming bowl of goodness.","ingredients":["750g parsnips (about 6-7), peeled","2 tbsp olive oil","¼ tsp ground cumin","1 tsp ground coriander","¼ tsp ground turmeric","1½ tsp ground ginger","½ tsp chilli powder, plus a sprinkle","1 large onion, finely chopped","2 garlic cloves, crushed","2 bay leaves","1.3 litres fresh vegetable stock","Fresh coriander leaves to serve"],"method":[{"Step 1":"Heat the oven to 180°C/160°C fan/gas 4. Slice about 100g of the parsnips very thinly on a mandoline or using a sharp knife. Pat dry with kitchen paper, toss with 1 tbsp of the oil, the cumin and some salt and pepper, then spread out on a large baking sheet. Bake for 20-25 minutes until crisp and golden at the edges."},{"Step 2":"Meanwhile, put the rest of the ground spices in a small frying pan and toast for 1-2 minutes over a medium heat until fragrant."},{"Step 3":"Heat the remaining oil in a large saucepan over a medium-high heat and fry the onion for 7-8 minutes until softening. Meanwhile, chop the rest of the parsnips. Add the garlic to the onion pan and cook for 2 minutes more. Add the toasted spices and bay leaves and stir for a minute, then add the chopped parsnips and stock. Bring to the boil, then turn down to a medium heat and cook for 30 minutes until the parsnips are tender."},{"Step 4":"Remove and discard the bay leaves, then whizz the soup using a stick blender (or in a blender with the cap removed and a folded tea towel held over to stop the hot soup exploding out) until smooth. Season to taste. Sprinkle with the parsnip crisps, extra chilli powder and a few coriander leaves to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/232.jpg"}