{"id":"169","title":"Spicy potato and cauliflower burger","difficulty":"Easy","portion":"Makes 4","time":"Hands-on time 40 min, oven time 20 min, plus chilling","description":"Inspired by the street food of Mumbai, this potato and cauliflower patty-in-a-bun delivers sweet, roasted spice flavours with a generous dollop of creamy fresh coconut yogurt and tangy tamarind paste.","ingredients":["Vegetable oil for frying","2 banana shallots, finely sliced into rounds","1 green chilli, finely sliced","Cornflour for dusting","2 tbsp tamarind paste(see Know-how)","4 burger buns, halved and lightly toasted (check they’re vegan if need be)","6 tbsp coconut yogurt (we used CoYo brand)","6 medium tomatoes, sliced","1 lime, cut into wedges","200g cauliflower, sliced into florets ","1 tbsp vegetable oil, plus extra for frying","500g potatoes, peeled and cut into 2cm chunks","3 tbsp madras curry paste (or your favourite curry paste)","2 fat garlic cloves, crushed","3cm piece fresh ginger, grated (no need to peel)","1 tsp black mustard seeds","2-3 tbsp non-dairy milk, such as soya or oat milk","1 tbsp mango chutney, plus extra to serve","Small handful fresh coriander, leaves picked and stalks chopped","Cornflour for dusting"],"method":[{"Step 1":"Heat the oven to 200°C/180°C fan/gas 6. For the burger, toss the cauliflower with 1 tablespoon vegetable oil in a baking tray and roast for 20 minutes until golden and lightly charred. Remove from the oven and allow to cool slightly, then roughly chop."},{"Step 2":"Meanwhile, put the potatoes in a large pan of salted cold water, bring to the boil, then simmer for 6 minutes until tender. Drain, then set the colander over the hot pan for the potatoes to steam dry."},{"Step 3":"Wipe the potato pan dry, then return to the heat. Add a splash more oil, then fry the curry paste, garlic, ginger and mustard seeds until fragrant. Remove from the heat, add the potatoes, non-dairy milk, mango chutney and coriander stalks with a pinch of salt, then mash until smooth. Stir in the chopped cauliflower, then set aside to cool."},{"Step 4":"Once the mixture has cooled, dust your hands in cornflour before dividing it into 4 and shaping into even-size patties about 3cm thick. Transfer to a plate or baking sheet, then chill for 30 minutes."},{"Step 5":"Meanwhile, heat a splash of oil in a separate large frying pan. Toss the shallots and sliced chilli in cornflour, shaking off any excess, then fry until crisp and golden. Remove with a slotted spoon and drain well on kitchen paper (see Make Ahead)."},{"Step 6":"Dust the chilled patties with a little cornflour, add another splash of oil to the pan, then fry for 5 minutes or so on each side until golden on the outside and piping hot on the inside."},{"Step 7":"To serve, spread a little tamarind paste on the base of the toasted buns, then top with a good dollop of yogurt, a hot patty, sliced tomato, crispy shallot and chilli, a spoonful of mango chutney and some coriander leaves. Finally, squeeze over a little lime juice, then sandwich with the bun lid to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/169.jpg"}