{"id":"78","title":"Salt-baked celeriac with tahini","difficulty":"Easy","portion":"Serves 4-6","time":"Hands-on time 30 min","description":"Salt-baked celeriac makes an easy but impressive vegan centrepiece. Serve on a colourful lentil and pomegranate salad with tahini sauce and zhoug.","ingredients":["1 large whole celeriac, trimmed and cleaned","1 tbsp zhoug paste (see Know How)","1 tbsp Belazu Tahini","500g plain flour","170g fine sea salt","Large handful herbs, leaves picked – we used rosemary, thyme, marjoram and oregano","2 tbsp cumin seeds","3 tbsp zhoug paste (see Know How), plus extra to serve","Glug olive oil","80g mixed baby salad leaves (we used rocket and sorrel)","2-3 spring onions, finely chopped","Small bunch each mint, dill (or coriander) and flatleaf parsley, leaves picked","3-4 tbsp pomegranate seeds","Lemon wedges to serve (optional)","4 tbsp Belazu Tahini","Juice of 1 lemon","1 small garlic clove, crushed","2 tsp olive oil"],"method":[{"Step 1":"Heat the oven to 160°C fan/gas 4. Rub the celeriac with the 1 tbsp each zhoug and tahini. Combine the flour, salt, herbs and cumin seeds in a food processor and whizz until the herbs are finely chopped. With the motor running, pour in enough cold water to form a firm dough (about 200ml). Briefly knead the salt dough on a work surface, then roll out into a disc large enough to fully wrap the celeriac. (To make the dough by hand, finely chop the herbs, then mix in a large bowl with the flour, salt and cumin seeds. Add the water and mix until the dough comes together.)"},{"Step 2":"Wrap the celeriac in the salt dough, pinching the dough together underneath to fully enclose it. Put on a baking tray, then bake for 2 hours."},{"Step 3":"Meanwhile, make the tahini dressing. Put all the ingredients in a small bowl, then whisk to combine. Add enough cold water to thin the sauce to a drizzling consistency, then season with salt and more lemon to taste. Cover and set aside."},{"Step 4":"For the lentil salad, mix the lentils and zhoug in a large bowl with a good glug of olive oil. Toss the leaves, spring onions, herbs and pomegranate seeds with the lentils and set aside until ready to serve."},{"Step 5":"Remove the celeriac from the oven and use a serrated knife to cut away the salt dough (use oven gloves as it will be hot). Discard the dough, then slice the celeriac into wedges and serve with the lentil salad, tahini dressing, a squeeze of lemon and, if you like, more zhoug."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/78.jpg"}