{"id":"171","title":"Bang bang tofu salad","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min","description":"This fill-you-up salad is gluten-free, vegan and jam-packed with tasty Asian flavours. The bang bang sauce is made with peanut butter, sweet chilli and sesame oil – you’ll go nutty for it.","ingredients":["1 thinly sliced red onion","3 tbsp red wine vinegar","A pinch each of caster sugar and salt","170g sushi rice","300g tenderstem broccoli","1 tbsp vegetable oil"," 2 x 225g blocks of extra-firm smoked tofu (we like The Tofoo Co, from Waitrose, Tesco and Co-op)"," 50g smooth peanut butter","25g gluten-free sweet chilli sauce","1 tbsp toasted sesame oil","1 tbsp tamari soy sauce","2 tsp rice vinegar","1 tsp mirin","1 tsp black sesame seeds","Pinch of chilli flakes, to serve"],"method":[{"Step 1":"Put the red onion in a small bowl with the red wine vinegar and a pinch each of caster sugar and salt. Set aside for 30 minutes. Meanwhile, cook the sushi rice according to the pack instructions. Bring a pan of water to the boil and cook the tenderstem broccoli for 3 minutes, then drain and refresh in a bowl of iced water."},{"Step 2":"Heat the vegetable oil in a large frying pan over a medium-high heat. Pat dry the tofu, then fry for 3-4 minutes on each side until lightly golden and crisp. Slice into finger-thick strips."},{"Step 3":"Make the bang bang sauce by mixing together the peanut butter, sweet chilli sauce, sesame oil and tamari soy sauce. Taste and adjust the seasoning with a pinch of chilli flakes or some extra tamari and loosen with a splash of water, if needed."},{"Step 4":"Mix together the rice vinegar and mirin, then stir gently into the cooked rice along with a pinch of salt. Spread the rice over a platter, then top with the cooked broccoli and sliced fried tofu. Drain the red onion and add it to the platter. Drizzle with the peanut sauce, then sprinkle with 1 tsp black sesame seeds and a pinch of chilli flakes."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/171.jpg"}