{"id":"64","title":"Vegan wild garlic lasagne","difficulty":"Easy","portion":"Serves 6","time":"Hands-on time 45 min, plus soaking. Oven time 30-40 min.","description":"Plant-based foods can be pricey, but if you forage for the garlic, this vegan wild garlic lasagne recipe delivers punchy flavours and a moreish ‘cheese’ sauce.","ingredients":["200g wild garlic (see Easy Swaps)","Pinch grated nutmeg","10-12 lasagne sheets (egg free)","100g vegan mozzarella (optional)","2 tbsp olive oil","1 onion, finely chopped","1 celery stick, finely chopped","1 small carrot, finely chopped","1 garlic clove, finely chopped","A few thyme, sage or rosemary sprigs","1 bay leaf","500g frozen vegan mince","400g tin crushed tomatoes","1 tbsp tomato purée","1 tsp soy sauce","2 tsp Marmite","2 tbsp plant-based milk","250g cashews, soaked in boiling water for 1 hour","1 tbsp white wine vinegar or cider vinegar","2 tbsp nutritional yeast (such as Engevita)","¼ tsp celery salt (optional)","¼ tsp paprika","Splash hot chilli sauce","Pinch mustard powder (optional)"],"method":[{"Step 1":"For the ragù, heat the olive oil in a heavy-based pan, then add the onion, celery, carrot and a pinch of salt. Cook for 15 minutes to soften, then add the garlic and cook for 10 minutes until the veg start to caramelise. Add the herbs, bay leaf and plenty of black pepper."},{"Step 2":"Add the vegan mince to the pan and stir to defrost and brown it a bit. Mix in the tomatoes, tomato purée, soy sauce and Marmite."},{"Step 3":"For the ‘cheese’ sauce, blend the soaked and drained cashews, vinegar, nutritional yeast, celery salt (if using), paprika and 375ml water in a bullet blender/food processor for 2 minutes until smooth. Season with chilli sauce and, if using, mustard powder."},{"Step 4":"Cook (blanch) the wild garlic in a large pan of boiling water for 15-20 seconds, drain and leave to cool, then squeeze out any excess liquid and finely chop. Season with nutmeg and a good pinch of salt and pepper."},{"Step 5":"Heat the oven to 180ºC fan/ gas 6 and prepare the lasagne sheets according to the packet instructions. Spread a third of the ragù over the base of a baking dish (about 25cm x 35cm). Add a third of the ‘cheese’ sauce, then cover with a layer of pasta. Spread evenly with half the wild garlic mixture and a third of the mozzarella (if using), then repeat the layers and finish with layers of theremaining ragù, pasta, ‘cheese’ sauce and mozzarella (if using)."},{"Step 6":"Bake for 30-40 minutes until bubbling and golden. Rest for 10 minutes before serving."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/64.jpg"}