{"id":"248","title":"Thai-flavoured chickpea and millet cakes with red pepper sauce","difficulty":"Easy","portion":"Serves 4 (makes 8 cakes)","time":"Hands on time 15 minutes, cooking time 45 minutes","description":"Golden, crispy and bursting with Thai flavours – Rose Elliot’s recipe for chickpea and millet cakes is the easy vegetarian dinner you’ll come back to again and again.","ingredients":["125g millet","400g tin chickpeas, drained","3-4 tsp red Thai curry paste to taste","4 tbsp chopped fresh coriander","2 spring onions, finely chopped","1-2 tbsp wholemeal flour to coat","Rapeseed oil for shallow-frying","1 red pepper, deseeded and","chopped","1 tbsp maple syrup","1 tbsp rice or cider vinegar","Pinch of chilli flakes","3 tbsp brown rice syrup (from health food shops) or maple syrup","2 tsp Dijon mustard","Good pinch of chilli flakes"],"method":[{"Step 1":"Put the millet into a medium pan with 300ml water and bring to the boil. Reduce the heat, then cover and simmer for 15-20 minutes until all the water has been absorbed and the millet is light and fluffy."},{"Step 2":"Meanwhile, make the red pepper sauce. Put the pepper into a saucepan with the 1 tbsp maple syrup, vinegar and chilli flakes to taste. Cover and cook over a gentle heat for 10-15 minutes until the pepper is very tender. (There’s no need to add water – the pepper soon produces enough.) Remove from the heat and set aside."},{"Step 3":"In a mixing bowl, mash the cooked millet with the chickpeas, then mix in the Thai curry paste, coriander and spring onions. Season to taste. Form the mixture into 8 flat cakes, then coat in the flour."},{"Step 4":"Heat about ½ cm rapeseed oil in a frying pan. Add the cakes and fry on both sides until golden, crisp and heated through."},{"Step 5":"While the cakes are frying, make the mustard dip. In a small bowl, mix together the brown rice syrup/maple syrup, mustard and chilli flakes to taste."},{"Step 6":"Blot the cooked cakes on kitchen paper, then serve with the mustard dip and the red pepper sauce."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/248.jpg"}