{"id":"8","title":"Vegan quiche","difficulty":"Easy","portion":"Serves 6-8","time":"Hands-on time 35 min. Oven time 1 hour 15 min","description":"Vegan quiche? Yes, it’s possible – and very tasty, too. Tofu takes centre stage, creating the same set custard texture as traditional eggs, with plenty of umami-rich mushrooms, garlic, tahini and vegan cheese ensuring the flavour is on point.","ingredients":["1 tbsp olive oil, plus extra to grease","250g plain flour, plus extra to dust","125g salted plant butter (we used Flora salted plant butter), cubed","150g mixed mushrooms, cut into bite-size chunks","1 tbsp fresh thyme leaves","280g pack extra-firm tofu (we used Tofoo), drained and roughly chopped","150ml single soy cream alternative (we used Alpro)","75ml unsweetened soy, almond or oat milk","2 tsp roasted garlic purée","Pinch ground turmeric","4 tbsp instant mashed potato flakes (check they are dairy free)","2 tbsp tahini paste","100g smoked vegan cheese alterative, coarsely grated","Large handful baby leaf spinach","3 spring onions, white parts only, sliced","23cm loose-bottomed deep tart tin"],"method":[{"Step 1":"Heat the oven to 170°C fan/gas 5 and lightly oil the tart tin. Put the flour and plant butter in a food processor and pulse until it forms a breadcrumb-like texture. Add 4 tbsp cold water and pulse again until it forms a firm dough (you may need to add a little more water, 1 tsp at a time). Bring together into a ball."},{"Step 2":"Lightly flour your work surface and roll out the dough into a disc about 30cm in diameter. Brush off any excess flour then press into the greased tin. Using a pair of scissors, trim the excess pastry, leaving about 5mm of overhang, then press this over the edge of the tin. Use a fork to prick the pastry base all over, then line with a sheet of baking paper and fill with baking beans (or uncooked rice). Bake for 25 minutes, then remove from the oven and remove the paper and baking beans. Return to the oven for 15 minutes until the pastry is a light golden and feels sandy to the touch."},{"Step 3":"Meanwhile, heat the oil in a large frying pan over a medium-high heat, then add the mushrooms and thyme with a pinch of salt. Cook for 5-6 minutes, stirring often until deep golden. Remove from the heat."},{"Step 4":"In the food processor (there’s no need to clean it after making the pastry), whizz the tofu, soy cream, milk, garlic purée and turmeric until smooth. Season with lots of pepper, then add the potato flakes, tahini and two thirds of the cheese. Whizz until well combined."},{"Step 5":"Mix together the tofu purée with the baby spinach and half the mushrooms. Spoon into the pastry case, smoothing the top. Add the reserved cheese, spring onions and remaining mushrooms. Press them lightly into the filling. Bake for 35-40 minutes until the filling is golden and just set. Remove from the oven and leave to cool before serving."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/8.jpg"}