{"id":"38","title":"Corn on the cob peanut curry","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min. Simmering time 25 min","description":"Masterchef star Nisha Parmar shares her family recipe for corn cob and peanut curry. A creamy, vegan coconut and tomato sauce is laced with curry leaves and peanuts. “All the coastal flavours of Kenya, with Indian undertones and satay vibes, ” says Nisha.","ingredients":["4 corn on the cobs","4 tbsp vegetable oil","1 tsp cumin seeds","1 tsp mustard seeds","10 curry leaves (optional)","1 medium onion, finely diced","1 tbsp crushed garlic","1 tbsp crushed ginger","1 tsp finely chopped green chilli (or more to taste)","2 tsp ground cumin","2 tsp ground coriander","1 tsp ground turmeric","1 tsp garam masala","200g tinned tomatoes, whizzed until smooth","75g unsalted peanuts, crushed, plus extra to garnish","400g tin coconut milk","Coriander, chopped, to serve","Chapatis to serve"],"method":[{"Step 1":"Cook the corn in boiling water for 8 minutes, then drain. Once cool enough to handle, cut each cob into 4 equal pieces (for the picture they were cut bigger)."},{"Step 2":"In a large deep saucepan over a medium heat, add the oil, cumin seeds and mustard seeds, then sizzle until they crackle. Quickly add the curry leaves (if using) followed by the diced onion and a pinch of salt, then cook gently for about 10 minutes until the onion is lightly browned."},{"Step 3":"Add the garlic, ginger and green chilli, cook for 1 minute, then tip in all the ground spices and stir for another minute. Add the whizzed tomatoes, along with a splash of water if the mixture looks too dry. Simmer for 10 minutes."},{"Step 4":"Tumble in the corn cobs, scatter over the peanuts and gently stir to coat everything in the tomato masala. Pour in the coconut milk, give everything another gentle stir, then simmer for 15 minutes until both sauces are combined and you have a deep orange, creamy sauce. Season to taste with salt, garnish with fresh coriander and another sprinkling of peanuts, then serve with chapatis."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/38.jpg"}