{"id":"352","title":"Pear sorbet with pear wafers","difficulty":"Medium","portion":"Serves 8","time":"Takes 45 minutes to make, 2 hours in the oven (for the wafers), plus freezing","description":"Create a real show-stopper at your next dinner party with this pear sorbet with pear wafers recipe – it’s amazingly healthy too!","ingredients":["1kg firm, ripe dessert pears, such as Comice","100g caster sugar","Juice of 1 lemon","4 tbsp pear liqueur (Poire William, from good wine shops) or Calvados","75g caster sugar","2 dessert pears"],"method":[{"Step 1":"Make the sorbet. Slice the pears, discarding the cores, and put in a pan. Add the sugar and 100ml water. Stir to dissolve the sugar over a medium heat, then simmer for 15 minutes, until the pears are soft. Cool for 15 minutes, then tip into a blender with the lemon juice. Whizz until smooth. Cool and stir in the liqueur."},{"Step 2":"Freeze in an ice cream maker following the manufacturer’s instructions. (Or put in a freezerproof container, cover, and freeze for 2 hours. Fork over to break up the ice crystals and freeze for a further hour.)"},{"Step 3":"Meanwhile, make the pear wafers. Preheat the oven to 110°C/fan90°C/gas 1/4. Put the sugar and 50ml water in a pan over a low heat, stirring to dissolve the sugar. Increase the heat and boil for 2-3 minutes. Cool."},{"Step 4":"Use a mandolin to slice the pears very thinly (there’s no need to peel, destalk or core them). Discard any small outer slices. Coat the slices in the syrup, then lay on a lined baking tray and bake for 2 hours, turning halfway, until dried and crisp. Peel off the paper to prevent them sticking, then lay them back on the paper to cool and crisp up further."},{"Step 5":"If you haven’t made the sorbet in a machine, transfer to a processor and whizz until smooth. Put back in the container and freeze until needed."},{"Step 6":"To serve, transfer the sorbet to the fridge for 10 minutes. Scoop into bowls and decorate with a pear wafer."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/352.jpg"}