{"id":"159","title":"Sesame and black olive koulouri breads","difficulty":"Medium","portion":"Makes 8","time":"Hands-on time 55 min, oven time 15-20 min, plus rising and proving","description":"Georgina Hayden’s sesame and olive koulouri bread is fantastic as part of a mezze feast, served with her her homemade muhammara and crispy lamb, pine nut and raisin topped houmous.","ingredients":["175g good quality black olives, stoned and roughly chopped","4 spring onions, trimmed and finely chopped","Handful fresh flatleaf parsley, finely chopped","A few fresh mint sprigs, leaves picked and finely chopped","Olive oil for greasing and drizzling","7g sachet dried active yeast (we used Allinson’s","60g caster sugar","500g strong white bread flour, plus extra for dusting","1 tsp fine sea salt","150g sesame seeds"],"method":[{"Step 1":"Mix the olives, spring onions, parsley and mint in a bowl with a glug of oil. Season with black pepper."},{"Step 2":"Put the yeast, 275ml tepid water and 30g of the sugar in a measuring jug, then set aside for a few minutes to let it start to foam."},{"Step 3":" Put the flour in a large mixing bowl and stir in the salt. Make a well in the centre, pour in the yeast mixture, then use a dinner knife to mix the yeast into the flour to form a dough. Turn the dough out onto a lightly floured surface, spoon over the olive mixture and knead for 10 minutes (see tips) or until the dough springs back when you press the surface (knead it in an electric mixer fitted with a dough hook if you have one)."},{"Step 4":"Lightly grease a large clean mixing bowl, put in the dough and loosely cover with a clean tea towel. Leave in a warm place to rise for 1 hour or until doubled in size."},{"Step 5":"Meanwhile, dissolve the remaining 30g sugar in a clean measuring jug with 500ml hot water, then pour into a mixing bowl and leave to cool completely. Put the sesame seeds in a wide bowl or on a rimmed plate."},{"Step 6":"Once the dough is ready, turn out onto a lightly floured surface and knead lightly to ‘knock back’ the dough (remove large air bubbles). Divide into 8 equal pieces (see tips). Shape each piece into a disc, then tear a hole in the centre and shape to form a ring (see opposite page). Gently lower each ring into the sugar water, then put straight into the sesame seeds, making sure each ring is completely covered. As you work, put the coated koulouri on greased baking sheets. Set aside to prove for 30 minutes. Heat the oven to 200°C/180°C fan/gas 6."},{"Step 7":"Bake the koulouri for 15-20 minutes until crisp and golden all over, then remove and leave to cool or eat warm; see Make Ahead."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/159.jpg"}