{"id":"76","title":"Nut roast balls, onion gravy and greens","difficulty":"Easy","portion":"Serves 2-3","time":"Hands-on time 30 min, plus 10-12 min simmering time and 10 min oven time","description":"Clodagh McKenna’s nut roast balls with rich onion gravy and greens makes a fantastic vegan alternative to roast dinner or a simple Christmas lunch. Recipe from In Minutes by Clodagh McKenna (Kyle Books £20).","ingredients":["150g mixed nuts, such as peanuts, almonds or hazelnuts","2 tbsp olive oil, plus a drizzle","½ small red onion, finely chopped","1 garlic clove, crushed","1 celery stick, chopped","1 small carrot, grated","75g chestnut mushrooms, finely chopped","1 tsp thyme leaves","50g ground almonds","50g panko breadcrumbs","1 tbsp smooth peanut butter","3 tbsp chickpea (gram) flour","6 tbsp vegetable oil","150g leafy greens such as spring greens or kale to serve","2 tbsp olive oil","1 medium onion, very finely sliced","1 small garlic clove, crushed","1 tbsp plain flour","250ml hot vegetable stock","1½ tsp dark soy sauce","1 tsp yeast extract (eg Marmite)","1 rosemary sprig"],"method":[{"Step 1":"For the gravy, heat the oil in a medium saucepan over a medium heat. Add the onion and garlic and fry for 10-12 minutes until starting to caramelise."},{"Step 2":"Meanwhile, make the nut roast balls. Put the mixed nuts in a heatproof bowl and cover with boiling water. Leave for 2 minutes before draining."},{"Step 3":"Meanwhile, heat the olive oil in a large frying pan over a medium heat. Add the red onion, garlic, celery, carrot, mushrooms and thyme. Fry for 5-10 minutes until everything has softened and the onion and mushrooms have caramelised a little."},{"Step 4":"Add the drained nuts to the pan. Stir well and season before transferring to a food processor. Add the ground almonds, breadcrumbs, peanut butter, chickpea flour and some salt and pepper, then pulse until combined; you want some texture, but the mix should be a bit sticky. Divide into 10-12 balls."},{"Step 5":"Heat the oven to 180°C/gas 4. Heat the veg oil in a large non-stick frying pan over a medium heat. Fry the balls for 5 minutes, turning them so they brown all over. Transfer to a lined baking tray and roast in the oven for 10 minutes."},{"Step 6":"While the nut balls are in the oven, finish the gravy. Stir the flour into the caramelised onions in the pan and cook for 2 minutes until the flour smells nutty. Pour over the hot veg stock and stir in the soy sauce and yeast extract, then add the rosemary sprig. Bring to the boil, then reduce the heat and simmer for 5 minutes or until the gravy reaches a nice consistency. Remove the rosemary sprig before serving."},{"Step 7":"Steam the leafy greens for 3-5 minutes until tender. Drizzle over some extra virgin olive oil and sprinkle with salt. Serve the nut roast balls ona bed of greens with the onion gravy poured over."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/76.jpg"}