{"id":"24","title":"Leek and watercress risotto","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min","description":"This verdant leek risotto is kept fresh, light and peppery thanks to a simple watercress purée stirred through right before serving. Replacing the usual butter with oil also keeps this dish vegan.","ingredients":["2 tbsp olive oil","2 large leeks, trimmed and finely sliced","1 litre vegetable stock","80g watercress","40g spinach leaves","Bunch (30g) parsley","30g salted almonds, plus extra, roughly chopped, to garnish","5 tbsp extra-virgin olive oil, plus extra to serve","Juice ½ lemon","200g risotto rice (arborio or carnaroli)","100ml white wine"],"method":[{"Step 1":"Heat the olive oil in a large saucepan over a medium heat then add the leeks and a pinch of salt. Cook for 6 minutes, stirring occasionally, until softened."},{"Step 2":"Meanwhile, pour the stock into a separate saucepan and heat until barely simmering. Set aside a few watercress sprigs to garnish, then put the rest of it in a food processor with the spinach, parsley, almonds and extra-virgin olive oil. Whizz until a coarse paste forms, scraping down the sides as needed. Add a spoonful of stock to loosen, then stir in the lemon juice. Set aside."},{"Step 3":"Add the rice to the leeks, turn up the heat slightly and stir to coat the rice in the oil and toast the grains lightly. Pour in the wine, simmer and stir until almost completely reduced, then add a ladleful of stock. Constantly stir the rice until it has absorbed all the stock, then repeat this process, a ladleful at a time, until the rice is tender but with a slight bite in the centre. You may not need to use all the stock – start tasting when you have around 200ml of stock left. This should take around 15-20 minutes."},{"Step 4":"Tip the green puree into the rice, stir to incorporate, then remove from the heat and allow to stand for 5 minutes. Season to taste, divide between serving bowls and garnish with watercress sprigs, almonds and an extra drizzle of olive oil."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/24.jpg"}