{"id":"69","title":"Veggie steak slice","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 25 min, plus cooling, chilling and resting. Oven time 40-45 min.","description":"Our mushroom ‘steak’ slice is a vegan take on a bakery fave. An umami-rich mushroom and smoked tofu filling is wrapped in golden pastry.","ingredients":["2 tbsp olive oil","1 onion, very finely chopped","250g chestnut mushrooms, roughly chopped","100g smoked tofu, finely chopped","½ tbsp tomato purée","1 tbsp mushroom ketchup","½ tbsp brown rice miso","¼ tsp ground black pepper","150ml veg stock (not hot)","2 tbsp cornflour","500g block puff pastry (see Know How)","50ml plant-based milk or 1 large egg (for vegetarians/meat eaters), lightly beaten","Mustard, peas and chunky chips to serve (optional)"],"method":[{"Step 1":"Heat the oil in a frying pan. Add the onion and a pinch of salt and fry over a low-medium heat for 10 minutes or until softened. Whizz half the mushrooms in a food processor until very finely chopped – or finely chop by hand. Add to the pan with the rest of the mushrooms and fry for a further 10 minutes."},{"Step 2":"Add the tofu to the pan, fry for 5 minutes, then stir in the tomato purée, mushroom ketchup, miso and black pepper and cook for 1 minute. Mix 50ml of the veg stock with the cornflour in a cup. Add the remaining stock to the mushrooms and bring to a simmer, then swiftly stir in the cornflour mixture to thicken. Simmer uncovered for 5 minutes, then season to taste and set aside to cool completely."},{"Step 3":"Heat the oven to 180ºC fan/ gas 6. Lightly dust your work surface and roll out the pastry to the thickness of a £1 coin. Cut out eight 12cm x 15cm rectangles, re-rolling the trimmings as needed. Put 4 of the rectangles on a large lined baking sheet and divide the mushroom mix among them, leaving a border all round. Brush the exposed pastry with the milk/ egg. Top with another pastry rectangle, then seal the edges, crimping with a fork. Score a criss-cross pattern on top of each parcel, then chill for 30 minutes."},{"Step 4":"Brush the remaining milk/egg over each slice. Bake for 40-45 minutes or until golden brown and puffed. Rest for 10 minutes, then serve with mustard, chunky chips and peas, if you like."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/69.jpg"}