{"id":"180","title":"Vegan katsu curry","difficulty":"Medium","portion":"Serves 2","time":"Hands-on time 40 min","description":"Behold – the vegan katsu curry. We’ve given this popular Japanese dish a plant-based twist by swapping breadcrumbed chicken for tofu instead. It’s the perfect meat-free midweek treat.","ingredients":["280g block extra-firm tofu (we used The Tofoo Co Naked Tofu, from larger supermarkets)","1 tbsp soy sauce","50g panko breadcrumbs (check the label to ensure they’re vegan)","2 tbsp cornflour","Vegetable or sunflower oil to fry","Steamed rice, salad leaves and sushi ginger (from large supermarkets) to serve","Drizzle vegetable oil","½ onion, chopped","1 garlic clove, crushed","½ carrot, grated","½ small granny smith apple, peeled and grated","½ tbsp medium curry powder","1 tsp soy sauce","½ tbsp miso paste"],"method":[{"Step 1":"Stand the tofu on its end, then cut vertically into 4 even slices. Wrap each slice in kitchen paper, then stack on a baking sheet or tin. Put another sheet/tin on top, then weigh down with full cans. Leave for 5 minutes, changing the paper halfway through, to press out excess moisture from the tofu. Unwrap, put in a shallow bowl, drizzle with 1 tbsp soy sauce, then flip to coat. Set aside for 5 minutes."},{"Step 2":"For the katsu sauce, heat a drizzle of oil in a pan over a medium heat. Add the onion and fry gently until beginning to soften (about 8 minutes), then stir in the garlic and cook for minute more. Add the carrot, apple and curry powder, then cook for 3-4 minutes. Mix the 1 tsp soy sauce and the miso paste with 100ml hot water, then add to the pan. Stir and cook for 4-5 minutes, then put in a blender or food processor and whizz until smooth, adding a little extra water to loosen if necessary. Return to the pan, season with salt and pepper and keep warm over a low heat."},{"Step 3":"Meanwhile, put the breadcrumbs on a plate. Mix the cornflour with 4 tbsp cold water in a shallow bowl. Remove a slice of tofu from the soy sauce, shake off any excess, then dip first in the cornflour, then the breadcrumbs, repeating until well coated. Repeat with the remaining tofu slices, then set aside on a plate."},{"Step 4":"Heat 1cm oil in a frying pan over a medium heat. When hot, add 2 coated tofu slices and cook for 3-4 minutes on each side or until golden and crisp. Transfer to a chopping board, then repeat. Slice and serve alongside the rice, salad and sushi ginger, with the sauce spooned over."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/180.jpg"}