{"id":"127","title":"Spicy vegan dan dan noodles","difficulty":"Easy","portion":"Serves 2-3","time":"Hands-on time 30 min","description":"These vegan dan dan noodles are from the new book Speedy BOSH! – a surprisingly easy Chinese recipe with incredible flavour. It wows the taste buds with its punchy flavours, and the noodles are great at absorbing flavour.","ingredients":["1 tbsp sesame oil, plus extra if needed","125g mushrooms (we used shiitake), finely chopped","200g plant-based mince (see tip)","200g ramen noodles (or whichever noodles you prefer)","2 garlic cloves","Thumb-size piece fresh ginger","1 tsp chinese five-spice powder","3 spring onions, sliced","Chilli oil for drizzling","2 tbsp sesame seeds","2 tbsp tahini","2 tbsp soy sauce","1 tbsp rice vinegar or balsamic vinegar","1 tbsp sesame oil","1 tsp sugar","1 tsp chilli flakes"],"method":[{"Step 1":"Heat the sesame oil in a hot frying pan, then add the mushrooms and mince with a pinch of salt. Fry for about 10 minutes, stirring regularly, until you’re left with a crispy mixture (turn down the heat if you find it sticks to the pan too much)."},{"Step 2":"Meanwhile, cook the noodles according to the packet instructions. Drain and rinse with cold water."},{"Step 3":"Mix all the sauce ingredients in a bowl with 50ml cold water."},{"Step 4":"Grate the garlic into the mince pan with the ginger. Add the chinese five-spice and cook for 1 minute, adding a splash more sesame oil if the mixture looks too dry."},{"Step 5":"Pour in a third of the sauce and cook for 2 minutes until the minceis slightly browned. Remove half the mince mixture and set it aside. Reduce the heat to low. Transfer the cooked noodles to the pan and add most of the spring onions. Increase the heat, pour in the remaining sauce and stir well, adding a splash of water to loosen if necessary."},{"Step 6":"Divide the noodle mixture among 2-3 bowls. Top with the reserved crispy mince, then finish each portion with a drizzle of chilli oil, sesame seeds and the remaining spring onions."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/127.jpg"}