{"id":"102","title":"Grilled aubergine with peanut and spice crust","difficulty":"Easy","portion":"Serves 4 ","time":"Hands-on time 25 min","description":"Vivek Singh’s grilled aubergine is topped with a peanut spice crust for an easy but impressive vegan main or a side dish for an Indian feast.","ingredients":["1 tbsp poppy seeds","1 tbsp sesame seeds","1 tbsp desiccated coconut","2 tbsp vegetable oil","1 tbsp unsalted peanuts","2 garlic cloves, sliced","½ tsp chilli powder","1 tsp chaat masala spice mix","1 tsp tamarind paste","1 tbsp chopped fresh coriander","1 tbsp jaggery or dark brown sugar","4 Japanese aubergines (the long thin ones) or 8 baby aubergines, halved lengthways, flesh scored in a criss-cross","Vegetable oil for brushing","3 tbsp tamarind paste","1 tsp salt","½ tsp chilli powder","½ tsp ground turmeric","¼ tsp fennel seeds","¼ tsp carom (ajwain/ajowan) seeds","¼ tsp black onion seeds (nigella/kalonji)","2 tbsp vegetable oil"],"method":[{"Step 1":"For the peanut and spice crust, heat the oven to 100°C fan/gas ½. Toast the poppy seeds, sesame seeds and desiccated coconut separately in a dry frying pan over a medium heat for 1-2 minutes until they smell aromatic. Quickly tip them into a bowl and set aside."},{"Step 2":"Heat 1 tbsp of the oil in the pan, add the peanuts and cook, stirring, until golden. Remove from the pan and set aside to cool. Coarsely chop the peanuts and add to the toasted seeds and coconut. Heat the remaining 1 tbsp oil in the pan, add the garlic and cook, stirring, over a medium heat. As soon as it’s golden, remove from the pan and drain on kitchen paper. Cool,coarsely chop, then add to the other ingredients."},{"Step 3":"Add the remaining ingredients for the spice crust to the bowl and mix well. Spread the mixture out on a baking tray and transfer to the oven to dry for 1 hour."},{"Step 4":"To marinate the aubergines, sprinkle the cut sides with the salt, chilli powder, turmeric, fennel, carom and black onion seeds. Drizzle with the oil, then set aside for 10-15 minutes."},{"Step 5":"Put a ridged griddle pan over a high heat, then cook the aubergines, cut-side down, for 2 minutes until slightly charred and beginning to soften. Brush with more oil, turn and grill on the other side for 3 minutes more until cooked."},{"Step 6":"Transfer the aubergines to a plate with the cut sides facing upwards. Spoon over the 3 tbsp tamarind, then sprinkle generously with the peanut and spice crust to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/102.jpg"}