{"id":"247","title":"Malaysian-style vegetable and coconut curry","difficulty":"Easy","portion":"Serves 4 (makes about 190g curry paste)","time":"Hands on time 5 minutes, cooking time 30 minutes","description":"Vegetarian cookbook writer Rose Elliot’s rich coconut curry is bursting with Malaysian flavours. Serve with rice for a quick, meat-free midweek meal.","ingredients":["3 tbsp desiccated coconut","2 garlic cloves, peeled","1 onion, sliced","2 lemongrass stalks, tough outer layer removed and inside sliced","1-3 red chillies, deseeded, or chilli flakes to taste","Piece of fresh ginger the size of a large walnut, roughly sliced","1 tsp ground turmeric","1 tsp salt","1 tsp sugar","2 tbsp olive oil","400ml tin coconut milk","1 tsp tamarind paste (we like Waitrose Cooks’ Ingredients)","4 star anise","1 cinnamon stick","250g carrots, cut into thin rounds and parboiled","200g tender cabbage, such as pointed white cabbage, shredded","100g frozen petits pois, thawed","Lime juice to taste","2 tbsp chopped fresh coriander to serve","4 tbsp salted peanuts, crushed, to serve"],"method":[{"Step 1":"To make the curry paste, put the desiccated coconut into a dry frying pan and stir over a medium heat until it turns slightly golden. Remove from the heat immediately and tip it into a food processor or deep bowl suitable for using a stick blender in. You need to be speedy to make sure the coconut doesn’t overcook in the hot pan and get too brown. Add the garlic, onion, lemongrass, chillies, ginger, turmeric, salt and sugar, then whizz to a thick paste."},{"Step 2":"Heat the oil in a deep frying pan, then add the paste. Stir for a couple of minutes to cook the spices, then add the coconut milk, tamarind paste, star anise and cinnamon stick. Bring to the boil, stirring, then reduce the heat and simmer gently for 5 minutes."},{"Step 3":"Add the parboiled carrots and the cabbage to the pan, then continue to cook gently for 10 minutes or until the vegetables are tender and the sauce is thick and glossy. Add the petits pois and cook for a few minutes more to heat through."},{"Step 4":"Season to taste with salt and lime juice, then serve scattered with the coriander and crushed peanuts."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/247.jpg"}