{"id":"289","title":"Pizzette with vegan mozzarella and onion relish","difficulty":"Easy","portion":"Makes 6 pizzette","time":"Hands-on time 20 minutes, simmering time 25 minutes, oven time 10-12 minutes","description":"Serve this Italian-inspired vegan dish as a starter, or as a light meal with a salad of bitter greens.","ingredients":["190g plain flour, plus extra for dusting","½ tsp fine sea salt","3.5g fast-action dried yeast","1 tsp caster sugar","4 tbsp olive oil, plus extra for greasing and drizzling","110ml warm water","1.5kg onions, sliced","4 garlic cloves, sliced","1 tbsp soft light brown sugar","3 tbsp balsamic vinegar","200g non-dairy mozzarella, grated (from good health food shops or goodnessdirect.co.uk – if you’re not cooking for vegans, you could use regular mozzarella )"],"method":[{"Step 1":"In a mixing bowl, whisk together the flour, salt, yeast and caster sugar. Make a well in the centre and pour in 1 tbsp of the olive oil and the warm water. Bring it all together with your hands, then tip out onto a lightly oiled work surface. Knead the dough for around 10 minutes or until smooth and elastic."},{"Step 2":"Divide the dough into 6 equal pieces, then roll into balls andput on a baking tray. Cover with a clean damp tea towel and set aside while you make the onion relish."},{"Step 3":"For the onion relish, heat the remaining 3 tbsp olive oil in a large frying pan. Add the onions and garlic, then stir well to coat. Cook over a medium heat for around 20 minutes or until soft, sticky and golden, stirring occasionally."},{"Step 4":"Stir the soft light brown sugar and vinegar through the onions, then season with salt and pepper. Cook, stirring, for a few minutes more. Taste and season again."},{"Step 5":"Heat the oven to 220ºC/200ºC fan/ gas 7. On a lightly floured surface, roll out each dough ball into a 15cm disc, then arrange on 1 large or 2 small baking sheets. Divide the onion mixture equally among the discs,spreading to the edge of each. Top with grated mozzarella and drizzle with olive oil, then bake for 10-12 minutes until the base is crisp and golden, and the topping bubbling."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/289.jpg"}