{"id":"6","title":"Ultimate vegan lasagne","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 45 min. Oven time 45 min","description":"Lasagne is usually a celebration of all things meaty and creamy, with a rich ragù and creamy bechamel layered between silky pasta sheets. With just a few swaps, however, it becomes a wonderful vegan dish thrumming with Italian flavour.","ingredients":["1 large red onion","2 celery sticks","2 carrots, peeled","1 medium fennel bulb","1 tbsp olive oil","2 bay leaves","3 garlic cloves, finely chopped","250ml vegan red wine","3 tbsp tomato purée","1 tbsp balsamic vinegar","1 tsp sugar","400g tin chopped tomatoes","500g passata","350ml vegetable stock","450g frozen or fresh meat-free mince","Bunch basil, roughly chopped, with a few leaves reserved to garnish","500g pack dried egg-free lasagne sheets","4 tbsp plain flour","5 tbsp vegan spread","675ml unsweetened soya, almond or oat milk","1 heaped tsp dijon mustard","Pinch freshly grated nutmeg","2 tbsp nutritional yeast flakes","60g vegan parmesan alternative (we used Violife Prosociano), finely grated","33cm x 22cm lasagne dish"],"method":[{"Step 1":"Using a food processor, whizz the onion, celery, carrots and fennel until finely chopped but not puréed – you may need to do this in a couple of batches and scrape down the sides as needed. Heat the oil in a large deep saucepan, add the chopped vegetables with the bay leaves and garlic, then cover and cook over a medium heat for 5-6 minutes until softened. Remove the lid and cook for a few more minutes, stirring regularly, to allow some of the liquid to evaporate."},{"Step 2":"Pour in the red wine, tomato purée, balsamic vinegar and sugar, then bring to a simmer and cook for 2-3 minutes until reduced by at least half before adding the tomatoes, passata, stock and mince. Season with lots of black pepper and simmer for 15-20 minutes until the sauce is thickened. Remove from the heat and stir in the chopped basil."},{"Step 3":"Meanwhile, make the white sauce by whisking together the flour and spread in a medium saucepan over a medium heat. Whisk in the milk bit by bit, then continue to cook and whisk until thickened and smooth (about 4 minutes). Remove from the heat, season with a pinch of salt and pepper, then stir in the dijon, nutmeg, yeast flakes and cheese alternative, reserving a handful of the cheese for the top."},{"Step 4":"Spread around a quarter of the tomato sauce across the base of the lasagne dish, then top with a layer of lasagne sheets, breaking any pieces to fit, then repeat with another layer of sauce and pasta. For the third layer, spread another portion of the tomato sauce, followed by half of the white sauce. Top with pasta, then create a final layer of tomato sauce. Top with a final layer of pasta, then pour over the remaining white sauce. Scatter with the reserved cheese alternative and basil leaves."},{"Step 5":"Bake for 45-50 minutes or until a knife easily sinks through the layers in the middle of the lasagne. Leave to rest for at least 10 minutes before serving (lasagne always tastes better warm rather than hot)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/6.jpg"}