{"id":"52","title":"Prebranac (caramelised-onion baked beans)","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 30 min (plus 12 hours soaking for dried beans). Simmering time 30 min (2 hours for dried beans)","description":"Georgina Hayden’s prebranac recipe – a traditional Serbian dish of slow-cooked butter beans with caramelised onions – takes homemade baked beans to the next level. Serve with crusty bread for a filling vegan lunch or dinner.","ingredients":["500g dried butter beans or 4 x 400g jars/tins butter beans, drained and liquid reserved","1 bay leaf","100ml sunflower or olive oil","6 onions"," 8 garlic cloves","1 tbsp sweet paprika","A few flatleaf parsley sprigs (optional)","Crusty bread to serve"],"method":[{"Step 1":"If you’re cooking the beans from scratch, soak the dried beans for about 12 hours in plenty of cold water, then drain the beans and put them in a large saucepan with the bay leaf. Cover with three times as much water and put the pan over a high heat. Bring to the boil, then reduce the heat and simmer for about 1½ hours or until the beans are tender. Don’t let them boil dry. Drain the cooked beans, reserving the cooking liquid."},{"Step 2":"Heat the oven to 180°C fan/ gas 6. While the beans are cooking, peel and finely slice the onions and garlic. Put the oil in a large flameproof casserole or ovenproof pan and add the sliced onions. Fry the onions slowly over a low medium heat for about 30 minutes until golden and sticky. If the onionsstart to catch, add a splash of water. Add the sliced garlic and paprika for the final 10 minutes."},{"Step 3":"Stir in the drained beans and 750ml of the cooking liquid (or liquid from the bean jars/tins) and season generously. If you need to, make up the amount of liquid with just-boiled water from a kettle. Put the uncovered casserole in the oven and cook for around 1-1½ hours. Check the beans a couple of times during cooking and add a splash more cooking liquid (or water from the kettle) if the dish looks like it’s drying out. The end result should be golden on top, with soft and oozy beans underneath. Remove the casserole from the oven and set aside to let the beans cool, to serve warm or at room temperature. Finish by roughly chopping the parsley, if using, and scattering over the top, then serve with crusty bread. The beans are even better reheated the next day or the day after."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/52.jpg"}