{"id":"195","title":"Vegan Turkish kebabs with chilli sweet potato mash and roasted veg","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 30 min, grilling time 8-10 min","description":"This meaty favourite has been given a vegan makeover with the use of vegan mince and cannellini beans. Served with sweet potato mash and roasted veg, it makes an impressive midweek meal.","ingredients":["2 sweet potatoes, peeled and cut into 2cm chunks","Oil for drizzling and brushing","1 tbsp aleppo chilli flakes (see tips), plus extra to serve","1 fennel bulb, cut into wedges ","4 banana shallots, peeled and halved lengthways","1 tsp za’atar (see tips)","½ x 400g tin cannellini beans, drained and rinsed","300g vegan mince (we used Ocado Meat Free Mince as it has a good texture for kebabs)","2 tbsp rapeseed oil","2 banana shallots, chopped","2 tsp baharat (see tips)","½ x 400g tin cannellini beans, drained and rinsed","Bunch fresh parsley, chopped","4 tbsp tahini","8 metal skewers (or wooden ones soaked in cold water for 30 minutes)"],"method":[{"Step 1":" Heat the oven to 200°C/180°C fan/gas 6. Put the sweet potatoes on a large baking tray, toss in a glug of oil and sprinkle with the chilli flakes (see tip). Put the fennel and shallots on another tray, drizzle with oil and season. Roast everything for 25-30 minutes until tender. "},{"Step 2":"Meanwhile, put the vegan mince, oil, shallots, baharat, beans and half the parsley in a food processor, then pulse until just combined. (If you don’t have a processor, mash with 2 forks in a bowl.) Shape into 8 cylinders and thread onto skewers. Put on a baking tray and brush with oil. "},{"Step 3":"Remove the veg and heat the grill to high. Grill the kebabs for 8-10 minutes, turning halfway, until browned. Sprinkle za’atar over the fennel and shallots and return to the oven for 5 minutes."},{"Step 4":"Clean the processor, then whizz the cooked sweet potatoes with the beans and plenty of salt and pepper until smooth (or mash in a bowl). Keep warm."},{"Step 5":"Put 2 tbsp of the tahini on one plate and the remaining parsley on another. Roll each cooked kebab first in tahini, then parsley. Spoon the mash onto the plates, then top with the roasted fennel and shallots. Serve the kebabs on the side, drizzled with the rest of the tahini and sprinkled withchilli flakes."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/195.jpg"}