{"id":"66","title":"Mushroom and truffle khichadi","difficulty":"Easy","portion":"Serves 4-6 as part of a spread","time":"Hands-on time 45 min","description":"Chef Rohit Ghai’s mushroom and truffle khichadi is his signature take on the classic Indian comfort food dish of rice and lentils.","ingredients":["200g basmati rice","300g toor dal (yellow split peas)","2 tbsp vegetable oil","1 bay leaf","½ tsp cumin seeds","½ tsp grated ginger","Pinch asafoetida","100g onions, chopped","1 green chilli, slit down one side","100g (1-2) tomatoes, chopped","Pinch ground turmeric","2 tbsp vegetable oil","500g mushrooms (mix of wild or cultivated), chopped","1 tsp cumin seeds","100g onions, finely chopped","1 tbsp ginger-garlic paste","1/4 tsp ground turmeric","1 tbsp ground coriander","1/2 tsp kashmiri chilli powder (or mild chilli powder/paprika)","1/2 tsp garam masala","100g tomatoes (1-2), chopped","1 tsp truffle oil","2 tsp fresh black truffle, shaved or grated (see Know-how)","1 tbsp chopped coriander leaves"],"method":[{"Step 1":"Wash the rice and lentils at least three times in fresh water, then drain well and set aside. Heat the oil in a large saucepan set on a medium heat and add the bay leaf and cumin seeds. Cook for 1 minute, then add the grated ginger and cook until fragrant. Add the asafoetida, followed by the onions and green chilli, and cook for about 5 minutes until the onions have started to soften."},{"Step 2":"Add the tomatoes, turmeric and a large pinch of salt and cook for 3-4 minutes. Add the drained rice and lentils and give it a good stir. Add 750ml water for a thick consistency, or, if you prefer a looser, porridge-like khichadi, add 1 litre water. Stir once, check for seasoning, then leave to simmer, covered, giving the mixture the occasional stir, while you cook the mushrooms. If the mixture begins to stick, add a little more water."},{"Step 3":"For the mushrooms, heat 1 tbsp of the oil in a non-stick pan over a medium heat. Add the mushrooms in batches with a large pinch of salt and cook until golden brown all over and most of the moisture has evaporated."},{"Step 4":"Meanwhile, put another frying pan over a medium heat and add the remaining 1 tbsp oil. Add the cumin seeds and, once they begin to crackle, turn up the heat to medium-high and add the onions, cooking until caramelised, crisp and golden brown – about 7-8 minutes. Add the ginger-garlic paste, cook for 2-3 minutes, then add the turmeric, coriander, chilli powder and garam masala. Cook gently for 4-5 minutes, then add the tomatoes and simmer for about 10 minutes until soft. Add the cooked mushrooms, give everything a good stir and remove from the heat."},{"Step 5":"By this time the khichadi should be ready – it should take 20-25 minutes. Taste a spoonful of the rice and lentils to ensure they’re cooked through."},{"Step 6":"Divide the khichadi among dishes and top with the mushroom mixture. Drizzle with truffle oil, generously cover with freshly shaved or grated truffle and garnish with coriander to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/66.jpg"}