{"id":"138","title":"Pumpkin black dhal","difficulty":"Medium","portion":"Serves 6","time":"Hands-on time 20 min, oven time 35-40 min, simmering time 1 hour 15 min, plus soaking","description":"Serving vegan guests at a dinner party? This is the recipe you need. The contrast between the rich black dhal and orange roasted pumpkin is truly stunning. Drizzle in the herb and cashew sauce for a fabulous final flourish.","ingredients":["300g brown lentils","1 pumpkin or squash, about 1kg, sliced into 2cm wedges (we used a delica pumpkin)","2 red onions, cut into wedges","1 tbsp garam masala","1 tsp chilli powder","A few glugs olive oil","3 fat garlic cloves, crushed","5cm piece fresh ginger, grated","2 tbsp tomato purée","1 vegan vegetable stock pot or cube","30g vegan spread","50g unsalted cashews, toasted in a dry pan","Large handful fresh coriander, chopped","Small handful fresh mint, chopped","1 green chilli, deseeded and chopped","1 tbsp tamarind purée","Juice 1-2 lemons","Pinch chaat masala (available from larger supermarkets, Asian grocers and at souschef)"],"method":[{"Step 1":"Rinse the lentils in 3-4 changes of clean water, then drain, tip into a large pan, cover with water and soak for 30 minutes. Drain, then return to the pan and cover with fresh water. Bring to the boil, cook for 10 minutes, then reduce the heat to a simmer and cook for about 45 minutes or until just tender. Keep an eye on the lentils and if the pan gets dry, add more water. Use a metal spoon to skim off any scum that rises to the surface."},{"Step 2":"Meanwhile, heat the oven to 200°C/180°C fan/gas 6. Toss the pumpkin/squash, onions, garam masala and chilli with a good glug of oil in a large roasting tray, then cook for 35-40 minutes, turning halfway, until tender and golden."},{"Step 3":"Once cool enough to handle, transfer half the pumpkin and onions to a board. Remove and discard the pumpkin skin, then roughly chop the pumpkin flesh and onion wedges and set aside. "},{"Step 4":"Heat another glug of oil in a large pan and gently fry the garlic and ginger for about 5 minutes, then stir in the tomato purée. Add the drained lentils, the stock and just enough water to cover. Bring to a simmer and cook, uncovered, for about 15 minutes, stirring frequently, until thick and creamy. Add the chopped pumpkin and onion, along with the vegan spread (and cream if using; see tip), then mix until smooth. Taste, season with salt and pepper and keep warm."},{"Step 5":"Pound all the sauce ingredients in a pestle and mortar or whizz in a mini food processor until the mixture forms a loose paste. Season to taste."},{"Step 6":"Top the dhal with the rest of the roasted pumpkin wedges and onions, then drizzle over the herb and cashew sauce to serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/138.jpg"}