{"id":"130","title":"Rhubarb and beetroot ketchup","difficulty":"Easy","portion":"Makes one 500ml bottle (or divide between smaller jars)","time":"Hands on time 25 min, Simmering time 40 min","description":"Ketchup doesn’t have to be made from tomatoes – you can make variations of the nation’s favourite condiment from all kinds of fruit and veg.","ingredients":["½ star anise","2 tsp coriander seeds","1 tsp mustard seeds","¾ tsp black peppercorns","2 cloves","1 tbsp sunflower oil","500g rhubarb, rinsed and cut into 2-4cm pieces","250g beetroot, peeled and cut into 1-2cm pieces","1 large onion, diced","1 garlic clove","2 bay leaves","3cm piece fresh ginger, finely chopped","200g unrefined caster or granulated sugar","150ml cider vinegar","Pestle and mortar","Blender or food processor","500ml sterilised bottle or jar (or several smaller jars); Find out how to sterilise jars with this handy video."],"method":[{"Step 1":"Put the star anise, coriander seeds, mustard seeds, black peppercorns and cloves in a small dry pan set over a low heat. Toast the spices gently, shaking the pan occasionally, until they’re fragrant."},{"Step 2":"Tip the spices into a pestle and mortar, then crush to a fine texture. Put a large heavy-based pan over a medium heat and add the oil. When it’s hot, add the rhubarb and beetroot along with the onion, garlic, bay and ginger and stir well. Cook the vegetables for 6–8 minutes until softening, then add the crushed spices and cook for a further 2 minutes."},{"Step 3":"Next add the sugar and vinegar and enough water just to cover the veg. Bring everything to a simmer, then cook uncovered for 35-40 minutes. Take the pan off the heat, remove the bay leaves and leave to cool for a few minutes."},{"Step 4":"Ladle the contents of the pan into a blender or food processor, then whizz to a smooth velvety texture. Tip the purée back into the pan, set over a medium heat and bring back to a simmer. Cook the ketchup until it’s nice and thick. Taste and adjust the balance of acidity and sweetness if you think it needs it (but it shouldn’t)."},{"Step 5":"Spoon or ladle the ketchup into a clean sterilised bottle/jar (use a funnel if you have one to make the job less messy), then seal while hot. Store in a cool dark place and, once opened, refrigerate – the ketchup will keep well for up to 2 months."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/130.jpg"}