{"id":"224","title":"Vegetable tagine","difficulty":"Easy","portion":"Serves 8","time":"Hands-on time 30 min, simmering time 50 min","description":"As this hearty vegetable tagine simmers away slowly, the root vegetables gradually release their natural sweetness and become beautifully soft. This recipe also happens to be vegan.","ingredients":["Light olive or vegetable oil for frying","2 red onions, sliced into wedges","2 tsp ground coriander","2 tsp ground cumin","2 tsp ground cinnamon","2 garlic cloves, crushed","20g fresh ginger, grated","2 tbsp harissa paste","1 small butternut squash, peeled and diced into 2cm cubes","3 parsnips, cubed","2 carrots, diagonally sliced","200g dried red lentils","2 x 400g tins cherry tomatoes","1 litre vegetable stock","80g dried apricots, roughly chopped, plus extra to garnish","Large bunch fresh flatleaf parsley, leaves picked and roughly chopped"],"method":[{"Step 1":"Heat a large deep casserole (one with a lid) over a medium heat. Add a glug of oil and the onions and fry for 5-6 minutes until they start to soften. Add the ground spices and fry for a few minutes more, then add the garlic and ginger and fry for another couple of minutes, stirring."},{"Step 2":"Add the harissa paste, stir and fry for another few minutes until aromatic, then add the squash, parsnips and carrots. Turn the heat down and cook, stirring regularly, for 5-10 minutes."},{"Step 3":"Add the red lentils, cherry tomatoes and stock, then season to taste. Bring up to a simmer and add the apricots. Put the lid on the casserole and leave to simmer on a low heat for 50 minutes."},{"Step 4":"Remove the lid, stir in half the chopped parsley and check the seasoning. Test if the vegetables are tender by piercing with the tip of a round-bladed knife – if it goes in easily, they’re ready."},{"Step 5":"Serve the tagine spooned on top of a mound of warm couscous and scatter over the remaining chopped parsley."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/224.jpg"}