{"id":"150","title":"Party pani puri","difficulty":"Medium","portion":"Makes 30 pani puri","time":"Hands-on time 40 min, oven time 20 min","description":"Pani means water in Hindi and puri shells are fried crackers made from chickpea flour. Pani puri is a popular Indian street food that sees these crisp shells filled with a spiced chickpea and potato mixture, tamarind chutney and a coriander dressing.","ingredients":["400g tin chickpeas, drained and rinsed","1 large potato (around 200g), peeled and chopped into 1cm cubes ","Vegetable oil for drizzling","1 heaped tsp chaat masala – we used Waitrose Cooks’ Ingredients","⅓ bunch fresh coriander, leaves picked and roughly chopped","Seeds from 1 pomegranate","1 red onion, finely chopped","30 puri shells (see Know-how)","3 medjool dates, pitted and chopped","3 tbsp tamarind paste","3 tbsp jaggery or soft light brown sugar (see Know-how)","½ tsp ground coriander","3.5cm piece fresh ginger, peeled and grated","⅔ bunch fresh coriander","2 tbsp jaggery or soft light brown sugar (see Know-how)","3.5cm piece fresh ginger, peeled and grated","A few fresh mint sprigs, leaves picked and roughly chopped","2 green chillies, trimmed, deseeded and roughly chopped","1 tsp ground cumin","Blender, food processor or mini food processor"],"method":[{"Step 1":"Heat the oven to 210°C/190°C fan/gas 6½. Put the chickpeas and potato cubes in a roasting tray, drizzle with oil, season, then scatter over the chaat masala. Toss together and roast for 20 minutes or until golden and a little crisp. Remove from the oven and cool (see Make Ahead). Toss the cooled mixture with coriander, pomegranate seeds and red onion."},{"Step 2":"For the chutney, put the dates in the blender/food processor with 100ml freshly boiled water to soak. After 5 minutes, add the tamarind paste, 3 tbsp jaggery/sugar, ground coriander and half the ginger. Whizz until smooth, adding more water as needed to form a thick dressing. Spoon into a bowl."},{"Step 3":"For the pani, put the coriander, 2 tbsp jaggery/sugar, ginger, mint, chillies, cumin and 150ml tepid water in the blender/processor (no need to clean). Whizz until blended and smooth. Add 100-200ml more tepid water to form a thin dressing (see Make Ahead)."},{"Step 4":"Serve puri shells (see Know-how) with bowls of the chickpea mixture, tamarind chutney and coriander dressing and let guests fill their own."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/150.jpg"}