{"id":"183","title":"Roast purple sprouting broccoli with smashed white beans","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 15 min, simmering time 15-20 min, oven time 45-50 min","description":"Gill Meller’s roast purple sprouting broccoli recipe makes a wonderful sharing starter. Alternatively, serve it as a side with the Sunday roast.","ingredients":["3 tbsp olive oil, plus extra for drizzling","1 medium onion, halved and thinly sliced","4 garlic cloves, sliced","2 pinches chilli flakes","2 fresh rosemary sprigs","2 x 400g tins butter beans, drained and rinsed","300ml good quality vegetable stock","2 medium red onions","400g purple sprouting broccoli","1 tbsp sunflower seeds","1 tbsp pumpkin seeds","Juice ½ lemon"],"method":[{"Step 1":"Heat the oven to 210°C/190°C fan/gas 6½. Set a large heavy-based pan over a medium-high heat. Add 2 tbsp of the olive oil followed by the sliced onion, sliced garlic, 1 pinch of chilli flakes, the rosemary and plenty of salt and freshly ground black pepper. Cook, stirring regularly, until the onion is soft and golden around the edges (about 10 minutes). Add the beans, stir well and cook for a further 8-10 minutes."},{"Step 2":"Add the stock and bring to a simmer. After 8-10 minutes of simmering, bash the beans with a potato masher or briefly whizz them using a stick blender (discard the rosemary sprigs if using a blender). You’re looking for a creamy yet coarse texture (yes, such a thing exists) – the consistency should be spoonable and almost saucy. Taste the beans and adjust the seasoning if you need to. Keep the beans warm."},{"Step 3":"Meanwhile peel the red onions and cut each, through the root, into 8-10 wedges. Scatter over a large baking tray, season well with salt and pepper and trickle over the remaining olive oil. Tumble together to coat, transfer to the oven and roast, stirring once or twice, for 25 minutes or until the onions are soft and beginning to caramelise."},{"Step 4":"Trim and discard any coarser fibrous ends from the broccoli spears, then lay out the tender parts over and around the onions on the baking tray. Season again, sprinkle over the seeds and remaining chilli flakes and drizzle with a bit more olive oil. Return the tray to the oven and roast for 20-25 minutes more, turning once or twice during cooking, until the thickest part of the stems are tender."},{"Step 5":"To serve, spoon out the warm beans onto a large serving platter. Arrange the broccoli and red onions over the top of the beans along with all the roasted seeds. Squeeze over the lemon juice and serve straightaway."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/183.jpg"}