{"id":"282","title":"Roasted caulifower and grain salad with pomegranate","difficulty":"Easy","portion":"Serves 6 as a side","time":"Hands-on time 25 min, oven time 15-20 min, plus cooling","description":"April Bloomfield shares her vegetarian recipe which is packed with cauliflower, grains, onions, pistachios andpomegranate seeds.","ingredients":["100g golden raisins","55ml carrot juice","1 tbsp coriander seeds","1 medium cauliflower, cut into small florets","2 garlic cloves, finely chopped","3 dried piquín chillies, crumbled (see Know-how)","55ml extra-virgin olive oil, plus 5 tbsp extra","2 heaped tsp sea salt flakes, such as Maldon, plus a generous pinch","1 medium red onion (about 225g), halved and thinly sliced","500g ready-cooked grains, such as freekeh, farro, pearl barley, rye berries or brown rice","30g unsalted roasted pistachios, coarsely chopped","30g pomegranate seeds","1 tbsp finely chopped skin from a preserved lemon","2 tbsp lemon juice","Small handful fresh mint leaves","Small handful fresh flatleaf parsley sprigs"],"method":[{"Step 1":"Position a rack in the centre of the oven and heat to 230°C/210°C fan/ gas 8. Combine the raisins and carrot juice in a small bowl and set aside. Toast the coriander seeds in a small dry pan over a medium-high heat for 3-5 minutes, shaking the pan frequently, until fragrant. Grind to a powder in a pestle and mortar."},{"Step 2":"Toss the cauliflower with the garlic, chillies, 55ml of the olive oil, 1 heaped tsp of the sea salt and 2 tsp of the ground coriander in a large bowl. Spread the mixture out in a single layer in a large, heavy baking dish. Add 55ml water to the mixing bowl and swish it around to collect any stubborn spices, then pour it into the baking dish (around, not over, the cauliflower)."},{"Step 3":"Cover the dish tightly with foil, then cook in the oven for 10 minutes or until the cauliflower is tender with a slight bite and the water has all gone. Remove the foil and continue cooking for 6-8 minutes, stirring now and then, until the cauliflower is browned in spots and fully tender but not mushy. Transfer to a plate and cool to room temperature."},{"Step 4":"While the cauliflower is cooking, heat 2 tbsp of the remaining olive oil in a medium frying pan over a medium-high heat until it smokes lightly. Add the onion and cook for 15 minutes, stirring and scraping the pan often so nothing burns, or until the onion is very soft, sweet, and dark brown at the edges. Stir in the remaining 1 heaped tsp salt, then put in a large bowl and cool to room temperature."},{"Step 5":"Add the roasted cauliflower to the cooled onion. Stir in the grains, pistachios, pomegranate seeds, preserved lemon skin, lemon juice, remaining 3 tbsp oil, the reserved ground coriander seeds, the soaked raisins (including any remaining carrot juice) and a generous pinch or two more of sea salt to taste."},{"Step 6":"Mix the mint and parsley together on a chopping board, then coarsely chop. Add the herbs to the mixing bowl, toss everything with your hands, then serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/282.jpg"}