{"id":"158","title":"Green tomato chutney","difficulty":"Medium","portion":"Makes about 1.2kg ","time":"Hands-on time 30 min, simmering time about 1 hour, plus 1 month maturing ","description":"In this recipe, a classic combination of green tomatoes, apples, onions, vine fruit and spices makes for a very English chutney.","ingredients":["500g green tomatoes","450g onions, chopped into 1cm pieces","25g pickling spices (we used Bart spices)","170g light muscovado sugar","About 500ml malt vinegar","450g cooking apples, peeled, cored and chopped to 1cm pieces","170g raisins","55g sultanas","3 fat garlic cloves, finely chopped","1½ tbsp yellow mustard seeds","1 tbsp cayenne pepper","1 tsp ground ginger","½ tbsp fine salt","Large heavy-based saucepan or casserole, square of muslin, kitchen string, glass jars with lids (enough for 1.2kg chutney)"],"method":[{"Step 1":"To sterilise your jars, heat the oven to 120°C/100°C fan/gas ½. Wash the jars and lids in hot soapy water, rinse clean and put the jars to dry in the warmed oven. Turn off the oven and leave the jars in until ready to decant your chutney. Put the lids (and any rubber seals) in a pan of boiling water for 2 minutes."},{"Step 2":"Wash the tomatoes, chop into 1cm pieces, then put in a colander set over a bowl to drain for at least 10 minutes to remove any excess water."},{"Step 3":"Meanwhile, bring a pan of water to the boil, add the chopped onion and simmer for 10 minutes until softened and translucent.Drain well."},{"Step 4":"Meanwhile, lay the muslin square on your work surface. Put the pickling spices into the centre of the muslin, wrap up and tie securely with string to form a bag."},{"Step 5":"Put a large heavy-based pan or casserole over a low heat. Add the drained onions, muscovado sugar and 250ml vinegar. Stir until the sugar has completely dissolved – this will take about 8-10 minutes."},{"Step 6":"Add the chopped apples, drained tomatoes, raisins, sultanas, spices, garlic, spice bag and salt to the pan/casserole, then stir well to combine."},{"Step 7":"Bring the mixture to the boil, lower the heat and simmer gently, uncovered, for about 1 hour, stirring occasionally and adding more vinegar as the mixture reduces and thickens. (You’ll need most/all of the remaining vinegar.)"},{"Step 8":"After about 1 hour, all of the vinegar should be absorbed by the ingredients and the chutney should have become a thick, soft, semi-syrupy consistency,thick enough to leave a clear trail across the bottom on the pan when a wooden spoon in drawn across it. The chutney will continue to thicken as it cools."},{"Step 9":"Remove the spice bag and squeeze it against the insideof the pan, then mix well."},{"Step 10":"Spoon the chutney into your hot, sterilised jars, seal immediately with the lids, then store in a cool, dark place for one month to mature (see Make Ahead). Serve with crusty bread, thick-sliced ham and farmhouse cheddar."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/158.jpg"}