{"id":"193","title":"Zuppa di ceci e farro (chickpea and farro soup)","difficulty":"Medium","portion":"Serves 8-10","time":"Hands-on time 30 min, simmering time 1 hour 50 min to 2 hours 20 min, plus 8 hours soaking","description":"In this recipe farro, a nutrient-rich whole grain, is cooked in a purée of chickpeas and dressed with olive oil, herbs, garlic and chilli.","ingredients":["800g dried chickpeas","2-3 fresh sage sprigs ","4-5 fresh parsley sprigs ","2 fresh rosemary sprigs ","3 bay leaves","6 garlic cloves","200g farro","100ml extra-virgin olive oil","2 garlic cloves, sliced ","4 fresh rosemary sprigs, leaves stripped ","1 tsp chilli flakes"],"method":[{"Step 1":"Soak the chickpeas in cold water for at least 8 hours, then drain and rinse under cold water. "},{"Step 2":"Put the chickpeas in a large pan with a lid and cover with 2 litres cold water. Put the herbs in a small piece of muslin and tie into a bundle. Add to the pan with the garlic, cover with the lid and bring to the boil. Adjust the lid to slightly askew and reduce the heat to a simmer. This is important when cooking pulses because a full boil would harden instead of softening them. Cook until the chickpeas are soft (about 1½-2 hours)."},{"Step 3":"Remove the bag of herbs and discard. Using a slotted spoon, ladle out about 3 spoonfuls of chickpeas and set aside. Purée the remaining chickpeas and cooking liquid either in the pot with a stick blender or in a food processor. Bring the soup back to the boil and add the farro. Season with salt and pepper. Mix well and cook until the farro is tender (at least 20 minutes – see tip). When the farro is cooked, add the reserved whole chickpeas."},{"Step 4":"While the farro is cooking, prepare the soffritto. Heat the oil in a small frying pan, add the garlic, rosemary leaves and chilli and gently cook for about 2 minutes, stirring frequently. Add more or less chilli depending on your preference. When the garlic is golden, add the soffritto to the soup, mix well and turn off the heat."},{"Step 5":"The Tuscans put a slice of toasted and oiled ciabatta – like a bruschetta – in each bowl before ladling the soup on top. They also put a bottle of their best olive oil on the table for diners to add a few drops to their soup as a final ‘blessing’. An excellent idea."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/193.jpg"}