{"id":"11","title":"Vegan sausage casserole","difficulty":"Easy","portion":"Serves 4","time":"Hands-on time 1 hour","description":"A one-pot beauty full of earthy root veg, creamy beans and the unmistakably wintry flavour of chestnuts, this vegan sausage casserole proves you don’t need meat to create something hearty, warming and seriously tasty.","ingredients":["2 tbsp sunflower oil","8-12 vegan sausages","1 large onion, roughly chopped","3 large carrots, peeled and cut into 3cm chunks","1 small (500g) swede or celeriac, peeled and cut into 2cm chunks","3 celery sticks, thickly sliced, plus any celery leaves to garnish","2 parsnips, peeled and cut into 2cm chunks","2 bay leaves","1½ tbsp chopped fresh herbs such as thyme, rosemary and/or sage","1 tbsp tomato purée","175ml vegan red wine","1 tbsp wholegrain mustard","Pinch freshly grated nutmeg","1 vegetable stock cube","400g tin butterbeans, rinsed and drained","150g vacuum-packed cooked chestnuts"],"method":[{"Step 1":"Heat half the oil in a large casserole pan over a medium heat. Add the sausages and cook for 8-10 minutes until nicely browned all over. Set aside."},{"Step 2":"Add the remaining oil to the pan with the onion. Cook for 5 minutes until beginning to soften then add the remaining veg and cook, covered, for 10 minutes, stirring occasionally. Stir in the bay leaves, chopped herbs and tomato purée and cook for another minute."},{"Step 3":"Pour in the wine, bring to the boil and simmer for a few minutes to reduce. Season with lots of pepper, the mustard and a grating of nutmeg, then add the stock cube and pour in 500ml boiling water. Don’t worry if it doesn’t completely cover the veg. Pop the lid back on and allow to simmer gently for 15 minutes."},{"Step 4":"Stir in the butterbeans and chestnuts, then nestle the sausages on top. Cover and cook for a further 12-15 minutes until everything is tender and the parsnips have started to break down and thicken the sauce. Add a splash more hot water if it’s too thick. Stir through the celery leaves and serve."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/11.jpg"}