{"id":"80","title":"Whole roasted satay cauliflower","difficulty":"Easy","portion":"Serves 4 as a main or 6 as a side","time":"Hands-on time 15 min, plus 1 hour oven time","description":"Marcus Wareing’s whole roasted satay cauliflower elevates the humble veg to star ingredient. The moreish satay marinade works with many dishes – it’s great with chicken. This recipe is from Marcus’ Kitchen by Marcus Wareing (Harper Collins £22).","ingredients":["1 large cauliflower, outer leaves removed and stalk trimmed","50g unsalted peanuts, toasted in a dry pan, then chopped","¼ bunch coriander, leaves and tender stems chopped","3 garlic cloves, peeled","Thumb-size piece fresh ginger, peeled","1 red onion, roughly chopped","1 tsp salt","1 tbsp ground cumin","1 tbsp ground coriander","1 tbsp ground turmeric","1 tbsp garam masala","½ tsp hot chilli powder (or to taste)","3 tbsp kecap manis (sweet soy sauce)","100g chunky peanut butter","400ml tin coconut milk","1 tbsp soy sauce","1 tbsp rice wine vinegar"],"method":[{"Step 1":"Heat the oven to 160°C fan/gas 4. First, make the satay marinade. Put the garlic, ginger, onion and salt in a food processor and whizz to a coarse paste. Add the rest of the ingredients for the marinade and whizz until smooth."},{"Step 2":"Make sure the cauliflower can sit flat on its stalk, then place it in a large, deep casserole. Pour the satay marinade over the cauliflower and cover the dish with the lid or foil. Put in the oven and bake for 1 hour, basting it regularly during the cooking. Halfway through cooking, add 100ml water to ensure it doesn’t dry out."},{"Step 3":"Once baked, the cauliflower should be soft. Check it by piercing it with a knife – there should be no resistance. If the cauliflower isn’t quite ready, pop it back in the oven for 10 minutes and check again."},{"Step 4":"To finish the cauliflower, sprinkle it with the chopped toasted peanuts and coriander and serve it from the casserole (or transfer it to a serving plate if you prefer, sprinkling it with the peanuts and coriander once it’s on the plate)."}],"image":"https://apipics.s3.amazonaws.com/vegan_api/80.jpg"}